window["fronts"] = [ {
    title: "Курская битва",
    missions: [ "Отступать некуда", "Засада в туннеле", "Один путь", "Скрытая угроза", "Город тишины", "Железная дорога", "Поезд спасения" ],
    sectors: [ [ 10, 10, 10, 10, 10, 10, 10, 10, 20 ], [ 15, 25, 15, 20, 25, 20, 35, 45 ], [ 20, 35, 25, 20, 30, 25, 50 ], [ 25, 30, 20, 30, 25, 20, 25, 35 ], [ 20, 25, 30, 15, 20, 30, 25, 15, 40 ], [ 20, 30, 25, 20, 30, 35, 45 ], [ 40, 30, 35, 30, 40, 35, 50 ] ],
    reward: [ {
        experience: 100,
        encryptions: 5,
        coins: 500
    }, {
        experience: 400,
        encryptions: 5,
        coins: 1200
    }, {
        experience: 410,
        encryptions: 5,
        coins: 1230
    }, {
        experience: 420,
        encryptions: 5,
        coins: 1260
    }, {
        experience: 440,
        encryptions: 5,
        coins: 1320
    }, {
        experience: 410,
        encryptions: 5,
        coins: 1230
    }, {
        experience: 520,
        encryptions: 5,
        coins: 1560
    } ]
}, {
    title: "Сталинградская битва",
    missions: [ "Атака из леса", "Место отгрузки", "Таинственная река", "Точка доступа", "Сквозь снег", "Закрытая зона", "Перекрёсток" ],
    sectors: [ [ 30, 25, 35, 30, 40, 35, 30, 55 ], [ 25, 30, 25, 45, 30, 40, 50 ], [ 35, 30, 40, 25, 35, 30, 60 ], [ 30, 35, 30, 35, 30, 40, 50 ], [ 40, 30, 45, 25, 30, 25, 60 ], [ 30, 35, 25, 45, 30, 35, 30, 55 ], [ 30, 35, 40, 25, 35, 45, 30, 70 ] ],
    reward: [ {
        experience: 620,
        encryptions: 10,
        coins: 1740
    }, {
        experience: 545,
        encryptions: 10,
        coins: 1525
    }, {
        experience: 565,
        encryptions: 10,
        coins: 1585
    }, {
        experience: 555,
        encryptions: 10,
        coins: 1555
    }, {
        experience: 565,
        encryptions: 10,
        coins: 1585
    }, {
        experience: 630,
        encryptions: 10,
        coins: 1770
    }, {
        experience: 690,
        encryptions: 10,
        coins: 1930
    } ]
}, {
    title: "Оборона Севастополя",
    missions: [ "Затопленный груз", "Пролив", "Залечь на дно", "Два берега", "Доставка из штаба", "Площадь возмездия", "Портовый город" ],
    sectors: [ [ 35, 45, 30, 35, 25, 20, 40, 70 ], [ 40, 30, 25, 35, 40, 45, 35, 80 ], [ 35, 45, 30, 55, 25, 40, 20, 65 ], [ 40, 50, 40, 35, 30, 25, 30, 75 ], [ 30, 25, 30, 35, 45, 50, 30, 60 ], [ 35, 45, 40, 35, 25, 30, 40, 70 ], [ 50, 60, 55, 30, 45, 25, 35, 50 ] ],
    reward: [ {
        experience: 730,
        encryptions: 15,
        coins: 1920
    }, {
        experience: 800,
        encryptions: 15,
        coins: 2120
    }, {
        experience: 760,
        encryptions: 15,
        coins: 2020
    }, {
        experience: 785,
        encryptions: 15,
        coins: 2085
    }, {
        experience: 740,
        encryptions: 15,
        coins: 1960
    }, {
        experience: 775,
        encryptions: 15,
        coins: 2055
    }, {
        experience: 845,
        encryptions: 15,
        coins: 2245
    } ]
}, {
    title: "Оборона Брестской крепости",
    missions: [ "Захват", "Шпионский мост", "В тылу врага", "Занять высоту", "Надзорная вышка", "Укрепление", "Штурм крепости" ],
    sectors: [ [ 55, 50, 50, 40, 45, 40, 40, 85 ], [ 60, 40, 55, 40, 60, 40, 60, 70 ], [ 60, 60, 45, 55, 70, 50, 75 ], [ 55, 55, 60, 55, 50, 45, 40, 80 ], [ 45, 50, 50, 60, 60, 50, 55, 70 ], [ 45, 55, 45, 50, 70, 45, 50, 75 ], [ 50, 50, 60, 60, 50, 45, 55, 55, 80 ] ],
    reward: [ {
        experience: 1060,
        encryptions: 20,
        coins: 2680
    }, {
        experience: 1110,
        encryptions: 20,
        coins: 2810
    }, {
        experience: 1085,
        encryptions: 20,
        coins: 2750
    }, {
        experience: 1150,
        encryptions: 20,
        coins: 2910
    }, {
        experience: 1150,
        encryptions: 20,
        coins: 2910
    }, {
        experience: 1140,
        encryptions: 20,
        coins: 2880
    }, {
        experience: 1320,
        encryptions: 20,
        coins: 3340
    } ]
} ];

window["levels"] = [ 0, 1e3, 3e3, 6e3, 1e4, 15e3, 21e3, 28e3, 36e3, 45e3, 55e3, 66e3, 78e3, 91e3, 105e3, 12e4, 136e3, 153e3, 171e3, 19e4, 21e4, 231e3, 253e3, 276e3, 3e5, 325e3, 351e3, 378e3, 406e3, 435e3, 465e3, 496e3, 528e3, 561e3, 605e3, 64e4, 676e3, 713e3, 751e3, 79e4, 83e4, 871e3, 913e3, 956e3, 1e6, 1045e3, 1091e3, 1138e3, 1186e3, 1235e3, 1285e3, 1336e3, 1388e3, 1441e3, 1495e3, 155e4, 1606e3, 1663e3, 1721e3, 178e4, 184e4, 1901e3, 1963e3, 2026e3, 209e4, 2155e3, 2221e3, 2288e3, 2356e3, 2425e3, 2495e3, 2566e3, 2638e3, 2711e3, 2785e3, 286e4, 2936e3, 3013e3, 3091e3, 317e4, 325e4, 3331e3, 3413e3, 3496e3, 358e4, 3665e3, 3751e3, 3838e3, 3926e3, 4015e3, 4105e3, 4196e3, 4288e3, 4381e3, 4475e3, 457e4, 4666e3, 4763e3, 4861e3, 496e4, 506e4, 5161e3, 5263e3, 5366e3, 547e4, 5575e3, 5681e3, 5788e3, 5897e3, 6007e3, 6118e3, 623e4, 6343e3, 6457e3, 6572e3, 6688e3, 6805e3, 6923e3, 7042e3, 7162e3, 7283e3, 7405e3, 7528e3, 7652e3, 7777e3, 7903e3, 803e4, 8158e3, 8287e3, 8417e3, 8548e3, 868e4, 8813e3, 8947e3, 9082e3, 9218e3, 9355e3, 9493e3, 9632e3, 9772e3, 9913e3, 10055e3, 10198e3, 10342e3, 10487e3, 10633e3, 1078e4, 10928e3, 11077e3, 11227e3, 11378e3, 1153e4, 11683e3, 11837e3, 11992e3, 12148e3, 12305e3, 12463e3, 12622e3, 12782200, 12943e3, 13105e3, 13268e3, 13432e3, 13597e3, 13763e3, 1393e4, 14098e3, 14267e3, 14437e3, 14608e3, 1478e4, 14953e3, 15127e3, 15302e3, 15478e3, 15655e3, 15833e3, 16012e3, 16192e3, 16373e3, 16555e3, 16738e3, 16922e3, 17107e3, 17293e3, 1748e4, 17668e3, 17857e3, 18047e3, 18238e3, 1843e4, 18623e3, 18817e3, 19012e3, 19208e3, 19405e3, 19603e3, 19802e3, 20002e3, 20203e3, 20405e3, 20608e3, 20812e3, 21017e3, 21223e3, 2143e4, 21638e3, 21847e3, 22057e3, 22268e3, 2248e4, 22693e3, 22907e3, 23122e3, 23338e3, 23555e3, 23773e3, 23992e3, 24212e3, 24433e3, 24655e3, 24878e3, 25102e3, 25327e3, 25553e3, 2578e4, 26008e3, 26237e3, 26467e3, 26698e3, 2693e4, 27163e3, 27397e3, 27632e3, 27868e3, 28105e3, 28343e3, 28582e3, 28822e3, 29063e3, 29305e3, 29548e3, 29792e3, 30037e3, 30283e3, 3053e4, 30778e3, 31027e3, 31277e3, 31528e3, 3178e4, 32033e3, 32287e3, 32542e3 ];

window["bosses"] = [ {
    short_name: "Йенеке",
    default_name: "Эрвин Йенеке",
    full_name: "Эрвин Густав Йенеке",
    descr: "<p>Йенеке (Jeneke) Эрвин Густав (22.04.1890г., Фререн - 03.07.1960г., Кёльн) военачальник, генерал-полковник инженерных войск. 27.03.1911г. вступил в инженерные войска. В 1912г. произведен в лейтенанты 10-го инженерного батальона. Участник 1-й мировой войны. После демобилизации армии остался в рейхсвере, служил в инженерных войсках. С 1936г. начальник штаба «W», который ведал делами легиона «Кондор», воевавшего в Испании. С 10.11.1938г. начальник штаба инспекции крепостей. С началом войны вновь переведен в полевые инженерные войска; во время Польской компании - обер-квартирмейстер штаба 8-й армии. Участник Французской компании. С 01.05.1940г. по 31.01.1942г. обер-квартирмейстер командования вермахта в Бельгии и Северной Франции. Одновременно с 01.11.1941г. - в главном командовании на Западе. 01.02.1942г. назначен командиром 389-й пехотной дивизии в Праге, готовящейся к отправке на советецко-германски и фронт. В мае 1942г. дивизия вошла в состав 6-й армии, наступавшей в направлении на Сталинграда. Был хорошо знаком с командующим армией ген. Ф. Паулюсом, который после отставки генерала В. фон Шведлера в сентябре 1942г. назначил его командиром 4-го армейского корпуса (официально утвержден 01.11.1942г.). После окружения армии настаивал на осуществлении прорыва. 10.09.1942г. награжден Рыцарским крестом. Железного креста. В январе 1943г. был ранен шрапнелью (по др. данным симулировал ранение) и 22.01.1943г. эвакуирован из котла. С 01.04.1943г. командир 82-го армейского корпуса, расквартированного во Франции. С 01.06.1943г. командующий 17-й армией, действовавшей на Кавказе и в Крыму. Советские войска постоянно теснили его части, и Йенеке настаивал на эвакуации и даже начал к ней готовиться. После того как в ноябре 1943 советские войска отрезали Крым, Йенеке попытался настаивать на эвакуации морем, но вновь получил отказ. 01.05.1944г. заменен генералом К. Альмендингером, а 12 мая, ранее возглавляемая им армия, была уничтожена. Гитлер приказал военному трибуналу рассмотреть дело Йенеке и выяснить, сделал ли тот все от него зависящее для спасения погибшей армии, но трибунал так и не состоялся. В январе 1945г. направил письмо лично А. Гитлеру в котором обрисовал в деталях катастрофическое положение Германии, за что 31.01 1945г. был исключен из списков вермахта. 11.06.1945г. арестован советскими войсками в Нидершёне. 23.11.1947г. военным трибуналом Черноморского флота приговорен к 25 годам заключения в лагерях. 12.10.1955г. в качестве неамнистированного преступника передан властям ФРГ и освобожден.</p>",
    health: 1e6,
    dbf: {
        price: 1e3,
        min_sut: 110,
        max_sut: 200,
        start: 1e5,
        remains: 5e5
    },
    leave: {
        count: 10,
        resource: "tokens"
    },
    reward: {
        experience: 100,
        encryptions: 10
    },
    additional_reward: false
}, {
    short_name: "Рундштедт",
    default_name: "Герд фон Рундштедт",
    full_name: "Карл Рудольф Герд фон Рундштедт",
    descr: "<p>Рундштедт, Герд фон (Rundstedt), (1875-1953гг.), генерал-фельдмаршал германской армии. В 1932г. в звании генерал-оберста (генерал-полковник) он был назначен командующим 1-й армейской группой в Берлине. В феврале 1938г. вместе с четырнадцатью другими высокопоставленными офицерами фон Рундштедт был уволен из вооруженных сил в результате дела Бломберга-Фрича. В августе 1939г. его снова вернули в армию в качестве начальника штаба группы армий «Юг». В мае-июне 1940г. фон Рундштедт являлся начальником штаба группы армий на Западном фронте. На этом посту на нем лежала основная ответственность за проведение Французской кампании. В знак признания его заслуг 19 июля 1940г. Гитлер присвоил фон Рундштедту звание генерал-фельдмаршала.</p><p>Во время нападения на Советский Союз фон Рундштедт командовал группой армий «Юг». В его задачи входило выход к Черному морю, захват Ростова и Майкопских нефтяных месторождений, а затем бросок на Сталинград. Ввиду разногласий с Гитлером по поводу стратегии боевых действий в России фон Рундштедт был снят с должности 12 декабря 1941г. 1 марта 1942г. он был назначен начальником штаба западной группы войск вместо генерала Эрвина фон Вицлебена. Этот пост он занимал с короткими перерывами до марта 1945г. 2 июля 1944г. Гитлер, взбешенный тем, что фон Рундштедт не сумел предотвратить вторжение англо-американских войск в Нормандию, временно отстранил его от должности, назначив на его место фельдмаршала Гюнтера Ханса фон Клюге.</p><p>В начале 1942г. фон Рундштедту стало известно о заговоре высокопоставленных офицеров с целью отстранения Гитлера от власти. Хотя фон Рундштедт никогда не был убежденным нацистом, он отказался принять участие в заговоре, заявив генералу Эрвину Роммелю: «Вы молоды и популярны среди народа. Вам надо осуществлять это». После провала Июльского заговора 1944г. верный присяге на верность фюреру фон Рундштедт председательствовал на офицерском суде чести, разбиравшем степень вины заговорщиков, и изгонял их из армии еще прежде, чем они представали перед Народным трибуналом. Лебединой песней фон Рундштедта была наступательная операция в Арденнах в декабре 1944г., которой так и не удалось остановить продвижение союзнических войск.</p>",
    health: 3e6,
    dbf: {
        price: 2e3,
        min_sut: 310,
        max_sut: 400,
        start: 3e5,
        remains: 15e5
    },
    leave: {
        count: 20,
        resource: "tokens"
    },
    reward: {
        experience: 300,
        encryptions: 10
    },
    additional_reward: false
}, {
    short_name: "Манштейн",
    default_name: "Эрих фон Манштейн",
    full_name: "Фриц Эрих Георг Эдуард фон Манштейн",
    descr: "<p>Манштейн (Manstein) Эрих фон Левински (Lewinski) (24.11.1887г., Берлин, — 10.06.1973г., Мюнхен), один из нацистских военных преступников, генерал-фельдмаршал, представитель прусской военной  аристократии, активный участник разработки и осуществления фашистских агрессивных планов во 2-й мировой войне. Военную службу начал в 1906г. Окончил Военную академию (1914г.). Участник 1-й мировой войны, после которой служил в рейхсвере. В 1935—38гг. начальник операт.ивногоуправления и 1-й оберквартирмейстер генштаба сухопутных войск. Участвовал в оккупации Судетской обл., в агрессии против Польши. В 1939г. — февраль - начальник штаба группы армий «Юг», затем группы армий «А». Манштейн — один из авторов плана разгрома Франции ударом через Арденны. В военных действиях против Франции (1940г.) командовал 38-м корпусом. Во время нападения фашистской Германии на СССР, Манштейн был командиром 56-го танкового корпуса (группа армий «Север»), участвовал в наступлении на Ленинград. С сентября 1941г. командовал 11-й армией, действовавшей в Крыму. В августе 1942г. осуществлял общее руководство боевыми действиями немецко-фашистских войск под Ленинградом. Командуя группой армий «Дон» (нояб.1942г. — февр.1943г.), Манштейн безуспешно пытался деблокировать 6-ю армию, окружённую под Сталинградом. С февраля 1943г. командовал группой армий «Юг», терпевшей поражения в ходе Курской битвы и в др. сражениях. При отступлении широко практиковал тактику «выжженной земли». За неудачи на фронте Манштейн в марте 1944г. был отстранён от командования и зачислен в резерв. После 2-й мировой войны, в 1950г., Манштейн за совершённые им военные преступления был приговорён британским военным трибуналом к 18 годам тюрьмы. В 1953г. освобождён. Манштейн был почётным членом ряда реваншистских организаций. В выпущенных мемуарах пытался оправдать свои преступления необходимостью выполнения солдатского долга, а военные неудачи на Восточном фронте — бездарностью Гитлера.</p>",
    health: 5e6,
    dbf: {
        price: 3e3,
        min_sut: 510,
        max_sut: 600,
        start: 5e5,
        remains: 25e5
    },
    leave: {
        count: 30,
        resource: "tokens"
    },
    reward: {
        experience: 600,
        encryptions: 10
    },
    additional_reward: false
}, {
    short_name: "Альмендингер",
    default_name: "Карл Альмендингер",
    full_name: "Карл Альмендингер",
    descr: "<p>Карл Альмендингер (нем. Karl Allmendinger; 3 февраля 1891г. — 2 октября 1965г.) — немецкий офицер, участник Первой и Второй мировых войн, генерал пехоты, кавалер Рыцарского креста с Дубовыми листьями.<br />С октября 1939г. — начальник штаба 5-го армейского корпуса.<br />В мае-июне 1940г. участвовал во Французской кампании. Награждён планками к Железным крестам обеих степеней (повторное награждение).<br />С августа 1940г. — генерал-майор. С 25 октября 1940г. — командир 5-й пехотной дивизии.<br />С 22 июня 1941г. — участвовал в Великой Отечественной войне. Бои в Белоруссии. В июле 1941г. награждён Рыцарским крестом (№ 365). Затем бои на Московском направлении.<br />С августа 1942г. — генерал-лейтенант. В декабре 1942г. — награждён Дубовыми листьями к Рыцарскому кресту.<br />В январе-июне 1943г. — преподаватель на курсах подготовки командиров дивизий (в Берлине). С апреля 1943г. — в звании генерал пехоты. С июля 1943г. — командующий 5-м армейским корпусом (на Кавказе).<br />С мая 1944г. — вместо снятого А. Гитлером 1 мая Эрвина Йенеке командующий 17-й армией, которая неудачно обороняла Крым и откатилась к Севастополю.10 мая эвакуировался морем вместе со штабом на шнельботе. С 25 июля 1944г. — в командном резерве.<br />16 мая 1945г. — взят в плен американцами (отпущен на свободу в декабре 1947г.).</p>",
    health: 2e7,
    dbf: {
        price: 5e3,
        min_sut: 1100,
        max_sut: 1500,
        start: 2e6,
        remains: 12e6
    },
    leave: {
        count: 40,
        resource: "tokens"
    },
    reward: {
        experience: 1e3,
        encryptions: 10
    },
    additional_reward: false
}, {
    short_name: "Клейст",
    default_name: "Эвальд фон Клейст",
    full_name: "Пауль Людвиг Эвальд фон Клейст",
    descr: "<p>Клейст (Kleist) Эвальд Пауль Людвиг фон (08.08.1881г., Браунфельс-на-Лане, Гессен - 15.10.1954г., Владимир, СССР) военачальник, генерал-фельдмаршал. Окончил военное училище. В марте 1900г. вступил фаненюнкером в 3-й пеший артиллерийский полк, в 1901г. произведен в лейтенанты. В 1909г. окончил кавалерийское училище в Ганновере, в 1912г. - Военную академию. Участник 1-й мировой войны на Восточном и Западном фронтах, командир эскадрона, офицер Генерального штаба. В 1919г. после демобилизации армии остался служить в рейхсвере. Убежденный монархист, не симпатизировал нацистам. С 1920г. служил в кавалерии, с 1923г. в Ганноверском кавалерийском училище. С 1927г. начальник штаба 2-й кавалерийской дивизии (Бреслау), с 1928г. - 3-й пехотной дивизии. С 1931г. командир 9-го пехотного полка (Потсдам). 01.02.1932г. сменил генералаГ. фон Рундштедта на посту командира 2-й кавалерийской дивизии. 01.05.1935г. дивизия Клейста была расформирована, а на базе ее штаба создано командование 8-го армейского корпуса и 8-го военного округа в Бреслау. Клейст был назначен их командиром. Во время «чистки» высшего военного командования, после дела «Бломберга-Фрича», Клейст 04.02.1938г. уволен в отставку. В августе 1939г. вернулся в строй и назначен командиром 22-го армейского корпуса, представлявшего собой танковую группу. В составе 14-й армии генерала В. Листа участвовал в Польской компании; захватил нефтедобывающий район под Львовом. Участвовал в боях на Сомме, в Бордо и, совершив бросок к Ла-Маншу, завершил образование Дюнкерского котла. Перед началом войны с СССР группа Клейста (3-й и 48-й танковые, 4-й моторизованный корпуса) вошла в состав группы армий «Юг» генерал-фельдмаршала Г фон Рунштедта. 5 июля начал наступление на «линию Сталина» на старой советской границе, прорвав которую взял 10 июля Житомир. С 21.11.1942г. командующий группой армий «А», в которую кроме 1-й танковой входила также 17-я армия генерала Р. Руоффа. В январе 1943г. советские войска прорвали оборону войск Клейста, но А. Гитлер лишь в самый последний момент разрешил Клейсту отступать, и тому удалось удержать Кубань. На территори, подконтрольной группе армий «А», Клейст проводил целенаправленную политику по привлечению на сторону вермахта представителей различных народов СССР. В его войсках по некоторым данным состояло более 800 тысяч человек (карачаевцы, кабардины, осетины, ингуши, азербайджанцы, калмыки, казаки и другие). Старался гуманно обращаться с местным населением, из-за чего вскоре у Клейста возник конфликт с рейхскомиссаром Украины Э. Кохом и генеральным уполномоченным по использованию рабочей силы Ф. Заукелем. Запретил частям СС проводить операции на подконтрольной ему территории.</p><p>03.09.1943г. добился от Гитлера разрешения эвакуировать Кубань, чем спас более 300 тыс. человек. После оставления Крыма и отступления на Южный Буг Клейст 31 марта был вызван в ставку, награжден Рыцарским крестом с дубовыми ветвями и мечами и уволен в отставку, а в апреле группа армий «А» была переименована в группу армий «Южная Украина», а ее командующим назначен Ф. Шёрнер. После покушения на Гитлера 20.07.1944г. был арестован гестапо. Клейст обвинялся в том, что знал о существовании заговора и не сообщил об этом. Однако затем он был освобожден. 25.04.1945г. арестован американскими войсками и вывезен в Лондон, в качестве свидетеля привлечен к работе Международного военного трибунала в Нюрнберге. В сентябре 1946г. передан Югославии и в августе 1948г. приговорен югославским народным судом к 15 годам каторжных работ. В марте 1949г. передан СССР. Содержался во внутренней тюрьме МГБ, Бутырской и Лефортовской тюрьмах, а затем во Владимирской тюрьме. 21.02.1952г. Военной коллегией Верховного суда СССР приговорен к 25 годам заключения в лагерях. По официальной версии умер в лагере от недостаточности митрального клапана.</p>",
    health: 5e7,
    dbf: {
        price: 7e3,
        min_sut: 2100,
        max_sut: 2500,
        start: 5e6,
        remains: 3e7
    },
    leave: {
        count: 50,
        resource: "tokens"
    },
    reward: {
        experience: 1500,
        encryptions: 10
    },
    additional_reward: false
}, {
    short_name: "Шёрнер",
    default_name: "Фердинанд Шёрнер",
    full_name: "Фердинанд Шёрнер",
    descr: "<p>Шёрнер, Фердинанд (Schoerner), (1892-1973гг.), генерал-фельдмаршал германской армии. Участник 1-й мировой войны, был награжден медалью «За доблесть». Принимал участие в подавлении «Пивного путча» 1923г., хотя и симпатизировал нацистскому движению и состоял членом нескольких националистических организаций. Впоследствии стал ярым поклонником Гитлера и одним из самых преданных ему высокопоставленных офицеров. В 1942-43гг. Шёрнер командовал 19-м горно-стрелковым корпусом в Лапландии, затем, до 1 февраля 1944г., 40-м танковым корпусом, воевавшим на Украине. 7 апреля 1944г. он был назначен главнокомандующим группой армий «Юг», 25 июля 1944г. - главнокомандующим группой армий «Север». 16 января 1945г. Шёрнер стал главнокомандующим центральной группировкой войск. В последние дни 2-й мировой войны Гитлер присвоил Шёрнеру звание генерал - фельдмаршала и назначил его командовать уже почти разгромленной группировкой войск, прикрывавшей Берлин. После того, как последние его войска капитулировали, Шёрнер вылетел в американскую зону оккупации в Австрии, откуда он был выдан советскому командованию. Он был приговорен к 10 годам заключения, освобожден в апреле 1955г., оказался первым среди германских фельдмаршалов, кому было разрешено вернуться в Зап. Германию. В 1957г. мюнхенский суд вновь приговорил Шёрнера к 4 с половиной годам тюрьмы как виновного в гибели тысяч немецких солдат.</p>",
    health: 1e8,
    dbf: {
        price: 1e4,
        min_sut: 3100,
        max_sut: 3500,
        start: 1e7,
        remains: 65e6
    },
    leave: {
        count: 60,
        resource: "tokens"
    },
    reward: {
        experience: 2100,
        encryptions: 10
    },
    additional_reward: true,
    additional_reward_stages: [ {
        damage: {
            amount: 2,
            hit: "weapon_6"
        },
        reward: {
            amount: 1e3,
            resource: "experience"
        }
    }, {
        damage: {
            amount: 3,
            hit: "weapon_6"
        },
        reward: {
            amount: 1e3,
            resource: "coins"
        }
    }, {
        damage: {
            amount: 4,
            hit: "weapon_6"
        },
        reward: {
            amount: 20,
            resource: "encryptions"
        }
    } ]
}, {
    short_name: "Хубе",
    default_name: "Ганс Хубе",
    full_name: "Ганс-Валентин Хубе",
    descr: "<p>Ганс-Валентин Ху́бе (нем. Hans-Valentin Hube; 29 октября 1890г., Наумбург — 21 апреля 1944г., Айнринг) — немецкий военачальник, участник Первой и Второй мировых войн, генерал-полковник. Кавалер Рыцарского креста с Дубовыми листьями, Мечами и Бриллиантами.<br />18 октября 1939г. полковник Хубе назначен командиром 3-й пехотной дивизии (Западный фронт).1 июня 1940г. произведён в генерал-майоры. 4 июня 1940г. был назначен командиром 16-й пехотной дивизии (армейский резерв на Западном фронте). В августе 1940г. дивизия переформирована в 16-ю танковую.</p><p>В составе группы армий «Юг» 16-я танковая дивизия под командованием генерал-майора Хубе участвовала в операции «Барбаросса» (война против СССР) — в районе Дубно, Житомир, Умань, Киев, Таганрог.<br />1 августа 1941г. награждён Рыцарским крестом. В январе 1942г. — награждён Дубовыми листьями (№ 62) к Рыцарскому кресту.<br />В 1942г. 16-я танковая дивизия воевала в районе Харьков, Сталинград. С апреля 1942г. — Хубе в звании генерал-лейтенанта.<br />С сентября 1942г. — командующий 14-м танковым корпусом.1 октября 1942г. — генерал танковых войск. В декабре 1942г. награждён Мечами (№ 22) к Рыцарскому кресту с Дубовыми листьями. По приказу фюрера в январе 1943г. Хубе покинул Сталинградский котёл на самолёте.<br />В марте 1943г. Хубе вновь формирует 14-й танковый корпус во Франции. В июне 1943г. корпус направляется в Италию.<br />В июле—августе 1943г., во время высадки американских и британских войск в Сицилии, Хубе командует там всеми сухопутными силами.<br />17 августа 1943г. Хубе отозван в командный резерв, в распоряжение верховного командования сухопутных сил (ОКХ).<br />15 октября 1943г. Хубе назначен командующим 1-й танковой армией (южный участок Восточного фронта).<br />27 марта 1944г. 1-я танковая армия была окружена в районе Каменец-Подольска, однако 15 апреля 1944г. смогла выйти из окружения.<br />20 апреля 1944г. Хубе был произведён в генерал-полковники и награждён Бриллиантами (№ 13) к Рыцарскому кресту с Дубовыми листьями и Мечами, а на следующий день он погиб в авиакатастрофе во время полёта на Heinkel He 111 из Зальцбурга в Берлин.</p>",
    health: 25e7,
    dbf: {
        price: 15e3,
        min_sut: 4100,
        max_sut: 4500,
        start: 25e6,
        remains: 16e7
    },
    leave: {
        count: 70,
        resource: "tokens"
    },
    reward: {
        experience: 2800,
        encryptions: 10
    },
    additional_reward: true,
    additional_reward_stages: [ {
        damage: {
            amount: 3,
            hit: "weapon_6"
        },
        reward: {
            amount: 1500,
            resource: "experience"
        }
    }, {
        damage: {
            amount: 4,
            hit: "weapon_6"
        },
        reward: {
            amount: 1500,
            resource: "coins"
        }
    }, {
        damage: {
            amount: 5,
            hit: "weapon_6"
        },
        reward: {
            amount: 30,
            resource: "encryptions"
        }
    } ]
}, {
    short_name: "Вёлер",
    default_name: "Отто Вёлер",
    full_name: "Отто Вёлер",
    descr: "<p>Вёлер, Отто (Otto Wohler; 1894-1987гг.) — немецкий военный деятель, генерал пехоты. Уроженец Гроссбургведеля (Нижняя Саксония). Участник Первой мировой войны. После демобилизации армии оставлен в Рейхсвере, прошел подготовку офицера генштаба. Во время Польской кампании начальник оперативного отдела штаба 14-й армии. С января 1940г. начальник штаба 11-й армии, в составе которой воевал на южном фланге советско-германского фронта. С апреля 1942г. начальник штаба группы армий «Центр» генерал-фельдмаршала Г. фон Клюге. С апреля 1943г. командир 1-го армейского корпуса в составе группы армий «Север». С 15 августа 1943г. командующий 8-й, с 5 сентября — 11-я армией. На протяжении 1943-1944гг. вел тяжелые бои на Украине. В августе 1944г. под командованием Вёлера была создана армейская группа, куда кроме его 8-й армии вошли 17-й армейский корпус и 4-я румынская армия. Части Вёлера понесли тяжелые потери во время Ясско-Кишиневской операции советских войск, в результате которой Румыния вышла из войны. В декабре 1944г. сменил генерала И.Фрисснера на посту командующего группой армий «Юг». В марте 1945г. заменен генерал-полковником Л. Рендуличем. На 12-м процессе Американского военного трибунала в Нюрнберге 28 октября 1948г. приговорен к восьми годам тюремного заключения. В январе 1951г. освобожден.</p>",
    health: 5e8,
    dbf: {
        price: 2e4,
        min_sut: 5100,
        max_sut: 5500,
        start: 5e7,
        remains: 32e7
    },
    leave: {
        count: 80,
        resource: "tokens"
    },
    reward: {
        experience: 3600,
        encryptions: 10
    },
    additional_reward: true,
    additional_reward_stages: [ {
        damage: {
            amount: 4,
            hit: "weapon_6"
        },
        reward: {
            amount: 2e3,
            resource: "experience"
        }
    }, {
        damage: {
            amount: 5,
            hit: "weapon_6"
        },
        reward: {
            amount: 2e3,
            resource: "coins"
        }
    }, {
        damage: {
            amount: 6,
            hit: "weapon_6"
        },
        reward: {
            amount: 40,
            resource: "encryptions"
        }
    } ]
}, {
    short_name: "Бок",
    default_name: "Федор фон Бок",
    full_name: "Федор фон Бок",
    descr: "<p>Бок (Bock) Федор фон (03.12.1880г., Кюстрин, Бранденбург - 04.05.1945г.) Военачальник, генерал-фельдмаршал. Образование получил в кадетском корпусе. В 1898г. вступил в 5-й Потсдамский гвардейски полк. С 1904г. адъютант батальона, с 1906г. - полка. В 1910г. окончил Военную академию. С 1912г. служил в Генеральном штабе, частник 1-й мировой войны: в 1914-15гг. начальник оперативного -отдела штаба 6-й армии. С 1915г. командир батальона 4-го Пруского гвардейского полка. За боевые отличия награжден Железным крестом 1-го и 2-го классов и орденом «Pour le Merite». После восстания в сентябре 1923 г. частей «черного рейхсвера» Бок был привлечен к судебному процессу в качестве свидетеля, при этом левая пресса голословно обвиняла Бока в причастности к политическим убийствам. В 1924г. командир 2-го батальона 4-го пехотного полка (Кольберг), в 1925-26гг. служил в Военном министерстве. С конца 1928г. командир 1-й кавалерийской дивизии (Франкфурт-на-Одере), с 1930г. - 1-й пехотной дивизией и военным округом в Кенигсберге. 01.04.1935г. после создания 3-го командования группы сухопутных сил в Дрездене Бок был назначен его командующим. 31.10.1938г. возглавил наиболее важное - 1-е командование в Берлине. В 1938г. во время аншлюса Австрии командовал войсками 8-й армии, занявшими территорию страны. В конце 1938г. войска под командованием Бока оккупировали Судетскую область. С августа 1939г. командующий группой армий «Север». Во время Польской кампании войска Бока (около 60 тыс. человек) захватили так называемый «Польский коридор» и вышли к Брест-Литовску, где соединились с советскими войсками. 30.09.1939г. награжден Рыцарским крестом Железного креста. Во Французской компании занял Нидерланды, Бельгию, и, разбив франко-английские войска, командовал войсками, осуществлявшими прикрытие советско-германской демаркационной линии. Отрицательно отнесся к плавам А. Гитлера начать войну против СССР. С 21.06.1941г. командующий группой армий «Центр», которая развивала наступление в направлении на Москву. 29 июня окружил крупную группировку советской армии под Минском, взяв в плен 03.07.1941г. около 324 тыс. человек и уничтожив 3332 танка и 1809 орудий. В Смоленском котле Бок 05.08.1941г. взял в плен 310 тыс. человек, в Гомельском котле (24. августа) -около 84 тыс. Человек. При этом потери Бока составляли менее 1/5 от советских. 30.09-19.10.1941г. провел операцию в районе Вязьмы и Брянска, взяв в плен около 665 тыс. человек. Сторонник продолжения наступления, несмотря на плохие погодные условия и неподготовленность армии вести бои в зимних условиях. Участвуя в боях за Дон, и не смотря на приказ Гитлера, втянулся в сражения за Воронеж и 15.07.1942г. под предлогом болезни был снят с командования. В начале мая 1945г. выехал к К. Дёницу, решив предложить ему свои услуги. По дороге в Киль его автомобиль был расстрелян английским самолетом. Бок вместе с женой и дочерью погиб.</p>",
    health: 1e9,
    dbf: {
        price: 3e4,
        min_sut: 6100,
        max_sut: 6500,
        start: 1e8,
        remains: 65e7
    },
    leave: {
        count: 90,
        resource: "tokens"
    },
    reward: {
        experience: 4500,
        encryptions: 10
    },
    additional_reward: true,
    additional_reward_stages: [ {
        damage: {
            amount: 5,
            hit: "weapon_6"
        },
        reward: {
            amount: 2500,
            resource: "experience"
        }
    }, {
        damage: {
            amount: 6,
            hit: "weapon_6"
        },
        reward: {
            amount: 2500,
            resource: "coins"
        }
    }, {
        damage: {
            amount: 7,
            hit: "weapon_6"
        },
        reward: {
            amount: 50,
            resource: "encryptions"
        }
    } ]
}, {
    short_name: "Гот",
    default_name: "Герман Гот",
    full_name: "Герман Гот",
    descr: "<p>Гот (Hoth) Герман (12.04.1880г., Нойруппин - 25.01.1971г., Гослар) военачальник, генерал-полковник. 27.02.1904г. вступил в сухопутные войска. Участник Первой мировой войны, после демобилизации армии оставлен в рейхсвере. С 1935г. командир 18-й дивизии в Лигнау. С 01.10.1938г. командир 15-го армейского корпуса в Йене. Во время Польской компании корпус Гота (5-я и 7-я танковые дивизии) действовал в составе 10-й армии генерала В. фон Рейхенау, Прорвал оборону армии «Краков» и принял активное участие в окружении армии «Прусы» в районе Радома; участник штурма Варшавы. При начале Французской компании корпус Гота был развернут за порядками 4-й армии генерала Г. фон Клюге. Успешные действия Г Гота способствовали капитуляции частей 10-й французской армии в районе Дьепа. 18.06.1940г. взял Ренн и захватил штаб 10-й армии, 20 июня взял Нант, а 25 июня - Руан. При подготовке войны с СССР назначен 16.11.1940г. командующим 3-й танковой группы, в состав которой вошли 39-й и 57-й танковые корпуса (всего 4 танковых и 3 моторизованных дивизии). 22.06.1941г. перешел границу СССР и 24 июня взял Вильнюс, 28 июня - Минск, 10 ноля - Витебск, 14 октября - Калинин. 7.10.1941г. 7-я дивизия группы Гота вышла к Вязьме, где соединилась с 10-й дивизией 4-й танковой группы, завершив окружение 5 советских армий. С 17.10.1941г. командующий 17-й армией, входившей в состав группы армий «Юг». 01.06.1942г. переведен на пост командующего 4-й танковой группой на Воронежском фронте. Вместе с 6-й армией генерала Ф. Паулюса развивал наступление на Сталинград. В июне 1942г. нанес сокрушительное поражение 5-й советской танковой армии. Когда группировка Паулюса была окружена, в котле оказался и один из корпусов Гота - 48-й танковый корпус генерал-лейтенанта Ф. Хейма. Армия Гот вместе со 2-й и 6-й армиями вошла в состав группы армий «Дон» генерала Э. фон Манштейна и принимала участие в боях под Ростовом и др.12-23.12.1942г. предпринял отчаянную попытку деблокировать армию Паулюса, но в связи с тем, что 6-й армии А. Гитлер запретил прорываться из котла, операция была сорвана. В феврале 1943г. Манштейн сосредоточил под командованием Гота все танковые соединения группы армий. Его армия была использована Манштейном для контрнаступления - 22 февраля Гот (48-й, 57-й танковые корпуса и 2-й танковый корпус СС) атаковал советские войска и 14 марта, восстановив фронт по правому берегу Донца, взял Харьков. Участвовал в боях на Курской дуге. 4 июля начал наступление на южной её части. Первоначально ему сопутствовал успех, но 7 июля он был вынужден отвести дивизии первого эшелона - потери были огромны. Подчиняясь приказу Гитлера, силами дивизий СС «Адольф Гитлер» и «Рейх» атаковал и прорвал 3-ю - последнюю - линию обороны, потеряв при этом около 300 танков.15.09.1943г. награжден Рыцарским крестом с дубовыми ветвями и мечами.10.12.1943г. заменен генералом Э. Рауссом. Больше года находился в резерве ставки, а в агрусте 1945г. назначен командующим оборонительным районом в Рудных горах, сдался в плен американским войскам. На 12-м процессе Американского военного трибунала в Нюрнберге по делу ОКХ 27.10.1948г. приговорен к 15 годам тюремного заключена. В 1954г. освобожден.</p>",
    health: 2e9,
    dbf: {
        price: 5e4,
        min_sut: 7100,
        max_sut: 7500,
        start: 2e8,
        remains: 15e8
    },
    leave: {
        count: 10,
        resource: "tickets"
    },
    reward: {
        experience: 5500,
        encryptions: 10
    },
    additional_reward: true,
    additional_reward_stages: [ {
        damage: {
            amount: 6,
            hit: "weapon_6"
        },
        reward: {
            amount: 3e3,
            resource: "experience"
        }
    }, {
        damage: {
            amount: 7,
            hit: "weapon_6"
        },
        reward: {
            amount: 3e3,
            resource: "coins"
        }
    }, {
        damage: {
            amount: 8,
            hit: "weapon_6"
        },
        reward: {
            amount: 60,
            resource: "encryptions"
        }
    } ]
}, {
    short_name: "Паулюс",
    default_name: "Фридрих Паулюс",
    full_name: "Фридрих Вильгельм Эрнст Паулюс",
    descr: "<p>Родился 23 сентября 1890г. в Брейтенау, Гессен. Умер 1 февраля 1957г. в Дрез­дене. Генерал-фельдмаршал, командующий 6-й полевой армией вермахта (5 января 1942г. – 31 января 1943).</p><p>3 сентября 1940г. в звании генерал-лейтенанта в дол­жности 1-го оберквартирмейстера гене­рального штаба сухопутных войск Герма­нии занимается разработкой плана «Бар­баросса» – нападения на Советский Союз.</p><p>5 января 1942г. принимает командова­ние 6-й полевой армией, которая в составе груп­пы войск «Б» в 1942г. ведет наступление на Сталинград. Имея задачу в течение од­ной недели овладеть городом, армия ве­дет безуспешные бои в районе Сталинграда 200 дней и ночей. Оказавшись в кольце окружения советских войск, не решается на са­мостоятельные действия по прорыву, ос­таваясь верным приказу фюрера – сто­ять до конца.</p><p>Отказавшись принять пред­ложение советского командования о капитуля­ции, обрекает свою армию на полное унич­тожение. Звание фельдмаршала получил в ночь на 31 января 1943г. накануне плене­ния. Находясь в советском плену, в 1944 всту­пает в антифашистский Союз немецких офицеров, а затем в Национальный ко­митет «Свободная Германия».</p><p>На Нюрн­бергском процессе выступал в качестве свидетеля со стороны советского обвинения.</p><p>Пос­ле освобождения в 1953г. проживал в Дрез­дене (Восточная Германия), где формаль­но имел чин офицера народной полиции. Имеет награды.</p>",
    health: 5e9,
    dbf: {
        price: 6e4,
        min_sut: 8100,
        max_sut: 8500,
        start: 5e9,
        remains: 4e9
    },
    leave: {
        count: 20,
        resource: "tickets"
    },
    reward: {
        experience: 1e4,
        encryptions: 30
    },
    additional_reward: true,
    additional_reward_stages: [ {
        damage: {
            amount: 7,
            hit: "weapon_6"
        },
        reward: {
            amount: 3500,
            resource: "experience"
        }
    }, {
        damage: {
            amount: 8,
            hit: "weapon_6"
        },
        reward: {
            amount: 3500,
            resource: "coins"
        }
    }, {
        damage: {
            amount: 9,
            hit: "weapon_6"
        },
        reward: {
            amount: 70,
            resource: "encryptions"
        }
    } ]
}, {
    short_name: "Вейхс",
    default_name: "Максимилиан Вейхс",
    full_name: "Максимилиан фон Вейхс",
    descr: "",
    health: 1e9,
    dbf: {
        price: 1200,
        min_sut: 10,
        max_sut: 30,
        start: 2e4,
        remains: 1e3
    },
    leave: {
        count: 30,
        resource: "tickets"
    },
    reward: {
        experience: 160,
        encryptions: 75
    }
}, {
    short_name: "Модель",
    default_name: "Вальтер Модель",
    full_name: "Отто Мориц Вальтер Модель",
    descr: "",
    health: 1e9,
    dbf: {
        price: 1300,
        min_sut: 10,
        max_sut: 30,
        start: 2e4,
        remains: 1e3
    },
    leave: {
        count: 40,
        resource: "tickets"
    },
    reward: {
        experience: 170,
        encryptions: 81
    }
}, {
    short_name: "Харпе",
    default_name: "Йозеф Харпе",
    full_name: "Йозеф Харпе",
    descr: "<p>Йозеф Харпе (21 сентября 1887 - 14 марта 1968) был немецким генералом во время Второй мировой войны, командовал 9-й армией.</p><p>Командуя 1-й танковой бригадой, участвовал в Польской кампании. Награждён планками к Железным крестам обеих степеней (повторное награждение). С 30 августа 1940г. — генерал-майор.</p><p>В октябре 1940г. принял командование 2-й моторизованной дивизией, которая под его руководством была в январе 1941г. переформирована в 12-ю танковую дивизию.</p><p>Во время операции «Барбаросса» 12-я танковая дивизия наступала на Минск, Смоленск в составе группы армий «Центр», с сентября 1941г. — на Ленинград в составе группы армий «Север». В августе 1941г. — Харпе награждён Рыцарским крестом. В декабре 1941г. — награждён Дубовыми Листьями (№ 55) к Рыцарскому кресту.</p><p>В январе 1942г. произведён в генерал-лейтенанты, назначен командующим 41-м танковым корпусом. 1 июня 1942г. произведён в генералы танковых войск.</p><p>В феврале 1943г. награждён Золотым немецким крестом, в сентябре 1943г. — Мечами (№ 36) к Рыцарскому кресту с Дубовыми Листьями.</p><p>С ноября 1943г. — командующий 9-й армией. В мае 1944г. — произведен в генерал-полковники и назначен командующим 4-й танковой армии. В сентябре 1944г. — возглавил группу армий «Северная Украина» (переименована в группу армий «А»).</p><p>17 января 1945г. снят с должности и отправлен в резерв командования сухопутных сил после прорыва советских войск в ходе Висло-Одерской операции. С 9 марта 1945г. — командующий 5-й танковой армией на Западном фронте, 17 апреля 1945г. — взят в американский плен. До 14 апреля 1948г. находился в лагере для военнопленных.</p><p>Умер в Нюрнберге 14 марта 1968г. в возрасте 80 лет.</p>",
    health: 1e9,
    dbf: {
        price: 1400,
        min_sut: 10,
        max_sut: 30,
        start: 2e4,
        remains: 1e3
    },
    leave: {
        count: 50,
        resource: "tickets"
    },
    reward: {
        experience: 180,
        encryptions: 90
    }
}, {
    short_name: "Геббельс",
    default_name: "Йозеф Геббельс",
    full_name: "Йозеф Геббельс",
    descr: "<p>Йозеф Геббельс – один из самых яркий представителей верхушки, фашисткой Германии, ближайший соратник Гитлера. Йозеф был замечательным пропагандистом, сильным оратором, умеющим убедить людей в правоте своих мыслей и идей. На роль вождя Геббельс никогда не претендовал, он отводил себе место около Гитлера, оставаясь в политической иерархии чуть ниже него.</p><p>Йозеф родилс в 1897 году в самой обычной немецкой семье. Отец работал бухгалтером, но был очень набожным человеком, и мечтал о том, что сын станет священником. Сын не разделял чаяния отца, ему нравилась философия и литература, и он мечтал, скорее о карьере журналиста, ну или писателя.</p><p>В 1921 году он защитил докторскую диссертацию, однако успеха в качестве литератора не добился. Либеральные издательства то и дело забраковывали труды Геббельса. Свое призвание в итоге Йозеф нашел в политике. Он примкнул к НСДАП. Сначала он был в «левом» крыле партии. Однако его заметил Гитлер, и переманил талантливого оратора на свою сторону. В 1926 году Гитлер отправляет Йозефа в Берлин, в качестве главного пропагандиста. Через четыре года он будет заведовать всей пропагандой НСДАП, и руководить газетой «Дер ангрифф». Когда Гитлеру удалось взять власть в Германии в свои руки, Геббельс стал занимать важные государственные посты. Йозеф отвечал за народное образование, пропаганду и культуру.</p><p>Он отвечал за мобилизацию немцев на поддержку программных установок НСДАП. 29 апреля 1945 года Гитлер, который покончил жизнь самоубийством, написал, что Геббельс является его приемником на должности рейхсканцлера. В новой должности Йозеф провел около суток. Отправив парламентера к генералу Чуйкову с предложением о перемирии, за время которого немцы обещали сформировать новое правительство и решить вопрос о войне. Советское руководство такой вариант развития событий не устроил. В итоге Геббель вместе с женой Магдой решились на самоубийство, также погубив своих 6 детей.</p>",
    health: 55e5,
    dbf: {
        price: 1500,
        min_sut: 510,
        max_sut: 600,
        start: 25e4,
        remains: 5e6
    },
    leave: {
        count: 10,
        resource: "tokens"
    },
    reward: {
        experience: 300,
        encryptions: 10
    },
    start_time: 1634256e3
}, {
    short_name: "Муссолини",
    default_name: "Бенито Муссолини",
    full_name: "Бенито Муссолини",
    descr: "<p>Муссолини родился 29 июля 1883 года в провинции Романья. Его отец, Алессандро Муссолини, был кузнецом и революционером, за что нередко попадал под арест. Будущий диктатор не отставал от отца во взглядах. В молодости Муссолини успел поработать учителем в гимназии и написать несколько статей для газет. Позже он работал журналистом, также был прирожденным оратором и ездил по Италии с выступлениями на политическую тему.</p><p>В 1915 году был призван в итальянскую армию. Его полк расположился на Изонцовском участке Итальянского фронта. Его сослуживцы утверждали, что Бенито самым первым бросался в атаку. В ноября 1915 Муссолини попал в госпиталь из-за заболевания тифом. В феврале 1917 он снова оказался в госпитале. На этот раз по причине тяжёлого ранения.</p><p>В 1919 году Муссолини создает Итальянский союз борьбы, который в 1921 году превращается в Национальную фашистскую (от итальянского fascio «союз») партию. Вскоре он становится премьер-министром Италии. Муссолини взял всю власть себе, ограничев влияние короля Виктора Эмануила III. В 1928 году фашистская партия становится в Италии единственной, остальные политические объединения признаются нелегальными. Государство контролировало практически все сферы жизни общества, а любые отклонения жестко наказывались.</p><p>Италия вступила в войну на стороне Оси по двум причинам: Во-первых, страна была союзницей Германии. Во-вторых, Муссолини желал восстановить Римскую империю.</p><p>Однако итальянская армия потерпела серъёзное поражение в Северной Африке. В ноябре 1943 союзники высаживаються в Сицилии и Сардиии. Позже они берут Рим. Муссолини пытается сбежать, но итальянские партизаны ловят его вместе с любовницей. Обоих расстреливают 28 апреля 1945 года. Их тела подвешивают за ноги и публично показывают народу.</p>",
    health: 55e5,
    dbf: {
        price: 1500,
        min_sut: 510,
        max_sut: 600,
        start: 25e4,
        remains: 5e6
    },
    leave: {
        count: 10,
        resource: "tokens"
    },
    reward: {
        experience: 300,
        encryptions: 10
    },
    start_time: 1634083200
}, {}, {
    short_name: "Хайнц Гудериан",
    health: [ 55e4, 57e4, 59e4, 61e4, 63e4, 65e4, 67e4, 69e4, 71e4, 73e4, 75e4, 77e4, 79e4, 81e4, 83e4, 85e4, 87e4, 89e4, 91e4, 93e4, 95e4, 97e4, 99e4, 101e4, 103e4, 105e4, 107e4, 109e4, 111e4, 113e4, 115e4, 117e4, 119e4, 121e4, 123e4, 125e4, 127e4, 129e4, 131e4, 133e4, 135e4, 137e4, 139e4, 141e4, 143e4, 145e4, 147e4, 149e4, 151e4, 153e4, 155e4, 157e4, 159e4, 161e4, 163e4, 165e4, 167e4, 169e4, 171e4, 173e4, 175e4, 177e4, 179e4, 181e4, 183e4, 185e4, 187e4, 189e4, 191e4, 193e4, 195e4, 197e4, 199e4, 201e4, 203e4, 205e4, 207e4, 209e4, 211e4, 213e4, 215e4, 217e4, 219e4, 221e4, 223e4, 225e4, 227e4, 229e4, 231e4, 233e4, 235e4, 237e4, 239e4, 241e4, 243e4, 245e4, 247e4, 249e4, 251e4, 253e4, 255e4, 257e4, 259e4, 261e4, 263e4, 265e4, 267e4, 269e4, 271e4, 273e4, 275e4, 277e4, 279e4, 281e4, 283e4, 285e4, 287e4, 289e4, 291e4, 293e4, 295e4, 297e4, 299e4, 301e4, 303e4, 305e4, 307e4, 309e4, 311e4, 313e4, 315e4, 317e4, 319e4, 321e4, 323e4, 325e4, 327e4, 329e4, 331e4, 333e4, 335e4, 337e4, 339e4, 341e4, 343e4, 345e4, 347e4, 349e4, 351e4, 353e4, 355e4, 357e4, 359e4, 361e4, 363e4, 365e4, 367e4, 369e4, 371e4, 373e4, 375e4, 377e4, 379e4, 381e4, 383e4, 385e4, 387e4, 389e4, 391e4, 393e4, 395e4, 397e4, 399e4, 401e4, 403e4, 405e4, 407e4, 409e4, 411e4, 413e4, 415e4, 417e4, 419e4, 421e4, 423e4, 425e4, 427e4, 429e4 ],
    leave: {
        count: 15,
        resource: "tickets"
    },
    reward: {
        experience: 1e3,
        encryptions: 10
    },
    start_time: 1640390400
}, {
    short_name: "Роммель",
    default_name: "Эрвин Роммель",
    full_name: "Эрвин Йоханнес Ойген Роммель",
    descr: "<p>Роммель (Rommel) Эрвин (15.11. 1891, г. Хейденхейм, Баден-Вюртемберг,— 14.10. 1944, Херлинген, близ г. Ульм), ген.-фельдмаршал нем.-фаш. армии (1942). На воен. службе с 1910, участник 1-й мировой войны. Во время ноябрьской бурж.-демократич. революции 1918 в Германии командовал охранной ротой, принимавшей участие в подавлении выступлений трудящихся Рурской обл. С 1919 служил в рейхсвере: ком-р роты, преподаватель тактики пех. школы в Дрездене, ком-р егерского батальона в г. Гослар. С 1935 на службе в фаш. вермахте. Был преподавателем воен. школы в Потсдаме, нач-ком воен. школы в Винер-Нёйштадте, затем воен. комендантом ставки Гитлера. С февр. 1940 ком-р 7-й танк, дивизии, участвовавшей в походе против Франции. С февр. 1941 по март 1943 командовал нем. экспедиц. силами в Сев. Африке, а в июле — нояб. 1943 группой армий «Б» в Сев. Италии; по его приказам осуществлялись карательные операции против итал. борцов Сопротивления. В дек. 1943 выполнял функции воен. инспектора ставки верх, командования в Дании. С дек. 1943 по июль 1944 командующий группой армий «Б» во Франции. Был связан с руководителями антигитлеровского заговора 20 июля 1944. После раскрытия заговора покончил жизнь самоубийством.</p>",
    health: 16e9,
    dbf: {
        price: 99999,
        min_sut: 3,
        max_sut: 100,
        start: 10309280,
        remains: 15e9
    },
    leave: {
        count: 15,
        resource: "tickets"
    },
    reward: {
        experience: 17e3,
        encryptions: 130
    },
    start_time: 1633910400
} ];

window["weapons_damage"] = [ {
    damage: 500,
    name: "Трассирующие снаряды"
}, {
    damage: 1e3,
    name: "Осколочные снаряды"
}, {
    damage: 1500,
    name: "Разрывные снаряды"
}, {
    damage: 2e3,
    name: "Зажигательные снаряды"
}, {
    damage: 2500,
    name: "Фугасные снаряды"
}, {
    damage: 3e3,
    name: "Бронебойные снаряды"
}, {
    damage: 3500,
    name: "Кумулятивные снаряды"
} ];

window["free_hits"] = [ {
    name: "Беглый огонь",
    damage: 100,
    time: 3600
}, {
    name: "Кинжальный огонь",
    damage: 200,
    time: 7200
}, {
    name: "Массированный обстрел",
    damage: 300,
    time: 10800
} ];

window["price_buy_raid"] = 15;

window["limit_bosses"] = 30;

window["limit_boxes"] = 36;

window["limit_send_collection_general"] = 20;

window["limit_send_collection_personal"] = 5;

window["limit_get_collection"] = 20;

window["limit_send_help_general"] = 25;

window["limit_get_help"] = 30;

window["limit_supply_max"] = 100;

window["limit_supply_accept"] = 100;

window["power_airstrike"] = 60;

window["boxes"] = [ {
    name: "Простой ящик",
    time: 7200,
    reward: {
        cards: 0,
        coins: {
            min: 200,
            max: 300
        },
        tokens: {
            min: 1,
            max: 5
        },
        supply: {
            min: 5,
            max: 10
        },
        weapons: {
            min: 2,
            max: 2
        }
    },
    can_buy: false
}, {
    name: "Боезапас",
    time: 10,
    reward: {
        cards: 0,
        coins: {
            min: 200,
            max: 500
        },
        experience: {
            min: 200,
            max: 600
        },
        tokens: {
            min: 1,
            max: 10
        },
        supply: {
            min: 5,
            max: 10
        },
        weapons: {
            min: 1,
            max: 3
        }
    },
    can_buy: false
}, {
    name: "Лёгкий ящик",
    time: 14400,
    reward: {
        cards: 0,
        coins: {
            min: 500,
            max: 1e3
        },
        experience: {
            min: 400,
            max: 500
        },
        tokens: {
            min: 5,
            max: 15
        },
        supply: {
            min: 10,
            max: 30
        }
    },
    can_buy: false
}, {
    name: "Средний ящик",
    time: 28800,
    reward: {
        cards: 0,
        coins: {
            min: 1e3,
            max: 2e3
        },
        experience: {
            min: 600,
            max: 700
        },
        tokens: {
            min: 10,
            max: 25
        },
        supply: {
            min: 30,
            max: 60
        }
    },
    can_buy: false
}, {
    name: "Большой ящик",
    time: 57600,
    reward: {
        cards: 0,
        coins: {
            min: 2e3,
            max: 4e3
        },
        experience: {
            min: 800,
            max: 900
        },
        tokens: {
            min: 15,
            max: 40
        },
        supply: {
            min: 100,
            max: 200
        }
    },
    can_buy: false
}, {
    name: "Легендарный ящик",
    time: 115200,
    reward: {
        cards: 0,
        coins: {
            min: 4e3,
            max: 6e3
        },
        supply: {
            min: 200,
            max: 300
        },
        experience: {
            min: 1e3,
            max: 1200
        },
        tokens: {
            min: 20,
            max: 60
        }
    },
    can_buy: false
}, {
    name: "Фронтовой ящик",
    time: 10,
    reward: {
        cards: 0,
        experience: {
            min: 650,
            max: 800
        },
        coins: {
            min: 1250,
            max: 2500
        },
        tokens: {
            min: 25,
            max: 50
        },
        supply: {
            min: 50,
            max: 100
        },
        weapons: {
            min: 8,
            max: 15
        }
    },
    can_buy: false
}, {
    name: "Танки",
    time: 1,
    reward: {
        cards: 100,
        coins: {
            min: 0,
            max: 0
        },
        experience: {
            min: 0,
            max: 0
        },
        tokens: {
            min: 0,
            max: 0
        },
        supply: {
            min: 0,
            max: 0
        }
    },
    can_buy: false
}, {
    name: "Артиллерия",
    time: 1,
    reward: {
        cards: 100,
        coins: {
            min: 0,
            max: 0
        },
        experience: {
            min: 0,
            max: 0
        },
        tokens: {
            min: 0,
            max: 0
        },
        supply: {
            min: 0,
            max: 0
        }
    },
    can_buy: false
}, {
    name: "Авиация",
    time: 1,
    reward: {
        cards: 100,
        coins: {
            min: 0,
            max: 0
        },
        experience: {
            min: 0,
            max: 0
        },
        tokens: {
            min: 0,
            max: 0
        },
        supply: {
            min: 0,
            max: 0
        }
    },
    can_buy: false
}, {
    name: "Флот",
    time: 1,
    reward: {
        cards: 100,
        coins: {
            min: 0,
            max: 0
        },
        experience: {
            min: 0,
            max: 0
        },
        tokens: {
            min: 0,
            max: 0
        },
        supply: {
            min: 0,
            max: 0
        }
    },
    can_buy: false
}, {
    name: "Лёгкий ящик +",
    time: 7200,
    reward: {
        cards: 135,
        coins: {
            min: 500,
            max: 1e3
        },
        experience: {
            min: 400,
            max: 500
        },
        tokens: {
            min: 5,
            max: 15
        },
        supply: {
            min: 10,
            max: 30
        }
    },
    can_buy: true,
    buy_class: "offer_brown",
    buy_price: 35
}, {
    name: "Средний ящик +",
    time: 10800,
    reward: {
        cards: 400,
        coins: {
            min: 1e3,
            max: 2e3
        },
        experience: {
            min: 600,
            max: 700
        },
        tokens: {
            min: 10,
            max: 25
        },
        supply: {
            min: 30,
            max: 60
        }
    },
    can_buy: true,
    buy_class: "offer_blue",
    buy_price: 70
}, {
    name: "Большой ящик +",
    time: 14400,
    reward: {
        cards: 900,
        coins: {
            min: 2e3,
            max: 4e3
        },
        experience: {
            min: 800,
            max: 900
        },
        tokens: {
            min: 15,
            max: 40
        },
        supply: {
            min: 100,
            max: 200
        }
    },
    can_buy: true,
    buy_class: "offer_red",
    buy_price: 190
}, {
    name: "Легендарный ящик +",
    time: 18e3,
    reward: {
        cards: 1800,
        coins: {
            min: 3e3,
            max: 6e3
        },
        experience: {
            min: 1e3,
            max: 1200
        },
        tokens: {
            min: 20,
            max: 60
        },
        supply: {
            min: 200,
            max: 300
        }
    },
    can_buy: true,
    buy_class: "offer_purple",
    buy_price: 295
} ];

window["cards"] = {
    "1": {
        "0": {
            name: "Т-27",
            country: "ussr"
        },
        "1": {
            name: "Т-38",
            country: "ussr"
        },
        "2": {
            name: "Т-40",
            country: "ussr"
        },
        "3": {
            name: "Т-18",
            country: "ussr"
        },
        "4": {
            name: "Т-26",
            country: "ussr"
        },
        "5": {
            name: "Т-26М",
            country: "ussr"
        },
        "6": {
            name: "БТ-2",
            country: "ussr"
        },
        "7": {
            name: "Т-28",
            country: "ussr"
        },
        "8": {
            name: "Т-35",
            country: "ussr"
        },
        "9": {
            name: "КВ",
            country: "ussr"
        },
        "10": {
            name: "КВ-2",
            country: "ussr"
        },
        "11": {
            name: "Т-100",
            country: "ussr"
        },
        "12": {
            name: "Пантера",
            country: "germany"
        },
        "13": {
            name: "PZ II",
            country: "germany"
        },
        "14": {
            name: "Тигр",
            country: "germany"
        },
        "15": {
            name: "39M Csaba",
            country: "other"
        },
        "16": {
            name: "PZ I",
            country: "germany"
        },
        "17": {
            name: "38M Toldi",
            country: "other"
        },
        "18": {
            name: "PZ III",
            country: "germany"
        },
        "19": {
            name: "PZ IV",
            country: "germany"
        },
        "20": {
            name: "Pz B2",
            country: "germany"
        },
        "21": {
            name: "M22",
            country: "usa"
        },
        "22": {
            name: "M3 Stuart",
            country: "usa"
        },
        "23": {
            name: "SD 250",
            country: "germany"
        },
        "24": {
            name: "Lowe",
            country: "germany"
        },
        "25": {
            name: "Tiger2",
            country: "germany"
        },
        "26": {
            name: "E100",
            country: "germany"
        },
        "27": {
            name: "M5 Stuart",
            country: "usa"
        },
        "28": {
            name: "M4 Sherman",
            country: "usa"
        },
        "29": {
            name: "VK30",
            country: "germany"
        },
        "30": {
            name: "M24 Chaffee",
            country: "usa"
        },
        "31": {
            name: "Т-34-76",
            country: "ussr"
        },
        "32": {
            name: "T1 Heavy",
            country: "usa"
        },
        "33": {
            name: "M3 Lee",
            country: "usa"
        },
        "34": {
            name: "M4A2E4",
            country: "usa"
        },
        "35": {
            name: "M4A3E2",
            country: "usa"
        },
        "36": {
            name: "Т14",
            country: "usa"
        },
        "37": {
            name: "T20",
            country: "usa"
        },
        "38": {
            name: "Pershing",
            country: "usa"
        },
        "39": {
            name: "M6A2E1",
            country: "usa"
        },
        "40": {
            name: "M7",
            country: "usa"
        },
        "41": {
            name: "CruiserMkI",
            country: "britain"
        },
        "42": {
            name: "CruiserMkII",
            country: "britain"
        },
        "43": {
            name: "CruiserMkIII",
            country: "britain"
        },
        "44": {
            name: "CruiserMkIV",
            country: "britain"
        },
        "45": {
            name: "Light Mk I",
            country: "britain"
        },
        "46": {
            name: "Crusader",
            country: "britain"
        },
        "47": {
            name: "T23",
            country: "usa"
        },
        "48": {
            name: "Ram II",
            country: "usa"
        },
        "49": {
            name: "ИС-2",
            country: "ussr"
        },
        "50": {
            name: "VickersMkI",
            country: "britain"
        },
        "51": {
            name: "ИС-3",
            country: "ussr"
        },
        "52": {
            name: "Covenanter",
            country: "britain"
        },
        "53": {
            name: "Valentine",
            country: "britain"
        },
        "54": {
            name: "VickersMkII",
            country: "britain"
        },
        "55": {
            name: "Matilda",
            country: "britain"
        },
        "56": {
            name: "Cromwell",
            country: "britain"
        },
        "57": {
            name: "Matilda BP",
            country: "britain"
        },
        "58": {
            name: "Centurion",
            country: "britain"
        },
        "59": {
            name: "VickersMed Mk3",
            country: "britain"
        },
        "60": {
            name: "Comet",
            country: "britain"
        },
        "61": {
            name: "Black Prince",
            country: "britain"
        },
        "62": {
            name: "Churchill",
            country: "britain"
        },
        "63": {
            name: "Staghound Mk3",
            country: "usa"
        },
        "64": {
            name: "Churchill VII",
            country: "britain"
        },
        "65": {
            name: "M3ScoutCar",
            country: "usa"
        },
        "66": {
            name: "Chevrolet T17E1",
            country: "usa"
        },
        "67": {
            name: "D2",
            country: "france"
        },
        "68": {
            name: "Hotchkiss",
            country: "france"
        },
        "69": {
            name: "Renault FT",
            country: "france"
        },
        "70": {
            name: "Ford T17",
            country: "usa"
        },
        "71": {
            name: "AMX40",
            country: "france"
        },
        "72": {
            name: "Lorraine40t",
            country: "france"
        },
        "73": {
            name: "D1",
            country: "france"
        },
        "74": {
            name: "AMX38",
            country: "france"
        },
        "75": {
            name: "BDR G1 B",
            country: "france"
        },
        "76": {
            name: "Excelsior",
            country: "france"
        },
        "77": {
            name: "ARL 44",
            country: "france"
        },
        "78": {
            name: "AMX M4 mle.45",
            country: "france"
        },
        "79": {
            name: "Devastator",
            country: "usa"
        },
        "80": {
            name: "Overlord",
            country: "usa"
        },
        "81": {
            name: "Sentinel",
            country: "other"
        },
        "82": {
            name: "Marauder",
            country: "other"
        },
        "83": {
            name: "T-34-57",
            country: "ussr"
        },
        "84": {
            name: "T-34-85",
            country: "ussr"
        },
        "85": {
            name: "А-20",
            country: "ussr"
        },
        "86": {
            name: "Т-34Э",
            country: "ussr"
        },
        "87": {
            name: "Т-50",
            country: "ussr"
        },
        "88": {
            name: "Т-127",
            country: "ussr"
        },
        "89": {
            name: "Krautz F11",
            country: "germany"
        },
        "90": {
            name: "T-43",
            country: "ussr"
        },
        "91": {
            name: "De Gaulle",
            country: "france"
        },
        "92": {
            name: "T-44",
            country: "ussr"
        },
        "93": {
            name: "T-44-100",
            country: "ussr"
        },
        "94": {
            name: "КВ-1С",
            country: "ussr"
        },
        "95": {
            name: "Т-34 Витязь",
            country: "ussr"
        },
        "96": {
            name: "КВ-85",
            country: "ussr"
        },
        "97": {
            name: "Lethal discharge",
            country: "britain"
        },
        "98": {
            name: "Katafraktar-4M",
            country: "germany"
        },
        "99": {
            name: "T-34 BNO",
            country: "other"
        },
        "100": {
            name: "T-34M",
            country: "ussr"
        },
        "101": {
            name: "AMX 12 t",
            country: "france"
        },
        "102": {
            name: "KB-13",
            country: "ussr"
        },
        "103": {
            name: "Т-70",
            country: "ussr"
        },
        "104": {
            name: "AMX 13 90",
            country: "france"
        },
        "105": {
            name: "КВ-3",
            country: "ussr"
        },
        "106": {
            name: "КВ-4",
            country: "ussr"
        },
        "107": {
            name: "КВ-5",
            country: "ussr"
        },
        "108": {
            name: "Т-80",
            country: "ussr"
        },
        "109": {
            name: "40M Turan",
            country: "other"
        },
        "110": {
            name: "Type 97 Te Ke",
            country: "japan"
        },
        "111": {
            name: "БТ-7",
            country: "ussr"
        },
        "112": {
            name: "44M Tas",
            country: "other"
        },
        "113": {
            name: "Jagdrhino",
            country: "germany"
        },
        "114": {
            name: "Renault Otsu",
            country: "france"
        },
        "115": {
            name: "Rammbock",
            country: "germany"
        },
        "116": {
            name: "HaGo",
            country: "japan"
        },
        "117": {
            name: "7TP",
            country: "poland"
        },
        "118": {
            name: "Jeegsaw 112",
            country: "germany"
        },
        "119": {
            name: "Чи-Ха",
            country: "japan"
        },
        "120": {
            name: "Чи-Хе",
            country: "japan"
        },
        "121": {
            name: "Чи-Ну",
            country: "japan"
        },
        "122": {
            name: "Ке-Хо",
            country: "japan"
        },
        "123": {
            name: "M1139",
            country: "italy"
        },
        "124": {
            name: "T26E",
            country: "ussr"
        },
        "125": {
            name: "Vickers Mk E",
            country: "britain"
        },
        "126": {
            name: "M-14/41",
            country: "italy"
        },
        "127": {
            name: "Чи-То",
            country: "japan"
        },
        "128": {
            name: "Чи-Ни",
            country: "japan"
        },
        "129": {
            name: "Ке-Ни",
            country: "japan"
        },
        "130": {
            name: "Ми-То",
            country: "japan"
        },
        "131": {
            name: "Чи-Ри",
            country: "japan"
        },
        "132": {
            name: "Type 91 Heavy",
            country: "japan"
        },
        "133": {
            name: "СМГ-2",
            country: "ussr"
        },
        "134": {
            name: "Somua S35",
            country: "france"
        },
        "135": {
            name: "ARL-42",
            country: "france"
        },
        "136": {
            name: "Chatillon-23t",
            country: "france"
        },
        "137": {
            name: "B1 Bis",
            country: "france"
        },
        "138": {
            name: "D9-Прототип",
            country: "france"
        },
        "139": {
            name: "Type 92 Prototype",
            country: "japan"
        },
        "140": {
            name: "Leopard-2",
            country: "germany"
        },
        "141": {
            name: "Somua SA40",
            country: "france"
        },
        "142": {
            name: "Ахиллес",
            country: "britain"
        },
        "143": {
            name: "Krupp-Steyr",
            country: "germany"
        },
        "144": {
            name: "Sentinel AC I",
            country: "other"
        },
        "145": {
            name: "Renault G1",
            country: "france"
        },
        "146": {
            name: "SARL 42",
            country: "france"
        },
        "147": {
            name: "Spahpanzer SP I",
            country: "germany"
        },
        "148": {
            name: "AC IV",
            country: "other"
        },
        "149": {
            name: "Sentinel ACIII-M",
            country: "other"
        },
        "150": {
            name: "Type 474-II",
            country: "other"
        },
        "151": {
            name: "VK 0531-P",
            country: "germany"
        },
        "152": {
            name: "LC Panther",
            country: "germany"
        },
        "153": {
            name: "Леопард",
            country: "germany"
        },
        "154": {
            name: "Sherman Firefly",
            country: "britain"
        },
        "155": {
            name: "MBT-70",
            country: "usa"
        },
        "156": {
            name: "Type-583V",
            country: "japan"
        },
        "157": {
            name: "G-wagen-II",
            country: "germany"
        },
        "158": {
            name: "T-54-П",
            country: "ussr"
        },
        "159": {
            name: "M-22-L",
            country: "usa"
        },
        "160": {
            name: "ОТ-34-85",
            country: "ussr"
        },
        "161": {
            name: "ТА-76-П",
            country: "ussr"
        },
        "162": {
            name: "Charioteer",
            country: "britain"
        },
        "163": {
            name: "Mk.1 - Landlord",
            country: "britain"
        },
        "164": {
            name: "Mk.VI A",
            country: "britain"
        },
        "165": {
            name: "Centurion Mk.III",
            country: "britain"
        },
        "166": {
            name: "Mark 1",
            country: "britain"
        },
        "167": {
            name: "A7V",
            country: "germany"
        },
        "168": {
            name: "Бронеход",
            country: "ussr"
        },
        "169": {
            name: "St Chamond",
            country: "france"
        },
        "170": {
            name: "БТ-5",
            country: "ussr"
        },
        "171": {
            name: "CX-35-P",
            country: "other"
        },
        "172": {
            name: "VK 34",
            country: "germany"
        },
        "173": {
            name: "VK 082",
            country: "germany"
        },
        "174": {
            name: "Norbert",
            country: "other"
        },
        "175": {
            name: "Milbe",
            country: "other"
        },
        "176": {
            name: "Vesuvio",
            country: "france"
        },
        "177": {
            name: "Archer L1",
            country: "france"
        },
        "178": {
            name: "AMX-30 EBG",
            country: "france"
        },
        "179": {
            name: "БА-10-П",
            country: "ussr"
        },
        "180": {
            name: "Renault R39",
            country: "france"
        },
        "181": {
            name: "Т-80-У2",
            country: "ussr"
        },
        "182": {
            name: "Т1000",
            country: "other"
        },
        "183": {
            name: "Covenanter MK VI",
            country: "britain"
        },
        "184": {
            name: "Т-135-П",
            country: "ussr"
        },
        "185": {
            name: "Т-16",
            country: "ussr"
        },
        "186": {
            name: "Pz.Kpfw. VI",
            country: "germany"
        },
        "187": {
            name: "М3 Грант",
            country: "usa"
        },
        "188": {
            name: "Matilda Mk II",
            country: "britain"
        },
        "189": {
            name: "AMX-50",
            country: "france"
        },
        "190": {
            name: "Бертранд",
            country: "other"
        },
        "191": {
            name: "TOG-P",
            country: "britain"
        },
        "192": {
            name: "M22 Locust",
            country: "usa"
        },
        "193": {
            name: "Waffentrager GW IV",
            country: "germany"
        },
        "194": {
            name: "Pz I-P",
            country: "germany"
        },
        "195": {
            name: "Type-94",
            country: "japan"
        },
        "196": {
            name: "A34 Comet",
            country: "britain"
        },
        "197": {
            name: "Type 704",
            country: "other"
        },
        "198": {
            name: "Stahlwagen-P",
            country: "germany"
        },
        "199": {
            name: "Type 503-I",
            country: "other"
        },
        "200": {
            name: "Type 541: Predator",
            country: "other"
        },
        "201": {
            name: "Type 5-P-III",
            country: "other"
        },
        "202": {
            name: "БТ-СВ",
            country: "ussr"
        },
        "203": {
            name: "Type 566-IIP",
            country: "other"
        },
        "204": {
            name: "Т-63-П-Л",
            country: "ussr"
        },
        "205": {
            name: "Type-363-I",
            country: "other"
        },
        "206": {
            name: "MK. III-JP",
            country: "britain"
        },
        "207": {
            name: "Hellfighter-P",
            country: "usa"
        },
        "208": {
            name: "M21P Alligator",
            country: "usa"
        },
        "209": {
            name: "R25",
            country: "other"
        },
        "210": {
            name: "Invasor Kfz-P",
            country: "germany"
        },
        "211": {
            name: "Liberty Mk.1P",
            country: "britain"
        },
        "212": {
            name: "Marseillais",
            country: "other"
        },
        "213": {
            name: "Saboteur-1",
            country: "other"
        },
        "214": {
            name: "Bastion-35-II",
            country: "other"
        },
        "215": {
            name: "Сoncierge-41-P",
            country: "other"
        },
        "216": {
            name: "Sieger-343-P",
            country: "germany"
        },
        "217": {
            name: "Demolisher",
            country: "usa"
        },
        "218": {
            name: "Объект 33-ПТ",
            country: "ussr"
        },
        "219": {
            name: "ТМ-16",
            country: "ussr"
        },
        "220": {
            name: "Läufer I",
            country: "france"
        },
        "221": {
            name: "Mammoth",
            country: "other"
        },
        "222": {
            name: "Pz.Kpfw. IV Ausf. M",
            country: "germany"
        },
        "223": {
            name: "Tortuga",
            country: "other"
        },
        "224": {
            name: "Т-181",
            country: "ussr"
        },
        "225": {
            name: "КВ-220",
            country: "ussr"
        },
        "226": {
            name: "То-Ри",
            country: "japan"
        },
        "227": {
            name: "Type 835",
            country: "other"
        },
        "228": {
            name: "Pz.Kpfw V Austerlitz",
            country: "germany"
        },
        "229": {
            name: "Pz.Kpfw VI Eisen",
            country: "germany"
        },
        "230": {
            name: "Ambassador",
            country: "other"
        },
        "231": {
            name: "Belfry",
            country: "other"
        },
        "232": {
            name: "Type 368-I",
            country: "other"
        },
        "233": {
            name: "Mark XI-LT",
            country: "britain"
        },
        "234": {
            name: "T2 M6-P",
            country: "usa"
        },
        "235": {
            name: "Bombard",
            country: "other"
        },
        "236": {
            name: "Sanbasuto",
            country: "japan"
        },
        "237": {
            name: "Batorutawa",
            country: "other"
        },
        "238": {
            name: "Shizukana",
            country: "japan"
        },
        "239": {
            name: "M49 Amphibian",
            country: "usa"
        },
        "240": {
            name: "NM-115",
            country: "other"
        },
        "241": {
            name: "Skogtanken",
            country: "germany"
        },
        "242": {
            name: "Ironfist",
            country: "other"
        },
        "243": {
            name: "Tursas",
            country: "other"
        },
        "244": {
            name: "Balder",
            country: "germany"
        },
        "245": {
            name: "Sammon",
            country: "france"
        },
        "246": {
            name: "Krieger II",
            country: "germany"
        },
        "247": {
            name: "Kammerjager",
            country: "germany"
        },
        "248": {
            name: "M38-I Slugger",
            country: "usa"
        },
        "249": {
            name: "M-37-MDP",
            country: "sweden"
        },
        "250": {
            name: "Emperor Mk.I-P",
            country: "britain"
        },
        "251": {
            name: "Exterminateur",
            country: "france"
        },
        "252": {
            name: "Victorieux",
            country: "france"
        },
        "253": {
            name: "Royal Guard-IP",
            country: "other"
        },
        "254": {
            name: "FT VI",
            country: "france"
        },
        "255": {
            name: "Ка-Чи",
            country: "japan"
        },
        "256": {
            name: "ИС-7",
            country: "ussr"
        },
        "257": {
            name: "M2V2",
            country: "usa"
        },
        "258": {
            name: "Pharaon II",
            country: "other"
        },
        "259": {
            name: "FT IV",
            country: "france"
        },
        "260": {
            name: "Lebrun A1",
            country: "other"
        },
        "261": {
            name: "QVIII",
            country: "france"
        },
        "262": {
            name: "ЛБ2",
            country: "ussr"
        },
        "263": {
            name: "ФД",
            country: "ussr"
        },
        "264": {
            name: "ГМ1",
            country: "ussr"
        },
        "265": {
            name: "О-И",
            country: "ussr"
        },
        "266": {
            name: "Fiat M16/43",
            country: "italy"
        },
        "267": {
            name: "P26/40",
            country: "italy"
        },
        "268": {
            name: "Renault R35",
            country: "france"
        },
        "269": {
            name: "T29",
            country: "usa"
        },
        "270": {
            name: "AMX-50F",
            country: "france"
        },
        "271": {
            name: "LVT (А)(4)",
            country: "usa"
        },
        "272": {
            name: "СМК",
            country: "ussr"
        },
        "273": {
            name: "Fiat M13/40",
            country: "italy"
        },
        "274": {
            name: "MAN 30.02",
            country: "germany"
        },
        "275": {
            name: "CV35",
            country: "italy"
        },
        "276": {
            name: "E.B.R. 75",
            country: "france"
        },
        "277": {
            name: "T-37A",
            country: "ussr"
        },
        "278": {
            name: "Kolohousenka 50",
            country: "czech"
        },
        "279": {
            name: "Vickers Mark II",
            country: "britain"
        },
        "280": {
            name: "LT vz.35",
            country: "czech"
        },
        "281": {
            name: "ИС-1",
            country: "ussr"
        },
        "282": {
            name: "Valentine IX",
            country: "britain"
        },
        "283": {
            name: "Škoda T-25",
            country: "czech"
        },
        "284": {
            name: "T-46",
            country: "ussr"
        },
        "285": {
            name: "M46 Patton",
            country: "usa"
        },
        "286": {
            name: "Char 2C",
            country: "france"
        },
        "287": {
            name: "E-50",
            country: "germany"
        },
        "288": {
            name: "Эмиль II",
            country: "sweden"
        },
        "289": {
            name: "AT-18",
            country: "other"
        },
        "290": {
            name: "BRL 25",
            country: "france"
        },
        "291": {
            name: "P30/43",
            country: "italy"
        },
        "292": {
            name: "AC1 Ньюман",
            country: "other"
        },
        "293": {
            name: "Гепард А",
            country: "germany"
        },
        "294": {
            name: "Объект 279",
            country: "ussr"
        },
        "295": {
            name: "Turan III",
            country: "other"
        },
        "296": {
            name: "T18",
            country: "usa"
        },
        "297": {
            name: "P. 100 Ratte",
            country: "germany"
        },
        "298": {
            name: "Challenger A30",
            country: "britain"
        },
        "299": {
            name: "AMX-30",
            country: "france"
        },
        "300": {
            name: "T55 Fort Knox",
            country: "usa"
        },
        "301": {
            name: "M9 Pierce",
            country: "usa"
        },
        "302": {
            name: "ИС-4",
            country: "ussr"
        },
        "303": {
            name: "Мясник 31",
            country: "ussr"
        },
        "304": {
            name: "TKS",
            country: "poland"
        },
        "305": {
            name: "A-32",
            country: "ussr"
        },
        "306": {
            name: "Тетрарх",
            country: "britain"
        },
        "307": {
            name: "Гроте",
            country: "ussr"
        },
        "308": {
            name: "ПТ-76",
            country: "ussr"
        },
        "309": {
            name: "OT-7",
            country: "ussr"
        },
        "310": {
            name: "Mk VI",
            country: "britain"
        },
        "311": {
            name: "Flammpanzer",
            country: "germany"
        },
        "312": {
            name: "КВ-122",
            country: "ussr"
        },
        "313": {
            name: "AMR 35",
            country: "france"
        },
        "314": {
            name: "Маус",
            country: "germany"
        },
        "315": {
            name: "T-29A",
            country: "ussr"
        },
        "316": {
            name: "Йи-Го",
            country: "japan"
        },
        "317": {
            name: "Rheinmetall",
            country: "germany"
        },
        "318": {
            name: "Ка-Ми",
            country: "japan"
        },
        "319": {
            name: "РБТ-5",
            country: "ussr"
        },
        "320": {
            name: "Mk.VII Crocodile",
            country: "britain"
        },
        "321": {
            name: "M60",
            country: "usa"
        },
        "322": {
            name: "AMC 35",
            country: "france"
        },
        "323": {
            name: "ИС-5",
            country: "ussr"
        },
        "324": {
            name: "Хо-И",
            country: "japan"
        },
        "325": {
            name: "ИС-6",
            country: "ussr"
        },
        "326": {
            name: "M2A2 Мэй Уэст",
            country: "usa"
        },
        "327": {
            name: "T-55",
            country: "ussr"
        },
        "328": {
            name: "Крусейдер II",
            country: "britain"
        },
        "329": {
            name: "T32",
            country: "usa"
        },
        "330": {
            name: "Крусейдер III",
            country: "britain"
        },
        "331": {
            name: "M47 Patton II",
            country: "usa"
        },
        "332": {
            name: "Объект 430",
            country: "ussr"
        },
        "333": {
            name: "БМП-1",
            country: "ussr"
        },
        "334": {
            name: "Flammwagen",
            country: "germany"
        },
        "335": {
            name: "FV4005 Stage II",
            country: "britain"
        },
        "336": {
            name: "Тип 95",
            country: "japan"
        },
        "337": {
            name: "Тип 61",
            country: "japan"
        },
        "338": {
            name: "Чифтен",
            country: "britain"
        },
        "339": {
            name: "A1E1 Independent",
            country: "britain"
        },
        "340": {
            name: "FV 221 Caernarvon",
            country: "britain"
        },
        "341": {
            name: "Кромвель VI",
            country: "britain"
        },
        "342": {
            name: "Аутоблинда 43",
            country: "italy"
        },
        "343": {
            name: "Т-62",
            country: "ussr"
        },
        "344": {
            name: "T-126СП",
            country: "ussr"
        },
        "345": {
            name: "Ландсверк Л-60",
            country: "sweden"
        },
        "346": {
            name: "M48 Patton III",
            country: "usa"
        },
        "347": {
            name: "VK 3601 (H)",
            country: "germany"
        },
        "348": {
            name: "БT-7A",
            country: "ussr"
        },
        "349": {
            name: "AMC 34",
            country: "france"
        },
        "350": {
            name: "Рэм I",
            country: "germany"
        },
        "351": {
            name: "VK 4502 (P)",
            country: "germany"
        },
        "352": {
            name: "TVP",
            country: "czech"
        },
        "353": {
            name: "Саранча 10",
            country: "germany"
        },
        "354": {
            name: "TOG II",
            country: "britain"
        },
        "355": {
            name: "T30",
            country: "usa"
        },
        "356": {
            name: "M4/FL10",
            country: "france"
        },
        "357": {
            name: "О-Хо",
            country: "japan"
        },
        "358": {
            name: "ХТ-26",
            country: "ussr"
        },
        "359": {
            name: "То-Ку",
            country: "japan"
        },
        "360": {
            name: "Valentine XI",
            country: "britain"
        },
        "361": {
            name: "Лукс",
            country: "germany"
        },
        "362": {
            name: "Супер Першинг",
            country: "usa"
        },
        "363": {
            name: "ФИАТ 6614",
            country: "italy"
        },
        "364": {
            name: "Уокер Бульдог",
            country: "usa"
        },
        "365": {
            name: "M60A2 Старшип",
            country: "usa"
        },
        "366": {
            name: "Тип 74",
            country: "japan"
        },
        "367": {
            name: "КВ-85",
            country: "ussr"
        },
        "368": {
            name: "Т-64А",
            country: "ussr"
        },
        "369": {
            name: "A30 Avenger",
            country: "britain"
        },
        "370": {
            name: "TAM",
            country: "other"
        },
        "371": {
            name: "L6/40",
            country: "italy"
        },
        "372": {
            name: "ТК Осокина",
            country: "ussr"
        },
        "373": {
            name: "Магах",
            country: "usa"
        },
        "374": {
            name: "T95",
            country: "usa"
        }
    },
    "2": {
        "0": {
            name: "ПТРС",
            country: "ussr"
        },
        "1": {
            name: "Миномет",
            country: "ussr"
        },
        "2": {
            name: "52-П-353",
            country: "ussr"
        },
        "3": {
            name: "53К",
            country: "ussr"
        },
        "4": {
            name: "ЗИС-2",
            country: "ussr"
        },
        "5": {
            name: "ХТЗ",
            country: "ussr"
        },
        "6": {
            name: "СУ-18",
            country: "ussr"
        },
        "7": {
            name: "СУ-5",
            country: "ussr"
        },
        "8": {
            name: "АТ-1",
            country: "ussr"
        },
        "9": {
            name: "СУ-122",
            country: "ussr"
        },
        "10": {
            name: "СУ-76",
            country: "ussr"
        },
        "11": {
            name: "Marder 2",
            country: "germany"
        },
        "12": {
            name: "Marder 3H",
            country: "germany"
        },
        "13": {
            name: "Hetzer",
            country: "germany"
        },
        "14": {
            name: "СУ-8",
            country: "ussr"
        },
        "15": {
            name: "212A",
            country: "ussr"
        },
        "16": {
            name: "СУ-26",
            country: "ussr"
        },
        "17": {
            name: "С-51",
            country: "ussr"
        },
        "18": {
            name: "СУ-14-1",
            country: "ussr"
        },
        "19": {
            name: "СУ-85Б",
            country: "ussr"
        },
        "20": {
            name: "СУ-14-2",
            country: "ussr"
        },
        "21": {
            name: "СУ-85",
            country: "ussr"
        },
        "22": {
            name: "СУ-100М1",
            country: "ussr"
        },
        "23": {
            name: "СУ-100Y",
            country: "ussr"
        },
        "24": {
            name: "СУ-101",
            country: "ussr"
        },
        "25": {
            name: "T57",
            country: "usa"
        },
        "26": {
            name: "М12В",
            country: "usa"
        },
        "27": {
            name: "СУ-122-44",
            country: "ussr"
        },
        "28": {
            name: "Т67",
            country: "usa"
        },
        "29": {
            name: "M8A1",
            country: "usa"
        },
        "30": {
            name: "T18",
            country: "usa"
        },
        "31": {
            name: "M41",
            country: "usa"
        },
        "32": {
            name: "M18 Hellcat",
            country: "usa"
        },
        "33": {
            name: "M37",
            country: "usa"
        },
        "34": {
            name: "T28",
            country: "usa"
        },
        "35": {
            name: "M36 Jackson",
            country: "usa"
        },
        "36": {
            name: "Panzerjager",
            country: "germany"
        },
        "37": {
            name: "DickerMax",
            country: "germany"
        },
        "38": {
            name: "T25AT",
            country: "usa"
        },
        "39": {
            name: "T25-2",
            country: "usa"
        },
        "40": {
            name: "Universal carrier",
            country: "britain"
        },
        "41": {
            name: "Alectro",
            country: "other"
        },
        "42": {
            name: "Pz.Slf.IVc",
            country: "germany"
        },
        "43": {
            name: "ValentineAT",
            country: "britain"
        },
        "44": {
            name: "Archer",
            country: "sweden"
        },
        "45": {
            name: "AT2",
            country: "britain"
        },
        "46": {
            name: "StugIII AusfB",
            country: "germany"
        },
        "47": {
            name: "StugIV",
            country: "germany"
        },
        "48": {
            name: "Bishop",
            country: "britain"
        },
        "49": {
            name: "GunCarrier3",
            country: "britain"
        },
        "50": {
            name: "StugIII AusfG",
            country: "germany"
        },
        "51": {
            name: "M92",
            country: "usa"
        },
        "52": {
            name: "ИСУ-130",
            country: "ussr"
        },
        "53": {
            name: "ИСУ-152-2",
            country: "ussr"
        },
        "54": {
            name: "Birch Gun",
            country: "britain"
        },
        "55": {
            name: "АТ8",
            country: "britain"
        },
        "56": {
            name: "AT 15A",
            country: "britain"
        },
        "57": {
            name: "JagdPanter",
            country: "germany"
        },
        "58": {
            name: "Wespe",
            country: "germany"
        },
        "59": {
            name: "Jagdpanzer IV",
            country: "germany"
        },
        "60": {
            name: "Nashorn",
            country: "germany"
        },
        "61": {
            name: "G. Pz. Mk. VI",
            country: "germany"
        },
        "62": {
            name: "Sturm I Bison",
            country: "germany"
        },
        "63": {
            name: "Grille",
            country: "germany"
        },
        "64": {
            name: "Hummel",
            country: "germany"
        },
        "65": {
            name: "Renault UE 57",
            country: "france"
        },
        "66": {
            name: "Renault FT-AT",
            country: "france"
        },
        "67": {
            name: "AMX AC mle.48",
            country: "france"
        },
        "68": {
            name: "Ferdinand",
            country: "germany"
        },
        "69": {
            name: "Sturer Emil",
            country: "germany"
        },
        "70": {
            name: "AMX 50 Foch",
            country: "france"
        },
        "71": {
            name: "AMX AC46",
            country: "france"
        },
        "72": {
            name: "ARL V39",
            country: "france"
        },
        "73": {
            name: "S35 CA",
            country: "france"
        },
        "74": {
            name: "105 leFH18B2",
            country: "france"
        },
        "75": {
            name: "AMX-13 F3",
            country: "france"
        },
        "76": {
            name: "Lorraine 155 mle. 51",
            country: "france"
        },
        "77": {
            name: "Bat Chatillon",
            country: "france"
        },
        "78": {
            name: "Lorraine 155 mle 50",
            country: "france"
        },
        "79": {
            name: "Bat Chatillon 155 58",
            country: "france"
        },
        "80": {
            name: "AMX 105 AM mle.47",
            country: "france"
        },
        "81": {
            name: "Sturmtiger",
            country: "germany"
        },
        "82": {
            name: "M43 Zrinyi",
            country: "usa"
        },
        "83": {
            name: "Jagdpanzer 70",
            country: "germany"
        },
        "84": {
            name: "B-4 Москва",
            country: "ussr"
        },
        "85": {
            name: "Катюша",
            country: "ussr"
        },
        "86": {
            name: "БТ-42",
            country: "ussr"
        },
        "87": {
            name: "HONI-3",
            country: "japan"
        },
        "88": {
            name: "Sovemento 149",
            country: "italy"
        },
        "89": {
            name: "ARG-9",
            country: "other"
        },
        "90": {
            name: "Sovemento 75",
            country: "italy"
        },
        "91": {
            name: "КВ-7 Прототип",
            country: "ussr"
        },
        "92": {
            name: "Хо-Ри",
            country: "japan"
        },
        "93": {
            name: "Объект 268",
            country: "ussr"
        },
        "94": {
            name: "ОСУ-76",
            country: "ussr"
        },
        "95": {
            name: "СУ-ИТ-45",
            country: "ussr"
        },
        "96": {
            name: "СУ-74Д",
            country: "ussr"
        },
        "97": {
            name: "ГАЗ-75",
            country: "ussr"
        },
        "98": {
            name: "KВ-4 КТТС",
            country: "ussr"
        },
        "99": {
            name: "Panzerwagen",
            country: "germany"
        },
        "100": {
            name: "Semovente da 75",
            country: "italy"
        },
        "101": {
            name: "Wolverine",
            country: "usa"
        },
        "102": {
            name: "M44",
            country: "usa"
        },
        "103": {
            name: "M43-M",
            country: "usa"
        },
        "104": {
            name: "Panzerjager-II-P",
            country: "germany"
        },
        "105": {
            name: "Waffentrager",
            country: "germany"
        },
        "106": {
            name: "PzKpfw I-A",
            country: "germany"
        },
        "107": {
            name: "САУ Homisse",
            country: "germany"
        },
        "108": {
            name: "Sf L/61",
            country: "germany"
        },
        "109": {
            name: "Engelfeuer",
            country: "germany"
        },
        "110": {
            name: "САУ-Т92",
            country: "usa"
        },
        "111": {
            name: "У-20-II",
            country: "ussr"
        },
        "112": {
            name: "АСУ-П",
            country: "ussr"
        },
        "113": {
            name: "Хо-Ро- II",
            country: "japan"
        },
        "114": {
            name: "Хо-Ни - II",
            country: "japan"
        },
        "115": {
            name: "Хо-Ни",
            country: "japan"
        },
        "116": {
            name: "Ka-Mi T3",
            country: "japan"
        },
        "117": {
            name: "Type 3-II-OP",
            country: "japan"
        },
        "118": {
            name: "Sd. Kfz 6",
            country: "germany"
        },
        "119": {
            name: "Hollenhund Pz 37",
            country: "germany"
        },
        "120": {
            name: "Sd. Kfz 7",
            country: "germany"
        },
        "121": {
            name: "Sd. Kfz 8",
            country: "germany"
        },
        "122": {
            name: "БоП-85-П",
            country: "ussr"
        },
        "123": {
            name: "СУ-123-БП",
            country: "ussr"
        },
        "124": {
            name: "Riese-2-II",
            country: "italy"
        },
        "125": {
            name: "SCHNITTER-I-3Z",
            country: "germany"
        },
        "126": {
            name: "M1933-P",
            country: "usa"
        },
        "127": {
            name: "M15-II",
            country: "usa"
        },
        "128": {
            name: "Aftermath",
            country: "usa"
        },
        "129": {
            name: "Panzerung",
            country: "germany"
        },
        "130": {
            name: "Ти-Ки",
            country: "japan"
        },
        "131": {
            name: "Steierbach",
            country: "other"
        },
        "132": {
            name: "СТЗ-5-НАТИ",
            country: "ussr"
        },
        "133": {
            name: "Nebelwerfer",
            country: "germany"
        },
        "134": {
            name: "Feuer Ang",
            country: "germany"
        },
        "135": {
            name: "EM-TSK",
            country: "other"
        },
        "136": {
            name: "M10 A2",
            country: "usa"
        },
        "137": {
            name: "Тип 4 Ха-То",
            country: "japan"
        },
        "138": {
            name: "Карл",
            country: "germany"
        },
        "139": {
            name: "Borsig",
            country: "germany"
        },
        "140": {
            name: "Landsverk L-62",
            country: "sweden"
        },
        "141": {
            name: "Marder I",
            country: "germany"
        },
        "142": {
            name: "M110",
            country: "usa"
        },
        "143": {
            name: "Sexton",
            country: "usa"
        },
        "144": {
            name: "Sturmpanzer IV",
            country: "germany"
        },
        "145": {
            name: "T48",
            country: "usa"
        },
        "146": {
            name: "Bassotto",
            country: "italy"
        },
        "147": {
            name: "Jagdtiger",
            country: "germany"
        },
        "148": {
            name: "SdKfz 135/1",
            country: "germany"
        },
        "149": {
            name: "IKV 103",
            country: "sweden"
        },
        "150": {
            name: "T92",
            country: "usa"
        },
        "151": {
            name: "M56 Скорпион",
            country: "usa"
        },
        "152": {
            name: "M16",
            country: "usa"
        },
        "153": {
            name: "Vickers QF 18",
            country: "britain"
        },
        "154": {
            name: "T18 HMC",
            country: "usa"
        },
        "155": {
            name: "Panzerjager 35R",
            country: "germany"
        },
        "156": {
            name: "Tortoise A39",
            country: "britain"
        },
        "157": {
            name: "Jagdpanther M",
            country: "germany"
        },
        "158": {
            name: "FV Type43",
            country: "britain"
        },
        "159": {
            name: "Type 5 Na-To",
            country: "japan"
        },
        "160": {
            name: "Wasp Mk II",
            country: "britain"
        },
        "161": {
            name: "M50 Ontos",
            country: "usa"
        },
        "162": {
            name: "Kugelblitz",
            country: "germany"
        },
        "163": {
            name: "M114A2",
            country: "usa"
        },
        "164": {
            name: "M13",
            country: "usa"
        },
        "165": {
            name: "StuH 42",
            country: "germany"
        },
        "166": {
            name: "ЗСУ-37",
            country: "ussr"
        },
        "167": {
            name: "FV4004 Conway",
            country: "britain"
        },
        "168": {
            name: "M42 Duster",
            country: "usa"
        },
        "169": {
            name: "FV433 Abbot",
            country: "britain"
        },
        "170": {
            name: "ЗСУ-57-2",
            country: "ussr"
        },
        "171": {
            name: "ЗИС-30",
            country: "ussr"
        },
        "172": {
            name: "Т34 Calliope",
            country: "usa"
        },
        "173": {
            name: "Citroen Kegresse",
            country: "france"
        },
        "174": {
            name: "Штурмпанцер II",
            country: "germany"
        },
        "175": {
            name: "ЗиС-12",
            country: "ussr"
        },
        "176": {
            name: "2С3 Акация",
            country: "ussr"
        },
        "177": {
            name: "Тип 60",
            country: "japan"
        },
        "178": {
            name: "БМ-8-24",
            country: "ussr"
        },
        "179": {
            name: "Kanonenjagdpanzer",
            country: "germany"
        },
        "180": {
            name: "M3",
            country: "usa"
        },
        "181": {
            name: "Та-Се",
            country: "japan"
        },
        "182": {
            name: "Raketenjagdpanzer 2",
            country: "germany"
        },
        "183": {
            name: "P. 1500 Монстр",
            country: "germany"
        },
        "184": {
            name: "Breda 501",
            country: "italy"
        },
        "185": {
            name: "Sem. da 47/32",
            country: "italy"
        },
        "186": {
            name: "Cannone da 90/53",
            country: "italy"
        },
        "187": {
            name: "Ikv 72",
            country: "sweden"
        },
        "188": {
            name: "ЗиС-43",
            country: "ussr"
        },
        "189": {
            name: "Sd.Kfz.234",
            country: "germany"
        },
        "190": {
            name: "M12 GDZ",
            country: "usa"
        },
        "191": {
            name: "M33",
            country: "usa"
        },
        "192": {
            name: "Strv 103",
            country: "sweden"
        },
        "193": {
            name: "ИТ-1",
            country: "ussr"
        },
        "194": {
            name: "Panzerwerfer",
            country: "germany"
        },
        "195": {
            name: "ИСУ-122",
            country: "ussr"
        },
        "196": {
            name: "M19",
            country: "usa"
        },
        "197": {
            name: "АСУ-85",
            country: "ussr"
        },
        "198": {
            name: "Flakpanzer I",
            country: "germany"
        },
        "199": {
            name: "Falcon",
            country: "other"
        },
        "200": {
            name: "Объект 269",
            country: "ussr"
        },
        "201": {
            name: "Объект 600",
            country: "ussr"
        },
        "202": {
            name: "Хо-Ро",
            country: "japan"
        },
        "203": {
            name: "Т-26-4",
            country: "ussr"
        },
        "204": {
            name: "Crusader AA",
            country: "britain"
        }
    },
    "3": {
        "0": {
            name: "И-153",
            country: "ussr"
        },
        "1": {
            name: "Су-6 М-42",
            country: "ussr"
        },
        "2": {
            name: "И-16",
            country: "ussr"
        },
        "3": {
            name: "Р-10",
            country: "ussr"
        },
        "4": {
            name: "Су-2",
            country: "ussr"
        },
        "5": {
            name: "У-2ЛШ",
            country: "ussr"
        },
        "6": {
            name: "УТ-2М",
            country: "ussr"
        },
        "7": {
            name: "УТ-1б",
            country: "ussr"
        },
        "8": {
            name: "Ил-2",
            country: "ussr"
        },
        "9": {
            name: "ЛаГГ-3",
            country: "ussr"
        },
        "10": {
            name: "Миг-9",
            country: "ussr"
        },
        "11": {
            name: "Ла-5",
            country: "ussr"
        },
        "12": {
            name: "Як-4",
            country: "ussr"
        },
        "13": {
            name: "А-73а",
            country: "ussr"
        },
        "14": {
            name: "Ил-2М3",
            country: "ussr"
        },
        "15": {
            name: "МиГ-3",
            country: "ussr"
        },
        "16": {
            name: "He-170",
            country: "germany"
        },
        "17": {
            name: "Fi-156",
            country: "germany"
        },
        "18": {
            name: "Fw 190D",
            country: "germany"
        },
        "19": {
            name: "Hs 126",
            country: "germany"
        },
        "20": {
            name: "Me.309",
            country: "germany"
        },
        "21": {
            name: "Ta 152H",
            country: "germany"
        },
        "22": {
            name: "Junkers Ju 87G",
            country: "germany"
        },
        "23": {
            name: "Junkers Ju 87",
            country: "germany"
        },
        "24": {
            name: "Bristol 133",
            country: "britain"
        },
        "25": {
            name: "Bristol Bulldog",
            country: "britain"
        },
        "26": {
            name: "Fairey Fantome",
            country: "britain"
        },
        "27": {
            name: "CAC CA-12 Boomerang",
            country: "other"
        },
        "28": {
            name: "Supermarine Spitfire",
            country: "britain"
        },
        "29": {
            name: "Bristol Type 146",
            country: "britain"
        },
        "30": {
            name: "Gloster Meteor F1",
            country: "britain"
        },
        "31": {
            name: "Supermarine Spitfire I",
            country: "britain"
        },
        "32": {
            name: "Type 224",
            country: "britain"
        },
        "33": {
            name: "Spitfire XIV",
            country: "britain"
        },
        "34": {
            name: "Curtiss P-23",
            country: "usa"
        },
        "35": {
            name: "Brewster F2A-1",
            country: "usa"
        },
        "36": {
            name: "Curtiss Hawk-75M",
            country: "usa"
        },
        "37": {
            name: "Messerschmitt-1092",
            country: "germany"
        },
        "38": {
            name: "Curtiss XP-31",
            country: "usa"
        },
        "39": {
            name: "Arado Ar 68",
            country: "germany"
        },
        "40": {
            name: "Fw 189",
            country: "germany"
        },
        "41": {
            name: "AGO Ao.192 Kurier",
            country: "germany"
        },
        "42": {
            name: "Дорнье Do 17",
            country: "germany"
        },
        "43": {
            name: "MS.406",
            country: "france"
        },
        "44": {
            name: "Hawk 75",
            country: "usa"
        },
        "45": {
            name: "VG 39",
            country: "france"
        },
        "46": {
            name: "BF 109G",
            country: "germany"
        },
        "47": {
            name: "D520",
            country: "britain"
        },
        "48": {
            name: "Туполев ТБ-1",
            country: "ussr"
        },
        "49": {
            name: "Bloch 152",
            country: "france"
        },
        "50": {
            name: "Nightmare-A1",
            country: "other"
        },
        "51": {
            name: "Bf-109E",
            country: "germany"
        },
        "52": {
            name: "MB-700",
            country: "france"
        },
        "53": {
            name: "VB-10 Арсенал",
            country: "france"
        },
        "54": {
            name: "Latecoere 299",
            country: "france"
        },
        "55": {
            name: "B-25",
            country: "usa"
        },
        "56": {
            name: "Curtiss P-40N",
            country: "usa"
        },
        "57": {
            name: "CAO 200",
            country: "france"
        },
        "58": {
            name: "AW-41",
            country: "britain"
        },
        "59": {
            name: "Р-40 Томагавк",
            country: "usa"
        },
        "60": {
            name: "Caudron 770",
            country: "france"
        },
        "61": {
            name: "P-43",
            country: "usa"
        },
        "62": {
            name: "Havoc",
            country: "usa"
        },
        "63": {
            name: "A20-G",
            country: "usa"
        },
        "64": {
            name: "FW-190A-3",
            country: "germany"
        },
        "65": {
            name: "P-47N",
            country: "usa"
        },
        "66": {
            name: "F6F-1",
            country: "usa"
        },
        "67": {
            name: "BF: 8F1",
            country: "germany"
        },
        "68": {
            name: "P51D",
            country: "usa"
        },
        "69": {
            name: "P51B",
            country: "usa"
        },
        "70": {
            name: "Fi-157",
            country: "germany"
        },
        "71": {
            name: "Вотур II",
            country: "france"
        },
        "72": {
            name: "D.520-II",
            country: "britain"
        },
        "73": {
            name: "Bloch-170",
            country: "france"
        },
        "74": {
            name: "А-20-Л",
            country: "ussr"
        },
        "75": {
            name: "Havilland Mosquito",
            country: "britain"
        },
        "76": {
            name: "Blackburn Botha",
            country: "britain"
        },
        "77": {
            name: "P-82",
            country: "usa"
        },
        "78": {
            name: "P-38",
            country: "usa"
        },
        "79": {
            name: "Arsenal VG.33",
            country: "france"
        },
        "80": {
            name: "Saulnier МS.406-IIP",
            country: "france"
        },
        "81": {
            name: "Ki-43",
            country: "japan"
        },
        "82": {
            name: "Ki-84 Hayate",
            country: "japan"
        },
        "83": {
            name: "И-15",
            country: "ussr"
        },
        "84": {
            name: "E7N",
            country: "japan"
        },
        "85": {
            name: "Ту-2",
            country: "ussr"
        },
        "86": {
            name: "HS-50",
            country: "germany"
        },
        "87": {
            name: "Fiat CR.32",
            country: "italy"
        },
        "88": {
            name: "Mitsubishi Ki-59",
            country: "japan"
        },
        "89": {
            name: "Takeshi Ki-70",
            country: "japan"
        },
        "90": {
            name: "Fairey Firefly",
            country: "britain"
        },
        "91": {
            name: "MC202",
            country: "italy"
        },
        "92": {
            name: "Desert Storm",
            country: "other"
        },
        "93": {
            name: "Fairey Baracuda",
            country: "britain"
        },
        "94": {
            name: "Fairey Battle",
            country: "britain"
        },
        "95": {
            name: "Fairey Fulmar",
            country: "britain"
        },
        "96": {
            name: "Hirayama Ki-11",
            country: "japan"
        },
        "97": {
            name: "Gloster Meteor",
            country: "britain"
        },
        "98": {
            name: "Dewoitine D.523",
            country: "france"
        },
        "99": {
            name: "Boulton Paul",
            country: "britain"
        },
        "100": {
            name: "Caudron CR.714",
            country: "france"
        },
        "101": {
            name: "Hawker Tempest",
            country: "britain"
        },
        "102": {
            name: "Bell P-39",
            country: "usa"
        },
        "103": {
            name: "Takigawa-M",
            country: "japan"
        },
        "104": {
            name: "Glorybringer",
            country: "other"
        },
        "105": {
            name: "Redwood",
            country: "other"
        },
        "106": {
            name: "BE-64",
            country: "usa"
        },
        "107": {
            name: "Мустанг МК3",
            country: "britain"
        },
        "108": {
            name: "Warhawk X40",
            country: "usa"
        },
        "109": {
            name: "IMAM Ro.57",
            country: "italy"
        },
        "110": {
            name: "Tachikawa Ki-94I",
            country: "japan"
        },
        "111": {
            name: "Amb. SS.4",
            country: "italy"
        },
        "112": {
            name: "Handley Page Halifax",
            country: "britain"
        },
        "113": {
            name: "P-64",
            country: "usa"
        },
        "114": {
            name: "DH.98 Mosquito",
            country: "britain"
        },
        "115": {
            name: "Fairey Gannet",
            country: "britain"
        },
        "116": {
            name: "Heinkel He111",
            country: "germany"
        },
        "117": {
            name: "Heinkel He162",
            country: "germany"
        },
        "118": {
            name: "BV 138",
            country: "germany"
        },
        "119": {
            name: "P-26 Peashooter",
            country: "usa"
        },
        "120": {
            name: "Hawker Hurricane",
            country: "britain"
        },
        "121": {
            name: "Поликарпов П-Z",
            country: "ussr"
        },
        "122": {
            name: "Seversky P-35",
            country: "usa"
        },
        "123": {
            name: "Трибфлюгель",
            country: "germany"
        },
        "124": {
            name: "B-29",
            country: "usa"
        },
        "125": {
            name: "БШ-1",
            country: "ussr"
        },
        "126": {
            name: "Grumman XP-50",
            country: "usa"
        },
        "127": {
            name: "Goldfinch",
            country: "britain"
        },
        "128": {
            name: "Як-9",
            country: "ussr"
        },
        "129": {
            name: "Seafang",
            country: "britain"
        },
        "130": {
            name: "CAC Wirraway",
            country: "other"
        },
        "131": {
            name: "Me.410",
            country: "germany"
        },
        "132": {
            name: "SNCAC NC.1070",
            country: "france"
        },
        "133": {
            name: "МиГ-13",
            country: "ussr"
        },
        "134": {
            name: "Ди-6",
            country: "ussr"
        },
        "135": {
            name: "АНТ-40",
            country: "ussr"
        },
        "136": {
            name: "Helldiver",
            country: "usa"
        },
        "137": {
            name: "Douglas SBD-3",
            country: "usa"
        },
        "138": {
            name: "Me.209 V1",
            country: "germany"
        },
        "139": {
            name: "Хеншель Hs 129",
            country: "germany"
        },
        "140": {
            name: "XP-58 Молния",
            country: "usa"
        },
        "141": {
            name: "Ла-9",
            country: "ussr"
        },
        "142": {
            name: "Виндикатор",
            country: "usa"
        },
        "143": {
            name: "Су-9",
            country: "ussr"
        },
        "144": {
            name: "Me.210",
            country: "germany"
        },
        "145": {
            name: "Ил-10",
            country: "ussr"
        },
        "146": {
            name: "Виверна",
            country: "britain"
        },
        "147": {
            name: "И-7",
            country: "ussr"
        },
        "148": {
            name: "XP-72",
            country: "usa"
        },
        "149": {
            name: "АНТ-42",
            country: "ussr"
        },
        "150": {
            name: "J7W1",
            country: "japan"
        },
        "151": {
            name: "He-219 Филин",
            country: "germany"
        },
        "152": {
            name: "Бе-6",
            country: "ussr"
        },
        "153": {
            name: "Do 335",
            country: "germany"
        },
        "154": {
            name: "Хейнкель He 51",
            country: "germany"
        },
        "155": {
            name: "Ки. 44 Сёки",
            country: "japan"
        },
        "156": {
            name: "Ла-11",
            country: "ussr"
        },
        "157": {
            name: "XP-77",
            country: "usa"
        },
        "158": {
            name: "Як-19",
            country: "ussr"
        },
        "159": {
            name: "P-29",
            country: "usa"
        },
        "160": {
            name: "Ар-2",
            country: "ussr"
        },
        "161": {
            name: "Arado Ar 80",
            country: "germany"
        },
        "162": {
            name: "Ту-4",
            country: "ussr"
        },
        "163": {
            name: "Юнкерс Ju 88",
            country: "germany"
        },
        "164": {
            name: "C.200 Саетта",
            country: "italy"
        },
        "165": {
            name: "Дорнье Do 217",
            country: "germany"
        },
        "166": {
            name: "Девуатин D.500",
            country: "france"
        },
        "167": {
            name: "Hawker Sea Fury",
            country: "britain"
        },
        "168": {
            name: "РБ-17",
            country: "ussr"
        },
        "169": {
            name: "C.202 Фольгоре",
            country: "italy"
        },
        "170": {
            name: "Мэриленд",
            country: "usa"
        },
        "171": {
            name: "Ba 349 Natter",
            country: "germany"
        },
        "172": {
            name: "Ta 154",
            country: "germany"
        },
        "173": {
            name: "Веллингтон I",
            country: "britain"
        },
        "174": {
            name: "Ла-15",
            country: "ussr"
        },
        "175": {
            name: "Bf.110 «Zerstörer»",
            country: "germany"
        },
        "176": {
            name: "Як-23",
            country: "ussr"
        },
        "177": {
            name: "Firecrest",
            country: "britain"
        },
        "178": {
            name: "LeO 451",
            country: "france"
        },
        "179": {
            name: "F4F Уайлдкэт",
            country: "usa"
        },
        "180": {
            name: "C.205 Вельтро",
            country: "italy"
        },
        "181": {
            name: "Martin B-10",
            country: "usa"
        },
        "182": {
            name: "G.50 Фреччиа",
            country: "italy"
        },
        "183": {
            name: "A6M Зеро",
            country: "japan"
        },
        "184": {
            name: "Firebrand",
            country: "britain"
        },
        "185": {
            name: "Ер-2",
            country: "ussr"
        },
        "186": {
            name: "Блок MB.162",
            country: "france"
        },
        "187": {
            name: "TBF Avenger",
            country: "usa"
        },
        "188": {
            name: "Ла-7",
            country: "ussr"
        },
        "189": {
            name: "Хейнкель Хе 100",
            country: "germany"
        },
        "190": {
            name: "Ki-61 Хиэн",
            country: "japan"
        },
        "191": {
            name: "P-63 Кингкобра",
            country: "usa"
        },
        "192": {
            name: "Хортен Ho IX",
            country: "germany"
        },
        "193": {
            name: "Вотур II",
            country: "france"
        }
    },
    "4": {
        "0": {
            name: "L Aurore",
            country: "france"
        },
        "1": {
            name: "Le Havre",
            country: "france"
        },
        "2": {
            name: "Ленинец",
            country: "ussr"
        },
        "3": {
            name: "Tourville",
            country: "france"
        },
        "4": {
            name: "Europa",
            country: "germany"
        },
        "5": {
            name: "NingHai",
            country: "china"
        },
        "6": {
            name: "Type - II",
            country: "germany"
        },
        "7": {
            name: "Adventurous",
            country: "britain"
        },
        "8": {
            name: "Z46 class",
            country: "germany"
        },
        "9": {
            name: "Akagi (1927)",
            country: "japan"
        },
        "10": {
            name: "Hood (1939)",
            country: "britain"
        },
        "11": {
            name: "Q Class",
            country: "britain"
        },
        "12": {
            name: "Implacable",
            country: "britain"
        },
        "13": {
            name: "Hiyo",
            country: "japan"
        },
        "14": {
            name: "Connecticut",
            country: "usa"
        },
        "15": {
            name: "Проект 69",
            country: "ussr"
        },
        "16": {
            name: "Prince Of Wales",
            country: "britain"
        },
        "17": {
            name: "Проект 24",
            country: "ussr"
        },
        "18": {
            name: "Gaius Duilius",
            country: "italy"
        },
        "19": {
            name: "Argonaute",
            country: "france"
        },
        "20": {
            name: "Type U - Flak I",
            country: "germany"
        },
        "21": {
            name: "Asama",
            country: "japan"
        },
        "22": {
            name: "H44 Class",
            country: "germany"
        },
        "23": {
            name: "Kai-Kou Type",
            country: "japan"
        },
        "24": {
            name: "Бородино",
            country: "ussr"
        },
        "25": {
            name: "Kii",
            country: "japan"
        },
        "26": {
            name: "Hiraga Project",
            country: "japan"
        },
        "27": {
            name: "Courageous",
            country: "britain"
        },
        "28": {
            name: "HanQing",
            country: "china"
        },
        "29": {
            name: "Севастополь",
            country: "ussr"
        },
        "30": {
            name: "Февраль",
            country: "ussr"
        },
        "31": {
            name: "Graf Zeppelin II",
            country: "germany"
        },
        "32": {
            name: "Gneisenau",
            country: "germany"
        },
        "33": {
            name: "Hirakaku",
            country: "japan"
        },
        "34": {
            name: "York",
            country: "britain"
        },
        "35": {
            name: "Surcouf",
            country: "france"
        },
        "36": {
            name: "Iowa",
            country: "usa"
        },
        "37": {
            name: "Yubari",
            country: "japan"
        },
        "38": {
            name: "Dante Alighieri",
            country: "italy"
        },
        "39": {
            name: "Emile Bertin",
            country: "france"
        },
        "40": {
            name: "Lyon (1943)",
            country: "france"
        },
        "41": {
            name: "Caio Duilio (1937)",
            country: "italy"
        },
        "42": {
            name: "Soldati I",
            country: "italy"
        },
        "43": {
            name: "Кронштадт",
            country: "ussr"
        },
        "44": {
            name: "Проект 25",
            country: "ussr"
        },
        "45": {
            name: "Kitakami",
            country: "japan"
        },
        "46": {
            name: "Gamelin",
            country: "france"
        },
        "47": {
            name: "S Type",
            country: "usa"
        },
        "48": {
            name: "Красный Кавказ",
            country: "ussr"
        },
        "49": {
            name: "FuWei",
            country: "china"
        },
        "50": {
            name: "Spaehkreuzer (D38)",
            country: "germany"
        },
        "51": {
            name: "Cesare Borgia",
            country: "italy"
        },
        "52": {
            name: "Aquila",
            country: "italy"
        },
        "53": {
            name: "Gato",
            country: "usa"
        },
        "54": {
            name: "Le Fantasque",
            country: "france"
        },
        "55": {
            name: "Z99 Class",
            country: "germany"
        },
        "56": {
            name: "Malta Project",
            country: "britain"
        },
        "57": {
            name: "Belleau Wood",
            country: "usa"
        },
        "58": {
            name: "Emerald",
            country: "britain"
        },
        "59": {
            name: "Shinshumaru",
            country: "japan"
        },
        "60": {
            name: "M Type",
            country: "britain"
        },
        "61": {
            name: "Hood (1943)",
            country: "britain"
        },
        "62": {
            name: "King George VI",
            country: "britain"
        },
        "63": {
            name: "Ark Royal",
            country: "britain"
        },
        "64": {
            name: "Hood",
            country: "britain"
        },
        "65": {
            name: "Spaehkreuzer (D40)",
            country: "germany"
        },
        "66": {
            name: "Akitsuki-Kai",
            country: "japan"
        },
        "67": {
            name: "Sirius",
            country: "britain"
        },
        "68": {
            name: "Falco",
            country: "italy"
        },
        "69": {
            name: "Soldati II",
            country: "italy"
        },
        "70": {
            name: "Tribal",
            country: "britain"
        },
        "71": {
            name: "Essex",
            country: "usa"
        },
        "72": {
            name: "Гневный",
            country: "ussr"
        },
        "73": {
            name: "Паллада",
            country: "ussr"
        },
        "74": {
            name: "Clemenceau (1943)",
            country: "france"
        },
        "75": {
            name: "Jiguang",
            country: "china"
        },
        "76": {
            name: "DDX Project",
            country: "usa"
        },
        "77": {
            name: "Zara",
            country: "italy"
        },
        "78": {
            name: "Midway",
            country: "usa"
        },
        "79": {
            name: "Kaiser",
            country: "germany"
        },
        "80": {
            name: "Agano",
            country: "japan"
        },
        "81": {
            name: "Kongo",
            country: "japan"
        },
        "82": {
            name: "Dreadnought",
            country: "britain"
        },
        "83": {
            name: "Kuma",
            country: "japan"
        },
        "84": {
            name: "Balao",
            country: "usa"
        },
        "85": {
            name: "Amagi",
            country: "japan"
        },
        "86": {
            name: "XianNing",
            country: "china"
        },
        "87": {
            name: "HaiBao",
            country: "china"
        },
        "88": {
            name: "Bretagne",
            country: "france"
        },
        "89": {
            name: "Kaga (1935)",
            country: "japan"
        },
        "90": {
            name: "Texas",
            country: "usa"
        },
        "91": {
            name: "Duke of Edinburgh",
            country: "britain"
        },
        "92": {
            name: "Arizona (1941)",
            country: "usa"
        },
        "93": {
            name: "Italy Project41-B",
            country: "italy"
        },
        "94": {
            name: "Tiger",
            country: "britain"
        },
        "95": {
            name: "Randall",
            country: "usa"
        },
        "96": {
            name: "HEI Type I",
            country: "japan"
        },
        "97": {
            name: "Calais",
            country: "france"
        },
        "98": {
            name: "Проект 71",
            country: "ussr"
        },
        "99": {
            name: "O Project II",
            country: "germany"
        },
        "100": {
            name: "Courbet",
            country: "france"
        },
        "101": {
            name: "Fletcher",
            country: "usa"
        },
        "102": {
            name: "Guam",
            country: "usa"
        },
        "103": {
            name: "ZhongShan",
            country: "china"
        },
        "104": {
            name: "Rota (1925)",
            country: "italy"
        },
        "105": {
            name: "King George V",
            country: "britain"
        },
        "106": {
            name: "Thunderer",
            country: "britain"
        },
        "107": {
            name: "Duguay Trouin",
            country: "france"
        },
        "108": {
            name: "Nevada",
            country: "usa"
        },
        "109": {
            name: "Комсомолец (1927)",
            country: "ussr"
        },
        "110": {
            name: "Franz",
            country: "germany"
        },
        "111": {
            name: "Emden",
            country: "germany"
        },
        "112": {
            name: "Sirene",
            country: "france"
        },
        "113": {
            name: "Truguet",
            country: "france"
        },
        "114": {
            name: "Императрица Мария",
            country: "ussr"
        },
        "115": {
            name: "Junyo",
            country: "japan"
        },
        "116": {
            name: "HaiShi",
            country: "china"
        },
        "117": {
            name: "Baltimore",
            country: "usa"
        },
        "118": {
            name: "Graf Zeppelin",
            country: "germany"
        },
        "119": {
            name: "Portland",
            country: "usa"
        },
        "120": {
            name: "Lion I",
            country: "britain"
        },
        "121": {
            name: "YanGong",
            country: "china"
        },
        "122": {
            name: "Perla",
            country: "italy"
        },
        "123": {
            name: "Izumi",
            country: "japan"
        },
        "124": {
            name: "Redoutable",
            country: "france"
        },
        "125": {
            name: "Giulio Cesare (1940)",
            country: "italy"
        },
        "126": {
            name: "Arromanches",
            country: "france"
        },
        "127": {
            name: "Vittorio Veneto",
            country: "italy"
        },
        "128": {
            name: "RM_Andrea Doria",
            country: "italy"
        },
        "129": {
            name: "Xmas JingHaiHou",
            country: "china"
        },
        "130": {
            name: "Algerie",
            country: "france"
        },
        "131": {
            name: "Argo",
            country: "italy"
        },
        "132": {
            name: "KM_Andrea Doria",
            country: "germany"
        },
        "133": {
            name: "Hyuga",
            country: "japan"
        },
        "134": {
            name: "MinSheng",
            country: "china"
        },
        "135": {
            name: "Комсомолец",
            country: "ussr"
        },
        "136": {
            name: "Октябрьская революция",
            country: "ussr"
        },
        "137": {
            name: "Bogue",
            country: "usa"
        },
        "138": {
            name: "Alvensleben",
            country: "germany"
        },
        "139": {
            name: "Impero",
            country: "italy"
        },
        "140": {
            name: "Koenigsberg",
            country: "germany"
        },
        "141": {
            name: "Bolzano (1943)",
            country: "italy"
        },
        "142": {
            name: "Mississippi",
            country: "usa"
        },
        "143": {
            name: "Conqueror",
            country: "britain"
        },
        "144": {
            name: "Alaska",
            country: "usa"
        },
        "145": {
            name: "Tsukikei",
            country: "japan"
        },
        "146": {
            name: "Mikasa",
            country: "japan"
        },
        "147": {
            name: "Bolzano (1942)",
            country: "italy"
        },
        "148": {
            name: "Belfort",
            country: "france"
        },
        "149": {
            name: "Revenge",
            country: "britain"
        },
        "150": {
            name: "Queen Elizabeth",
            country: "britain"
        },
        "151": {
            name: "Oyodo",
            country: "japan"
        },
        "152": {
            name: "Colossus",
            country: "britain"
        },
        "153": {
            name: "L Class",
            country: "britain"
        },
        "154": {
            name: "Советская Россия",
            country: "ussr"
        },
        "155": {
            name: "Ashitaka",
            country: "japan"
        },
        "156": {
            name: "Scharnhorst",
            country: "germany"
        },
        "157": {
            name: "Akitsuki",
            country: "japan"
        },
        "158": {
            name: "Dixmude",
            country: "france"
        },
        "159": {
            name: "Ammiraglio Cagni",
            country: "italy"
        },
        "160": {
            name: "Bearn",
            country: "france"
        },
        "161": {
            name: "Koenig Albert",
            country: "germany"
        },
        "162": {
            name: "Hindenburg",
            country: "germany"
        },
        "163": {
            name: "Fubuki",
            country: "japan"
        },
        "164": {
            name: "M Project",
            country: "germany"
        },
        "165": {
            name: "Alsace",
            country: "france"
        },
        "166": {
            name: "ZhongXiang",
            country: "china"
        },
        "167": {
            name: "Deutschland",
            country: "germany"
        },
        "168": {
            name: "Duke of Cornwall",
            country: "britain"
        },
        "169": {
            name: "Архангельск",
            country: "ussr"
        },
        "170": {
            name: "Проект 73",
            country: "ussr"
        },
        "171": {
            name: "Советский союз",
            country: "ussr"
        },
        "172": {
            name: "Kuma-Kai",
            country: "japan"
        },
        "173": {
            name: "Gascogne (1941)",
            country: "france"
        },
        "174": {
            name: "MinQuan",
            country: "china"
        },
        "175": {
            name: "H41 Project",
            country: "germany"
        },
        "176": {
            name: "Gearing",
            country: "usa"
        },
        "177": {
            name: "Mandel",
            country: "france"
        },
        "178": {
            name: "Vanguard",
            country: "britain"
        },
        "179": {
            name: "Bismarck (1945)",
            country: "germany"
        },
        "180": {
            name: "Гангут",
            country: "ussr"
        },
        "181": {
            name: "P Type",
            country: "britain"
        },
        "182": {
            name: "O Class",
            country: "britain"
        },
        "183": {
            name: "Gearing DDR",
            country: "usa"
        },
        "184": {
            name: "Tosa",
            country: "japan"
        },
        "185": {
            name: "Ammiraglio di Saint bon",
            country: "italy"
        },
        "186": {
            name: "Брянск",
            country: "ussr"
        },
        "187": {
            name: "Atlanta",
            country: "usa"
        },
        "188": {
            name: "Pennsylvania (1943)",
            country: "usa"
        },
        "189": {
            name: "Сталинград",
            country: "ussr"
        },
        "190": {
            name: "USN Sevastopol",
            country: "usa"
        },
        "191": {
            name: "MaAnShan",
            country: "china"
        },
        "192": {
            name: "Resolution",
            country: "britain"
        },
        "193": {
            name: "Trento",
            country: "italy"
        },
        "194": {
            name: "Shinano",
            country: "japan"
        },
        "195": {
            name: "Ise (1937)",
            country: "japan"
        },
        "196": {
            name: "Bismarck (1943)",
            country: "germany"
        },
        "197": {
            name: "La Fayett",
            country: "france"
        },
        "198": {
            name: "Barracuda",
            country: "usa"
        },
        "199": {
            name: "Akagi (1938)",
            country: "japan"
        },
        "200": {
            name: "Lexington",
            country: "usa"
        },
        "201": {
            name: "Indiana",
            country: "usa"
        },
        "202": {
            name: "North Carolina",
            country: "usa"
        },
        "203": {
            name: "I 400",
            country: "japan"
        },
        "204": {
            name: "Проект 71",
            country: "ussr"
        },
        "205": {
            name: "Nagato",
            country: "japan"
        },
        "206": {
            name: "Полтава",
            country: "ussr"
        },
        "207": {
            name: "Dante Alighieri (1914)",
            country: "italy"
        },
        "208": {
            name: "Admiral Hipper",
            country: "germany"
        },
        "209": {
            name: "Dido",
            country: "britain"
        },
        "210": {
            name: "Z1 Class",
            country: "germany"
        },
        "211": {
            name: "Pennsylvania (1930)",
            country: "usa"
        },
        "212": {
            name: "Mutsu",
            country: "japan"
        },
        "213": {
            name: "YongSui",
            country: "china"
        },
        "214": {
            name: "Mikawa",
            country: "japan"
        },
        "215": {
            name: "HaiGou",
            country: "china"
        },
        "216": {
            name: "Kirishima",
            country: "japan"
        },
        "217": {
            name: "Simakaze",
            country: "japan"
        },
        "218": {
            name: "Mogami (1938)",
            country: "japan"
        },
        "219": {
            name: "Oriani",
            country: "italy"
        },
        "220": {
            name: "Caio Duilio (1915)",
            country: "italy"
        },
        "221": {
            name: "J39 Class",
            country: "germany"
        },
        "222": {
            name: "ChongQing",
            country: "china"
        },
        "223": {
            name: "Ise (1943)",
            country: "japan"
        },
        "224": {
            name: "Mogami (1941)",
            country: "japan"
        },
        "225": {
            name: "Franklin D. Roosevelt",
            country: "usa"
        },
        "226": {
            name: "Oakland",
            country: "usa"
        },
        "227": {
            name: "Kaga (1928)",
            country: "japan"
        },
        "228": {
            name: "Mogador",
            country: "france"
        },
        "229": {
            name: "Mogami (1944)",
            country: "japan"
        },
        "230": {
            name: "Caracciolo",
            country: "italy"
        },
        "231": {
            name: "Измаил (1916)",
            country: "ussr"
        },
        "232": {
            name: "Rota",
            country: "italy"
        },
        "233": {
            name: "Juneau II",
            country: "usa"
        },
        "234": {
            name: "Indefatigable",
            country: "britain"
        },
        "235": {
            name: "Type - VIIA",
            country: "germany"
        },
        "236": {
            name: "South Dakota",
            country: "usa"
        },
        "237": {
            name: "New Mexico (1945)",
            country: "usa"
        },
        "238": {
            name: "Garibaldi",
            country: "italy"
        },
        "239": {
            name: "Castagnito",
            country: "italy"
        },
        "240": {
            name: "John Rabe",
            country: "china"
        },
        "241": {
            name: "Missouri",
            country: "usa"
        },
        "242": {
            name: "Capitani Romani",
            country: "italy"
        },
        "243": {
            name: "Provence",
            country: "france"
        },
        "244": {
            name: "Atlantis",
            country: "germany"
        },
        "245": {
            name: "Bearn (1944)",
            country: "france"
        },
        "246": {
            name: "Warrior",
            country: "britain"
        },
        "247": {
            name: "Liberte",
            country: "france"
        },
        "248": {
            name: "Richelieu",
            country: "france"
        },
        "249": {
            name: "Андрей Первозванный",
            country: "ussr"
        },
        "250": {
            name: "Z31 Class",
            country: "germany"
        },
        "251": {
            name: "Izumo",
            country: "japan"
        },
        "252": {
            name: "Boxer",
            country: "usa"
        },
        "253": {
            name: "Сталинец",
            country: "ussr"
        },
        "254": {
            name: "Bayern",
            country: "germany"
        },
        "255": {
            name: "Gaoxiong",
            country: "china"
        },
        "256": {
            name: "Regina Margherita",
            country: "italy"
        },
        "257": {
            name: "Illustrious",
            country: "britain"
        },
        "258": {
            name: "Kagero",
            country: "japan"
        },
        "259": {
            name: "Northampton",
            country: "usa"
        },
        "260": {
            name: "MN_Dunkerque",
            country: "france"
        },
        "261": {
            name: "Dunkerque",
            country: "britain"
        },
        "262": {
            name: "Z52 class",
            country: "germany"
        },
        "263": {
            name: "P Project",
            country: "germany"
        },
        "264": {
            name: "Type - XXI",
            country: "germany"
        },
        "265": {
            name: "Marcello",
            country: "italy"
        },
        "266": {
            name: "Duca degli Abruzzi",
            country: "italy"
        },
        "267": {
            name: "Проект 72",
            country: "ussr"
        },
        "268": {
            name: "Anson",
            country: "britain"
        },
        "269": {
            name: "De Grasse",
            country: "japan"
        },
        "270": {
            name: "MingZhao",
            country: "china"
        },
        "271": {
            name: "CN Minsk",
            country: "china"
        },
        "272": {
            name: "Navigatori",
            country: "italy"
        },
        "273": {
            name: "Prinz Eugen",
            country: "germany"
        },
        "274": {
            name: "Conte di Cavour (1915)",
            country: "italy"
        },
        "275": {
            name: "Тип ЛЦТ",
            country: "ussr"
        },
        "276": {
            name: "P Project II",
            country: "germany"
        },
        "277": {
            name: "Colorado",
            country: "usa"
        },
        "278": {
            name: "Giulio Cesare (1914)",
            country: "italy"
        },
        "279": {
            name: "Repulse",
            country: "britain"
        },
        "280": {
            name: "Bonfiglietti",
            country: "italy"
        },
        "281": {
            name: "Montecuccoli",
            country: "italy"
        },
        "282": {
            name: "Somers",
            country: "usa"
        },
        "283": {
            name: "Pensacola",
            country: "usa"
        },
        "284": {
            name: "Kaidai - VIA",
            country: "japan"
        },
        "285": {
            name: "CN Kiev",
            country: "china"
        },
        "286": {
            name: "Rodney XMS",
            country: "britain"
        },
        "287": {
            name: "Сталинград (1953)",
            country: "ussr"
        },
        "288": {
            name: "New Jersey",
            country: "usa"
        },
        "289": {
            name: "Костромитинов",
            country: "ussr"
        },
        "290": {
            name: "ShangZhi",
            country: "china"
        },
        "291": {
            name: "K39 Class",
            country: "germany"
        },
        "292": {
            name: "Щука",
            country: "ussr"
        },
        "293": {
            name: "La Galissonniere",
            country: "france"
        },
        "294": {
            name: "Brooklyn",
            country: "usa"
        },
        "295": {
            name: "Правда",
            country: "ussr"
        },
        "296": {
            name: "Joffre",
            country: "france"
        },
        "297": {
            name: "Danton",
            country: "france"
        },
        "298": {
            name: "Ленинград",
            country: "ussr"
        },
        "299": {
            name: "Izmi",
            country: "japan"
        },
        "300": {
            name: "O Project II (1942)",
            country: "germany"
        },
        "301": {
            name: "Yorktown",
            country: "usa"
        },
        "302": {
            name: "Измаил",
            country: "ussr"
        },
        "303": {
            name: "Рюрик",
            country: "ussr"
        },
        "304": {
            name: "Unryu",
            country: "japan"
        },
        "305": {
            name: "Hosho",
            country: "japan"
        },
        "306": {
            name: "Italia",
            country: "italy"
        },
        "307": {
            name: "Lyon",
            country: "france"
        },
        "308": {
            name: "Queen Mother",
            country: "britain"
        },
        "309": {
            name: "New Orleans",
            country: "usa"
        },
        "310": {
            name: "Москва",
            country: "ussr"
        },
        "311": {
            name: "L Adroit",
            country: "france"
        },
        "312": {
            name: "Queen Victoria",
            country: "britain"
        },
        "313": {
            name: "StrasBourg (1938)",
            country: "france"
        },
        "314": {
            name: "Pitt",
            country: "britain"
        },
        "315": {
            name: "Красная площадь",
            country: "ussr"
        },
        "316": {
            name: "Vanguard (1946)",
            country: "britain"
        },
        "317": {
            name: "Maryland",
            country: "usa"
        },
        "318": {
            name: "Requin",
            country: "france"
        },
        "319": {
            name: "Furious",
            country: "britain"
        },
        "320": {
            name: "Крейсерская",
            country: "ussr"
        },
        "321": {
            name: "Conte di Cavour (1940)",
            country: "italy"
        },
        "322": {
            name: "Ticonderoga",
            country: "usa"
        },
        "323": {
            name: "Regina Elena",
            country: "italy"
        },
        "324": {
            name: "Omaha",
            country: "usa"
        },
        "325": {
            name: "Egalite",
            country: "france"
        },
        "326": {
            name: "Valiant",
            country: "britain"
        },
        "327": {
            name: "Lion II",
            country: "britain"
        },
        "328": {
            name: "HaiLong",
            country: "china"
        },
        "329": {
            name: "Progetto Gagnotto",
            country: "italy"
        },
        "330": {
            name: "Duca d Aosta",
            country: "italy"
        },
        "331": {
            name: "Sparviero (1943)",
            country: "italy"
        },
        "332": {
            name: "Nebraska",
            country: "usa"
        },
        "333": {
            name: "Gascogne",
            country: "france"
        },
        "334": {
            name: "ChengGong",
            country: "china"
        },
        "335": {
            name: "Shokaku",
            country: "japan"
        },
        "336": {
            name: "Renown",
            country: "britain"
        },
        "337": {
            name: "Atago",
            country: "japan"
        },
        "338": {
            name: "HaiXiang",
            country: "china"
        },
        "339": {
            name: "Midway",
            country: "britain"
        },
        "340": {
            name: "California",
            country: "usa"
        },
        "341": {
            name: "Scheidemann",
            country: "germany"
        },
        "342": {
            name: "Timmerman",
            country: "usa"
        },
        "343": {
            name: "Spearhead",
            country: "britain"
        },
        "344": {
            name: "Montana",
            country: "usa"
        },
        "345": {
            name: "Super Yamato",
            country: "japan"
        },
        "346": {
            name: "PingHai",
            country: "china"
        },
        "347": {
            name: "Nassau",
            country: "germany"
        },
        "348": {
            name: "Zuikaku",
            country: "japan"
        },
        "349": {
            name: "County",
            country: "britain"
        },
        "350": {
            name: "Clemenceau",
            country: "france"
        },
        "351": {
            name: "O Type",
            country: "usa"
        },
        "352": {
            name: "Katsuragi",
            country: "japan"
        },
        "353": {
            name: "Victorious",
            country: "britain"
        },
        "354": {
            name: "Bragadin",
            country: "italy"
        },
        "355": {
            name: "Jaguar",
            country: "france"
        },
        "356": {
            name: "Versailles",
            country: "france"
        },
        "357": {
            name: "Dhonburi",
            country: "japan"
        },
        "358": {
            name: "Петропавловск",
            country: "ussr"
        },
        "359": {
            name: "Charlemagne",
            country: "france"
        },
        "360": {
            name: "Pluton",
            country: "france"
        },
        "361": {
            name: "033-Type",
            country: "china"
        },
        "362": {
            name: "Saratoga",
            country: "usa"
        },
        "363": {
            name: "New York",
            country: "usa"
        },
        "364": {
            name: "Temeraire",
            country: "britain"
        },
        "365": {
            name: "San Giorgio",
            country: "italy"
        },
        "366": {
            name: "Bismarck",
            country: "germany"
        },
        "367": {
            name: "Type - IX D2",
            country: "germany"
        },
        "368": {
            name: "Oberon",
            country: "britain"
        },
        "369": {
            name: "Hiryu",
            country: "japan"
        },
        "370": {
            name: "Aberdeen",
            country: "britain"
        },
        "371": {
            name: "Caracciolo (1919)",
            country: "italy"
        },
        "372": {
            name: "ShiLang",
            country: "china"
        },
        "373": {
            name: "Jeanne D Arc",
            country: "france"
        },
        "374": {
            name: "Suffren",
            country: "france"
        },
        "375": {
            name: "Brin",
            country: "italy"
        },
        "376": {
            name: "Vickers L3",
            country: "japan"
        },
        "377": {
            name: "Nelson",
            country: "britain"
        },
        "378": {
            name: "Leone",
            country: "italy"
        },
        "379": {
            name: "A Type",
            country: "britain"
        },
        "380": {
            name: "Кузнецов",
            country: "ussr"
        },
        "381": {
            name: "Illinois",
            country: "usa"
        },
        "382": {
            name: "Lorraine",
            country: "france"
        },
        "383": {
            name: "J44 Class",
            country: "germany"
        },
        "384": {
            name: "Joffre (1943)",
            country: "france"
        },
        "385": {
            name: "Yamato",
            country: "japan"
        },
        "386": {
            name: "HaiLang",
            country: "china"
        },
        "387": {
            name: "Georgia",
            country: "usa"
        },
        "388": {
            name: "Leonardo da Vinci",
            country: "italy"
        },
        "389": {
            name: "Taiho",
            country: "japan"
        },
        "390": {
            name: "Gneisenau (1943)",
            country: "germany"
        },
        "391": {
            name: "O Project",
            country: "germany"
        },
        "392": {
            name: "Roma",
            country: "italy"
        },
        "393": {
            name: "Проект 69АВ",
            country: "ussr"
        },
        "394": {
            name: "Царь",
            country: "ussr"
        },
        "395": {
            name: "DingYuan",
            country: "china"
        },
        "396": {
            name: "Clausewitz",
            country: "germany"
        },
        "397": {
            name: "Attacker",
            country: "britain"
        },
        "398": {
            name: "Thermidor",
            country: "france"
        },
        "399": {
            name: "West Virginia",
            country: "usa"
        },
        "400": {
            name: "Максим Горький",
            country: "ussr"
        },
        "401": {
            name: "Пролетариат",
            country: "ussr"
        },
        "402": {
            name: "Tatsuda",
            country: "japan"
        },
        "403": {
            name: "Oklahoma",
            country: "usa"
        },
        "404": {
            name: "Junsen Type - I",
            country: "japan"
        },
        "405": {
            name: "Surrey",
            country: "britain"
        },
        "406": {
            name: "Tennessee (1941)",
            country: "usa"
        },
        "407": {
            name: "Storione",
            country: "italy"
        },
        "408": {
            name: "Jean Bart",
            country: "france"
        },
        "409": {
            name: "Turbine",
            country: "italy"
        },
        "410": {
            name: "Светлана",
            country: "ussr"
        },
        "411": {
            name: "Eurasien",
            country: "germany"
        },
        "412": {
            name: "LiaoNing",
            country: "china"
        },
        "413": {
            name: "Gawachi",
            country: "japan"
        },
        "414": {
            name: "Ryujo",
            country: "japan"
        },
        "415": {
            name: "Admiral Scheer",
            country: "germany"
        },
        "416": {
            name: "Bourgogne",
            country: "france"
        },
        "417": {
            name: "Yuanpei",
            country: "china"
        },
        "418": {
            name: "Type - VIIC",
            country: "germany"
        },
        "419": {
            name: "Independence",
            country: "usa"
        },
        "420": {
            name: "Кронштадт (1940)",
            country: "ussr"
        },
        "421": {
            name: "Reynaud",
            country: "france"
        },
        "422": {
            name: "Stresemann",
            country: "germany"
        },
        "423": {
            name: "Paris",
            country: "france"
        },
        "424": {
            name: "Киров",
            country: "ussr"
        },
        "425": {
            name: "H39 Class",
            country: "germany"
        },
        "426": {
            name: "StrasBourg",
            country: "france"
        },
        "427": {
            name: "Варяг",
            country: "ussr"
        },
        "428": {
            name: "New Mexico (1930)",
            country: "usa"
        },
        "429": {
            name: "Moltke",
            country: "germany"
        },
        "430": {
            name: "Seydlitz",
            country: "germany"
        },
        "431": {
            name: "Sparviero",
            country: "italy"
        },
        "432": {
            name: "Cleveland",
            country: "usa"
        },
        "433": {
            name: "Richthofen",
            country: "germany"
        },
        "434": {
            name: "Normandie",
            country: "france"
        },
        "435": {
            name: "Haruna",
            country: "japan"
        },
        "436": {
            name: "Re Umberto",
            country: "italy"
        },
        "437": {
            name: "Ташкент",
            country: "ussr"
        },
        "438": {
            name: "Cachalot",
            country: "usa"
        },
        "439": {
            name: "Edinburgh",
            country: "britain"
        },
        "440": {
            name: "Сторожевой",
            country: "ussr"
        },
        "441": {
            name: "Tennessee (1945)",
            country: "usa"
        },
        "442": {
            name: "Fuso",
            country: "japan"
        },
        "443": {
            name: "H Type",
            country: "britain"
        },
        "444": {
            name: "Washington",
            country: "usa"
        },
        "445": {
            name: "Myoko",
            country: "japan"
        },
        "446": {
            name: "De Grasse",
            country: "germany"
        },
        "447": {
            name: "Богатырь",
            country: "ussr"
        },
        "448": {
            name: "Di Giussano",
            country: "italy"
        },
        "449": {
            name: "Чапаев",
            country: "ussr"
        },
        "450": {
            name: "Richelieu (1951)",
            country: "france"
        },
        "451": {
            name: "B65 Project",
            country: "japan"
        },
        "452": {
            name: "Daladier",
            country: "france"
        },
        "453": {
            name: "Enterprise",
            country: "usa"
        },
        "454": {
            name: "Декабрист",
            country: "ussr"
        },
        "455": {
            name: "Musashi",
            country: "japan"
        },
        "456": {
            name: "YiXian",
            country: "china"
        },
        "457": {
            name: "R Type",
            country: "britain"
        },
        "458": {
            name: "Progetto UP41",
            country: "italy"
        },
        "459": {
            name: "Yamato (1945)",
            country: "japan"
        }
    }
};

window["card_max_level"] = 200;

window["cards_upgrade"] = {
    "1": [ {
        w0: 5,
        w1: 8,
        w2: 9,
        w3: 7,
        w4: 9,
        w5: 14,
        w6: 24,
        w7: 31,
        w8: 62,
        w9: 113,
        cards: 1,
        coins: 0
    }, {
        w0: 8,
        w1: 15,
        w2: 17,
        w3: 15,
        w4: 18,
        w5: 32,
        w6: 39,
        w7: 65,
        w8: 117,
        w9: 236,
        cards: 10,
        coins: 300
    }, {
        w0: 11,
        w1: 23,
        w2: 27,
        w3: 23,
        w4: 25,
        w5: 47,
        w6: 58,
        w7: 96,
        w8: 181,
        w9: 364,
        cards: 15,
        coins: 315
    }, {
        w0: 14,
        w1: 30,
        w2: 37,
        w3: 28,
        w4: 32,
        w5: 62,
        w6: 83,
        w7: 128,
        w8: 241,
        w9: 484,
        cards: 21,
        coins: 335
    }, {
        w0: 19,
        w1: 36,
        w2: 45,
        w3: 35,
        w4: 39,
        w5: 78,
        w6: 103,
        w7: 158,
        w8: 301,
        w9: 606,
        cards: 28,
        coins: 360
    }, {
        w0: 23,
        w1: 44,
        w2: 54,
        w3: 42,
        w4: 46,
        w5: 95,
        w6: 122,
        w7: 190,
        w8: 365,
        w9: 722,
        cards: 36,
        coins: 390
    }, {
        w0: 28,
        w1: 50,
        w2: 62,
        w3: 49,
        w4: 53,
        w5: 113,
        w6: 143,
        w7: 224,
        w8: 428,
        w9: 849,
        cards: 45,
        coins: 425
    }, {
        w0: 31,
        w1: 57,
        w2: 71,
        w3: 55,
        w4: 60,
        w5: 130,
        w6: 165,
        w7: 256,
        w8: 483,
        w9: 968,
        cards: 55,
        coins: 465
    }, {
        w0: 36,
        w1: 64,
        w2: 81,
        w3: 60,
        w4: 68,
        w5: 143,
        w6: 183,
        w7: 290,
        w8: 540,
        w9: 1083,
        cards: 66,
        coins: 510
    }, {
        w0: 39,
        w1: 70,
        w2: 90,
        w3: 68,
        w4: 76,
        w5: 154,
        w6: 207,
        w7: 323,
        w8: 604,
        w9: 1193,
        cards: 78,
        coins: 560
    }, {
        w0: 42,
        w1: 77,
        w2: 100,
        w3: 76,
        w4: 85,
        w5: 169,
        w6: 224,
        w7: 351,
        w8: 662,
        w9: 1303,
        cards: 91,
        coins: 615
    }, {
        w0: 47,
        w1: 84,
        w2: 110,
        w3: 82,
        w4: 93,
        w5: 184,
        w6: 241,
        w7: 382,
        w8: 717,
        w9: 1425,
        cards: 105,
        coins: 675
    }, {
        w0: 50,
        w1: 90,
        w2: 118,
        w3: 87,
        w4: 100,
        w5: 200,
        w6: 256,
        w7: 416,
        w8: 780,
        w9: 1535,
        cards: 120,
        coins: 740
    }, {
        w0: 55,
        w1: 97,
        w2: 126,
        w3: 95,
        w4: 109,
        w5: 217,
        w6: 281,
        w7: 450,
        w8: 835,
        w9: 1654,
        cards: 136,
        coins: 810
    }, {
        w0: 59,
        w1: 105,
        w2: 135,
        w3: 103,
        w4: 118,
        w5: 230,
        w6: 303,
        w7: 483,
        w8: 890,
        w9: 1769,
        cards: 153,
        coins: 885
    }, {
        w0: 63,
        w1: 112,
        w2: 145,
        w3: 110,
        w4: 125,
        w5: 247,
        w6: 328,
        w7: 510,
        w8: 952,
        w9: 1893,
        cards: 171,
        coins: 965
    }, {
        w0: 66,
        w1: 119,
        w2: 153,
        w3: 115,
        w4: 134,
        w5: 264,
        w6: 346,
        w7: 544,
        w8: 1009,
        w9: 2021,
        cards: 190,
        coins: 1050
    }, {
        w0: 71,
        w1: 125,
        w2: 161,
        w3: 121,
        w4: 143,
        w5: 277,
        w6: 368,
        w7: 578,
        w8: 1071,
        w9: 2140,
        cards: 210,
        coins: 1140
    }, {
        w0: 75,
        w1: 133,
        w2: 171,
        w3: 128,
        w4: 151,
        w5: 289,
        w6: 388,
        w7: 608,
        w8: 1135,
        w9: 2270,
        cards: 231,
        coins: 1235
    }, {
        w0: 80,
        w1: 139,
        w2: 179,
        w3: 133,
        w4: 158,
        w5: 305,
        w6: 409,
        w7: 641,
        w8: 1198,
        w9: 2396,
        cards: 253,
        coins: 1335
    }, {
        w0: 83,
        w1: 145,
        w2: 187,
        w3: 138,
        w4: 167,
        w5: 323,
        w6: 434,
        w7: 674,
        w8: 1253,
        w9: 2512,
        cards: 276,
        coins: 1440
    }, {
        w0: 86,
        w1: 152,
        w2: 196,
        w3: 144,
        w4: 175,
        w5: 337,
        w6: 452,
        w7: 701,
        w8: 1317,
        w9: 2639,
        cards: 300,
        coins: 1550
    }, {
        w0: 91,
        w1: 160,
        w2: 206,
        w3: 149,
        w4: 183,
        w5: 353,
        w6: 467,
        w7: 732,
        w8: 1377,
        w9: 2757,
        cards: 325,
        coins: 1665
    }, {
        w0: 96,
        w1: 166,
        w2: 215,
        w3: 157,
        w4: 191,
        w5: 370,
        w6: 488,
        w7: 763,
        w8: 1442,
        w9: 2873,
        cards: 351,
        coins: 1785
    }, {
        w0: 99,
        w1: 173,
        w2: 223,
        w3: 163,
        w4: 198,
        w5: 382,
        w6: 510,
        w7: 797,
        w8: 1503,
        w9: 3002,
        cards: 378,
        coins: 1910
    }, {
        w0: 103,
        w1: 180,
        w2: 232,
        w3: 171,
        w4: 207,
        w5: 398,
        w6: 535,
        w7: 828,
        w8: 1562,
        w9: 3120,
        cards: 406,
        coins: 2040
    }, {
        w0: 106,
        w1: 188,
        w2: 241,
        w3: 177,
        w4: 216,
        w5: 408,
        w6: 554,
        w7: 856,
        w8: 1620,
        w9: 3241,
        cards: 435,
        coins: 2175
    }, {
        w0: 110,
        w1: 195,
        w2: 251,
        w3: 182,
        w4: 224,
        w5: 419,
        w6: 575,
        w7: 886,
        w8: 1680,
        w9: 3351,
        cards: 465,
        coins: 2315
    }, {
        w0: 114,
        w1: 203,
        w2: 261,
        w3: 187,
        w4: 233,
        w5: 432,
        w6: 593,
        w7: 914,
        w8: 1743,
        w9: 3477,
        cards: 496,
        coins: 2460
    }, {
        w0: 118,
        w1: 209,
        w2: 270,
        w3: 195,
        w4: 240,
        w5: 445,
        w6: 616,
        w7: 942,
        w8: 1804,
        w9: 3593,
        cards: 528,
        coins: 2610
    }, {
        w0: 121,
        w1: 216,
        w2: 280,
        w3: 202,
        w4: 249,
        w5: 456,
        w6: 632,
        w7: 974,
        w8: 1860,
        w9: 3723,
        cards: 561,
        coins: 2765
    }, {
        w0: 124,
        w1: 223,
        w2: 288,
        w3: 207,
        w4: 258,
        w5: 471,
        w6: 654,
        w7: 1003,
        w8: 1918,
        w9: 3843,
        cards: 595,
        coins: 2925
    }, {
        w0: 129,
        w1: 231,
        w2: 298,
        w3: 213,
        w4: 267,
        w5: 488,
        w6: 670,
        w7: 1033,
        w8: 1982,
        w9: 3956,
        cards: 630,
        coins: 3090
    }, {
        w0: 134,
        w1: 237,
        w2: 306,
        w3: 218,
        w4: 274,
        w5: 503,
        w6: 693,
        w7: 1060,
        w8: 2043,
        w9: 4084,
        cards: 666,
        coins: 3260
    }, {
        w0: 137,
        w1: 245,
        w2: 316,
        w3: 224,
        w4: 282,
        w5: 515,
        w6: 713,
        w7: 1093,
        w8: 2099,
        w9: 4196,
        cards: 703,
        coins: 3435
    }, {
        w0: 142,
        w1: 253,
        w2: 324,
        w3: 230,
        w4: 291,
        w5: 529,
        w6: 734,
        w7: 1120,
        w8: 2163,
        w9: 4306,
        cards: 741,
        coins: 3615
    }, {
        w0: 147,
        w1: 260,
        w2: 333,
        w3: 236,
        w4: 299,
        w5: 539,
        w6: 758,
        w7: 1149,
        w8: 2218,
        w9: 4420,
        cards: 780,
        coins: 3800
    }, {
        w0: 152,
        w1: 268,
        w2: 341,
        w3: 242,
        w4: 308,
        w5: 551,
        w6: 773,
        w7: 1181,
        w8: 2281,
        w9: 4538,
        cards: 820,
        coins: 3990
    }, {
        w0: 155,
        w1: 274,
        w2: 351,
        w3: 250,
        w4: 317,
        w5: 564,
        w6: 797,
        w7: 1210,
        w8: 2341,
        w9: 4662,
        cards: 861,
        coins: 4185
    }, {
        w0: 159,
        w1: 282,
        w2: 361,
        w3: 256,
        w4: 326,
        w5: 574,
        w6: 816,
        w7: 1237,
        w8: 2396,
        w9: 4787,
        cards: 903,
        coins: 4385
    }, {
        w0: 163,
        w1: 289,
        w2: 370,
        w3: 261,
        w4: 335,
        w5: 584,
        w6: 834,
        w7: 1271,
        w8: 2455,
        w9: 4912,
        cards: 946,
        coins: 4590
    }, {
        w0: 168,
        w1: 296,
        w2: 379,
        w3: 266,
        w4: 342,
        w5: 601,
        w6: 855,
        w7: 1302,
        w8: 2511,
        w9: 5032,
        cards: 990,
        coins: 4800
    }, {
        w0: 172,
        w1: 304,
        w2: 388,
        w3: 274,
        w4: 351,
        w5: 619,
        w6: 876,
        w7: 1329,
        w8: 2573,
        w9: 5142,
        cards: 1035,
        coins: 5015
    }, {
        w0: 177,
        w1: 311,
        w2: 398,
        w3: 279,
        w4: 359,
        w5: 634,
        w6: 899,
        w7: 1360,
        w8: 2635,
        w9: 5262,
        cards: 1081,
        coins: 5235
    }, {
        w0: 182,
        w1: 318,
        w2: 406,
        w3: 286,
        w4: 368,
        w5: 647,
        w6: 921,
        w7: 1388,
        w8: 2690,
        w9: 5385,
        cards: 1128,
        coins: 5460
    }, {
        w0: 187,
        w1: 324,
        w2: 416,
        w3: 294,
        w4: 375,
        w5: 665,
        w6: 942,
        w7: 1415,
        w8: 2748,
        w9: 5513,
        cards: 1176,
        coins: 5690
    }, {
        w0: 191,
        w1: 330,
        w2: 426,
        w3: 301,
        w4: 383,
        w5: 678,
        w6: 958,
        w7: 1445,
        w8: 2805,
        w9: 5638,
        cards: 1225,
        coins: 5925
    }, {
        w0: 195,
        w1: 336,
        w2: 435,
        w3: 309,
        w4: 392,
        w5: 690,
        w6: 975,
        w7: 1479,
        w8: 2864,
        w9: 5767,
        cards: 1275,
        coins: 6165
    }, {
        w0: 199,
        w1: 344,
        w2: 444,
        w3: 316,
        w4: 399,
        w5: 707,
        w6: 990,
        w7: 1511,
        w8: 2925,
        w9: 5878,
        cards: 1326,
        coins: 6410
    }, {
        w0: 203,
        w1: 351,
        w2: 453,
        w3: 321,
        w4: 408,
        w5: 720,
        w6: 1012,
        w7: 1540,
        w8: 2989,
        w9: 6003,
        cards: 1378,
        coins: 6660
    }, {
        w0: 206,
        w1: 359,
        w2: 463,
        w3: 327,
        w4: 415,
        w5: 737,
        w6: 1027,
        w7: 1572,
        w8: 3050,
        w9: 6129,
        cards: 1431,
        coins: 6915
    }, {
        w0: 209,
        w1: 365,
        w2: 472,
        w3: 333,
        w4: 423,
        w5: 750,
        w6: 1042,
        w7: 1600,
        w8: 3106,
        w9: 6250,
        cards: 1485,
        coins: 7175
    }, {
        w0: 212,
        w1: 371,
        w2: 481,
        w3: 339,
        w4: 431,
        w5: 761,
        w6: 1067,
        w7: 1634,
        w8: 3169,
        w9: 6362,
        cards: 1540,
        coins: 7440
    }, {
        w0: 217,
        w1: 377,
        w2: 490,
        w3: 344,
        w4: 438,
        w5: 777,
        w6: 1091,
        w7: 1665,
        w8: 3231,
        w9: 6480,
        cards: 1596,
        coins: 7710
    }, {
        w0: 220,
        w1: 383,
        w2: 500,
        w3: 352,
        w4: 445,
        w5: 794,
        w6: 1115,
        w7: 1695,
        w8: 3291,
        w9: 6591,
        cards: 1653,
        coins: 7985
    }, {
        w0: 224,
        w1: 391,
        w2: 510,
        w3: 359,
        w4: 454,
        w5: 812,
        w6: 1136,
        w7: 1722,
        w8: 3349,
        w9: 6702,
        cards: 1711,
        coins: 8265
    }, {
        w0: 227,
        w1: 398,
        w2: 519,
        w3: 367,
        w4: 462,
        w5: 824,
        w6: 1156,
        w7: 1749,
        w8: 3410,
        w9: 6818,
        cards: 1770,
        coins: 8550
    }, {
        w0: 230,
        w1: 405,
        w2: 528,
        w3: 373,
        w4: 469,
        w5: 842,
        w6: 1172,
        w7: 1783,
        w8: 3469,
        w9: 6938,
        cards: 1830,
        coins: 8840
    }, {
        w0: 233,
        w1: 413,
        w2: 537,
        w3: 378,
        w4: 477,
        w5: 860,
        w6: 1192,
        w7: 1815,
        w8: 3527,
        w9: 7061,
        cards: 1891,
        coins: 9135
    }, {
        w0: 238,
        w1: 419,
        w2: 545,
        w3: 385,
        w4: 485,
        w5: 871,
        w6: 1213,
        w7: 1849,
        w8: 3586,
        w9: 7179,
        cards: 1953,
        coins: 9435
    }, {
        w0: 243,
        w1: 425,
        w2: 555,
        w3: 391,
        w4: 492,
        w5: 883,
        w6: 1234,
        w7: 1878,
        w8: 3644,
        w9: 7299,
        cards: 2016,
        coins: 9740
    }, {
        w0: 246,
        w1: 431,
        w2: 563,
        w3: 397,
        w4: 499,
        w5: 899,
        w6: 1252,
        w7: 1910,
        w8: 3699,
        w9: 7418,
        cards: 2080,
        coins: 10050
    }, {
        w0: 251,
        w1: 438,
        w2: 572,
        w3: 402,
        w4: 506,
        w5: 915,
        w6: 1272,
        w7: 1939,
        w8: 3756,
        w9: 7528,
        cards: 2145,
        coins: 10365
    }, {
        w0: 255,
        w1: 444,
        w2: 580,
        w3: 408,
        w4: 514,
        w5: 925,
        w6: 1287,
        w7: 1973,
        w8: 3818,
        w9: 7646,
        cards: 2211,
        coins: 10685
    }, {
        w0: 258,
        w1: 450,
        w2: 588,
        w3: 414,
        w4: 523,
        w5: 937,
        w6: 1312,
        w7: 2002,
        w8: 3883,
        w9: 7773,
        cards: 2278,
        coins: 11010
    }, {
        w0: 262,
        w1: 458,
        w2: 596,
        w3: 419,
        w4: 530,
        w5: 954,
        w6: 1336,
        w7: 2033,
        w8: 3946,
        w9: 7896,
        cards: 2346,
        coins: 11340
    }, {
        w0: 265,
        w1: 464,
        w2: 604,
        w3: 427,
        w4: 537,
        w5: 968,
        w6: 1355,
        w7: 2065,
        w8: 4005,
        w9: 8023,
        cards: 2415,
        coins: 11675
    }, {
        w0: 270,
        w1: 470,
        w2: 614,
        w3: 435,
        w4: 545,
        w5: 984,
        w6: 1378,
        w7: 2095,
        w8: 4069,
        w9: 8150,
        cards: 2485,
        coins: 12015
    }, {
        w0: 274,
        w1: 477,
        w2: 624,
        w3: 441,
        w4: 554,
        w5: 996,
        w6: 1393,
        w7: 2122,
        w8: 4133,
        w9: 8265,
        cards: 2556,
        coins: 12360
    }, {
        w0: 279,
        w1: 484,
        w2: 633,
        w3: 449,
        w4: 562,
        w5: 1013,
        w6: 1408,
        w7: 2154,
        w8: 4193,
        w9: 8378,
        cards: 2628,
        coins: 12710
    }, {
        w0: 282,
        w1: 490,
        w2: 643,
        w3: 454,
        w4: 570,
        w5: 1028,
        w6: 1427,
        w7: 2185,
        w8: 4256,
        w9: 8495,
        cards: 2701,
        coins: 13065
    }, {
        w0: 286,
        w1: 498,
        w2: 653,
        w3: 459,
        w4: 579,
        w5: 1043,
        w6: 1443,
        w7: 2218,
        w8: 4320,
        w9: 8605,
        cards: 2775,
        coins: 13425
    }, {
        w0: 291,
        w1: 504,
        w2: 662,
        w3: 464,
        w4: 586,
        w5: 1055,
        w6: 1464,
        w7: 2248,
        w8: 4381,
        w9: 8721,
        cards: 2850,
        coins: 13790
    }, {
        w0: 295,
        w1: 510,
        w2: 671,
        w3: 470,
        w4: 594,
        w5: 1072,
        w6: 1487,
        w7: 2280,
        w8: 4441,
        w9: 8836,
        cards: 2926,
        coins: 14160
    }, {
        w0: 300,
        w1: 517,
        w2: 681,
        w3: 476,
        w4: 603,
        w5: 1083,
        w6: 1503,
        w7: 2313,
        w8: 4504,
        w9: 8954,
        cards: 3003,
        coins: 14535
    }, {
        w0: 304,
        w1: 523,
        w2: 691,
        w3: 482,
        w4: 610,
        w5: 1095,
        w6: 1525,
        w7: 2347,
        w8: 4559,
        w9: 9067,
        cards: 3081,
        coins: 14915
    }, {
        w0: 308,
        w1: 531,
        w2: 701,
        w3: 487,
        w4: 619,
        w5: 1111,
        w6: 1541,
        w7: 2377,
        w8: 4623,
        w9: 9182,
        cards: 3160,
        coins: 15300
    }, {
        w0: 312,
        w1: 538,
        w2: 711,
        w3: 493,
        w4: 627,
        w5: 1129,
        w6: 1557,
        w7: 2411,
        w8: 4681,
        w9: 9295,
        cards: 3240,
        coins: 15690
    }, {
        w0: 316,
        w1: 544,
        w2: 719,
        w3: 500,
        w4: 635,
        w5: 1139,
        w6: 1572,
        w7: 2438,
        w8: 4742,
        w9: 9410,
        cards: 3321,
        coins: 16085
    }, {
        w0: 321,
        w1: 550,
        w2: 728,
        w3: 505,
        w4: 642,
        w5: 1156,
        w6: 1595,
        w7: 2469,
        w8: 4807,
        w9: 9522,
        cards: 3403,
        coins: 16485
    }, {
        w0: 326,
        w1: 556,
        w2: 738,
        w3: 512,
        w4: 649,
        w5: 1167,
        w6: 1614,
        w7: 2500,
        w8: 4868,
        w9: 9634,
        cards: 3486,
        coins: 16890
    }, {
        w0: 330,
        w1: 564,
        w2: 747,
        w3: 520,
        w4: 658,
        w5: 1180,
        w6: 1637,
        w7: 2533,
        w8: 4924,
        w9: 9760,
        cards: 3570,
        coins: 17300
    }, {
        w0: 334,
        w1: 570,
        w2: 755,
        w3: 526,
        w4: 666,
        w5: 1196,
        w6: 1652,
        w7: 2561,
        w8: 4983,
        w9: 9887,
        cards: 3655,
        coins: 17715
    }, {
        w0: 337,
        w1: 577,
        w2: 763,
        w3: 531,
        w4: 675,
        w5: 1208,
        w6: 1674,
        w7: 2588,
        w8: 5046,
        w9: 9999,
        cards: 3741,
        coins: 18135
    }, {
        w0: 340,
        w1: 584,
        w2: 772,
        w3: 536,
        w4: 684,
        w5: 1221,
        w6: 1699,
        w7: 2617,
        w8: 5103,
        w9: 10110,
        cards: 3828,
        coins: 18560
    }, {
        w0: 344,
        w1: 590,
        w2: 782,
        w3: 543,
        w4: 692,
        w5: 1237,
        w6: 1721,
        w7: 2648,
        w8: 5160,
        w9: 10240,
        cards: 3916,
        coins: 18990
    }, {
        w0: 347,
        w1: 596,
        w2: 792,
        w3: 551,
        w4: 700,
        w5: 1255,
        w6: 1739,
        w7: 2682,
        w8: 5219,
        w9: 10370,
        cards: 4005,
        coins: 19425
    }, {
        w0: 352,
        w1: 602,
        w2: 802,
        w3: 556,
        w4: 708,
        w5: 1272,
        w6: 1762,
        w7: 2711,
        w8: 5282,
        w9: 10480,
        cards: 4095,
        coins: 19865
    }, {
        w0: 357,
        w1: 610,
        w2: 811,
        w3: 563,
        w4: 717,
        w5: 1288,
        w6: 1782,
        w7: 2743,
        w8: 5337,
        w9: 10610,
        cards: 4186,
        coins: 20310
    }, {
        w0: 362,
        w1: 616,
        w2: 821,
        w3: 570,
        w4: 725,
        w5: 1303,
        w6: 1802,
        w7: 2775,
        w8: 5402,
        w9: 10720,
        cards: 4278,
        coins: 20760
    }, {
        w0: 367,
        w1: 624,
        w2: 830,
        w3: 575,
        w4: 732,
        w5: 1314,
        w6: 1826,
        w7: 2803,
        w8: 5460,
        w9: 10848,
        cards: 4371,
        coins: 21215
    }, {
        w0: 371,
        w1: 632,
        w2: 839,
        w3: 581,
        w4: 740,
        w5: 1327,
        w6: 1842,
        w7: 2835,
        w8: 5523,
        w9: 10977,
        cards: 4465,
        coins: 21675
    }, {
        w0: 374,
        w1: 638,
        w2: 847,
        w3: 589,
        w4: 748,
        w5: 1337,
        w6: 1858,
        w7: 2863,
        w8: 5582,
        w9: 11096,
        cards: 4560,
        coins: 22140
    }, {
        w0: 378,
        w1: 646,
        w2: 856,
        w3: 597,
        w4: 757,
        w5: 1347,
        w6: 1874,
        w7: 2890,
        w8: 5643,
        w9: 11222,
        cards: 4656,
        coins: 22610
    }, {
        w0: 382,
        w1: 653,
        w2: 864,
        w3: 604,
        w4: 765,
        w5: 1359,
        w6: 1896,
        w7: 2921,
        w8: 5705,
        w9: 11337,
        cards: 4753,
        coins: 23085
    }, {
        w0: 385,
        w1: 660,
        w2: 873,
        w3: 610,
        w4: 774,
        w5: 1370,
        w6: 1911,
        w7: 2948,
        w8: 5767,
        w9: 11447,
        cards: 4851,
        coins: 23565
    }, {
        w0: 390,
        w1: 668,
        w2: 883,
        w3: 617,
        w4: 781,
        w5: 1387,
        w6: 1929,
        w7: 2975,
        w8: 5828,
        w9: 11564,
        cards: 4950,
        coins: 24050
    }, {
        w0: 393,
        w1: 675,
        w2: 893,
        w3: 622,
        w4: 790,
        w5: 1405,
        w6: 1947,
        w7: 3007,
        w8: 5890,
        w9: 11694,
        cards: 5050,
        coins: 24540
    }, {
        w0: 396,
        w1: 682,
        w2: 902,
        w3: 629,
        w4: 798,
        w5: 1418,
        w6: 1968,
        w7: 3040,
        w8: 5946,
        w9: 11822,
        cards: 5151,
        coins: 25035
    }, {
        w0: 399,
        w1: 690,
        w2: 912,
        w3: 637,
        w4: 807,
        w5: 1436,
        w6: 1993,
        w7: 3069,
        w8: 6011,
        w9: 11939,
        cards: 5253,
        coins: 25535
    }, {
        w0: 404,
        w1: 698,
        w2: 921,
        w3: 642,
        w4: 814,
        w5: 1451,
        w6: 2013,
        w7: 3098,
        w8: 6073,
        w9: 12058,
        cards: 5356,
        coins: 26040
    }, {
        w0: 408,
        w1: 706,
        w2: 930,
        w3: 648,
        w4: 823,
        w5: 1463,
        w6: 2037,
        w7: 3128,
        w8: 6134,
        w9: 12176,
        cards: 5460,
        coins: 26550
    }, {
        w0: 411,
        w1: 714,
        w2: 938,
        w3: 656,
        w4: 830,
        w5: 1477,
        w6: 2059,
        w7: 3156,
        w8: 6190,
        w9: 12305,
        cards: 5565,
        coins: 27065
    }, {
        w0: 416,
        w1: 722,
        w2: 947,
        w3: 664,
        w4: 837,
        w5: 1488,
        w6: 2075,
        w7: 3186,
        w8: 6251,
        w9: 12429,
        cards: 5671,
        coins: 27585
    }, {
        w0: 419,
        w1: 728,
        w2: 957,
        w3: 672,
        w4: 844,
        w5: 1502,
        w6: 2100,
        w7: 3218,
        w8: 6309,
        w9: 12546,
        cards: 5778,
        coins: 28110
    }, {
        w0: 423,
        w1: 736,
        w2: 966,
        w3: 678,
        w4: 853,
        w5: 1513,
        w6: 2115,
        w7: 3248,
        w8: 6367,
        w9: 12661,
        cards: 5886,
        coins: 28640
    }, {
        w0: 426,
        w1: 742,
        w2: 975,
        w3: 686,
        w4: 862,
        w5: 1528,
        w6: 2138,
        w7: 3275,
        w8: 6429,
        w9: 12777,
        cards: 5995,
        coins: 29175
    }, {
        w0: 430,
        w1: 748,
        w2: 983,
        w3: 693,
        w4: 870,
        w5: 1540,
        w6: 2163,
        w7: 3304,
        w8: 6491,
        w9: 12898,
        cards: 6105,
        coins: 29715
    }, {
        w0: 433,
        w1: 754,
        w2: 991,
        w3: 701,
        w4: 879,
        w5: 1558,
        w6: 2181,
        w7: 3331,
        w8: 6546,
        w9: 13026,
        cards: 6216,
        coins: 30260
    }, {
        w0: 438,
        w1: 760,
        w2: 1e3,
        w3: 707,
        w4: 887,
        w5: 1575,
        w6: 2205,
        w7: 3359,
        w8: 6601,
        w9: 13139,
        cards: 6328,
        coins: 30810
    }, {
        w0: 443,
        w1: 767,
        w2: 1008,
        w3: 715,
        w4: 894,
        w5: 1585,
        w6: 2220,
        w7: 3386,
        w8: 6663,
        w9: 13250,
        cards: 6441,
        coins: 31365
    }, {
        w0: 448,
        w1: 773,
        w2: 1018,
        w3: 722,
        w4: 903,
        w5: 1602,
        w6: 2239,
        w7: 3418,
        w8: 6721,
        w9: 13371,
        cards: 6555,
        coins: 31925
    }, {
        w0: 453,
        w1: 779,
        w2: 1028,
        w3: 730,
        w4: 911,
        w5: 1613,
        w6: 2255,
        w7: 3452,
        w8: 6781,
        w9: 13483,
        cards: 6670,
        coins: 32490
    }, {
        w0: 458,
        w1: 786,
        w2: 1037,
        w3: 738,
        w4: 918,
        w5: 1627,
        w6: 2278,
        w7: 3483,
        w8: 6839,
        w9: 13607,
        cards: 6786,
        coins: 33060
    }, {
        w0: 461,
        w1: 793,
        w2: 1046,
        w3: 745,
        w4: 925,
        w5: 1645,
        w6: 2300,
        w7: 3513,
        w8: 6902,
        w9: 13724,
        cards: 6903,
        coins: 33635
    }, {
        w0: 464,
        w1: 801,
        w2: 1055,
        w3: 753,
        w4: 934,
        w5: 1656,
        w6: 2324,
        w7: 3547,
        w8: 6957,
        w9: 13841,
        cards: 7021,
        coins: 34215
    }, {
        w0: 468,
        w1: 807,
        w2: 1064,
        w3: 759,
        w4: 942,
        w5: 1669,
        w6: 2341,
        w7: 3574,
        w8: 7022,
        w9: 13961,
        cards: 7140,
        coins: 34800
    }, {
        w0: 472,
        w1: 815,
        w2: 1072,
        w3: 765,
        w4: 951,
        w5: 1684,
        w6: 2360,
        w7: 3606,
        w8: 7078,
        w9: 14085,
        cards: 7260,
        coins: 35390
    }, {
        w0: 477,
        w1: 823,
        w2: 1081,
        w3: 771,
        w4: 959,
        w5: 1701,
        w6: 2384,
        w7: 3635,
        w8: 7143,
        w9: 14210,
        cards: 7381,
        coins: 35985
    }, {
        w0: 482,
        w1: 831,
        w2: 1091,
        w3: 776,
        w4: 966,
        w5: 1712,
        w6: 2401,
        w7: 3667,
        w8: 7203,
        w9: 14326,
        cards: 7503,
        coins: 36585
    }, {
        w0: 485,
        w1: 837,
        w2: 1099,
        w3: 782,
        w4: 974,
        w5: 1729,
        w6: 2426,
        w7: 3695,
        w8: 7263,
        w9: 14451,
        cards: 7626,
        coins: 37190
    }, {
        w0: 489,
        w1: 844,
        w2: 1109,
        w3: 788,
        w4: 983,
        w5: 1747,
        w6: 2449,
        w7: 3727,
        w8: 7325,
        w9: 14574,
        cards: 7750,
        coins: 37800
    }, {
        w0: 494,
        w1: 850,
        w2: 1118,
        w3: 795,
        w4: 992,
        w5: 1757,
        w6: 2474,
        w7: 3756,
        w8: 7386,
        w9: 14699,
        cards: 7875,
        coins: 38415
    }, {
        w0: 499,
        w1: 858,
        w2: 1126,
        w3: 802,
        w4: 1e3,
        w5: 1773,
        w6: 2489,
        w7: 3783,
        w8: 7443,
        w9: 14809,
        cards: 8001,
        coins: 39035
    }, {
        w0: 503,
        w1: 866,
        w2: 1136,
        w3: 807,
        w4: 1009,
        w5: 1788,
        w6: 2507,
        w7: 3813,
        w8: 7508,
        w9: 14928,
        cards: 8128,
        coins: 39660
    }, {
        w0: 508,
        w1: 873,
        w2: 1146,
        w3: 812,
        w4: 1017,
        w5: 1803,
        w6: 2527,
        w7: 3846,
        w8: 7564,
        w9: 15051,
        cards: 8256,
        coins: 40290
    }, {
        w0: 512,
        w1: 879,
        w2: 1156,
        w3: 819,
        w4: 1026,
        w5: 1820,
        w6: 2552,
        w7: 3874,
        w8: 7626,
        w9: 15168,
        cards: 8385,
        coins: 40925
    }, {
        w0: 517,
        w1: 886,
        w2: 1164,
        w3: 824,
        w4: 1034,
        w5: 1838,
        w6: 2569,
        w7: 3904,
        w8: 7682,
        w9: 15297,
        cards: 8515,
        coins: 41565
    }, {
        w0: 520,
        w1: 894,
        w2: 1173,
        w3: 829,
        w4: 1042,
        w5: 1852,
        w6: 2594,
        w7: 3937,
        w8: 7743,
        w9: 15427,
        cards: 8646,
        coins: 42210
    }, {
        w0: 523,
        w1: 902,
        w2: 1182,
        w3: 834,
        w4: 1051,
        w5: 1867,
        w6: 2614,
        w7: 3964,
        w8: 7801,
        w9: 15545,
        cards: 8778,
        coins: 42860
    }, {
        w0: 528,
        w1: 910,
        w2: 1192,
        w3: 841,
        w4: 1060,
        w5: 1884,
        w6: 2633,
        w7: 3998,
        w8: 7857,
        w9: 15655,
        cards: 8911,
        coins: 43515
    }, {
        w0: 531,
        w1: 918,
        w2: 1201,
        w3: 849,
        w4: 1068,
        w5: 1896,
        w6: 2651,
        w7: 4030,
        w8: 7918,
        w9: 15780,
        cards: 9045,
        coins: 44175
    }, {
        w0: 536,
        w1: 924,
        w2: 1210,
        w3: 854,
        w4: 1075,
        w5: 1909,
        w6: 2666,
        w7: 4062,
        w8: 7979,
        w9: 15893,
        cards: 9180,
        coins: 44840
    }, {
        w0: 541,
        w1: 932,
        w2: 1218,
        w3: 862,
        w4: 1084,
        w5: 1926,
        w6: 2686,
        w7: 4095,
        w8: 8044,
        w9: 16008,
        cards: 9316,
        coins: 45510
    }, {
        w0: 546,
        w1: 940,
        w2: 1226,
        w3: 867,
        w4: 1092,
        w5: 1940,
        w6: 2711,
        w7: 4126,
        w8: 8108,
        w9: 16131,
        cards: 9453,
        coins: 46185
    }, {
        w0: 549,
        w1: 948,
        w2: 1236,
        w3: 872,
        w4: 1100,
        w5: 1950,
        w6: 2735,
        w7: 4158,
        w8: 8170,
        w9: 16249,
        cards: 9591,
        coins: 46865
    }, {
        w0: 553,
        w1: 955,
        w2: 1245,
        w3: 878,
        w4: 1107,
        w5: 1966,
        w6: 2755,
        w7: 4185,
        w8: 8229,
        w9: 16379,
        cards: 9730,
        coins: 47550
    }, {
        w0: 556,
        w1: 962,
        w2: 1254,
        w3: 886,
        w4: 1116,
        w5: 1976,
        w6: 2778,
        w7: 4218,
        w8: 8294,
        w9: 16493,
        cards: 9870,
        coins: 48240
    }, {
        w0: 560,
        w1: 969,
        w2: 1264,
        w3: 892,
        w4: 1124,
        w5: 1993,
        w6: 2794,
        w7: 4252,
        w8: 8358,
        w9: 16614,
        cards: 10011,
        coins: 48935
    }, {
        w0: 564,
        w1: 976,
        w2: 1273,
        w3: 897,
        w4: 1132,
        w5: 2009,
        w6: 2811,
        w7: 4286,
        w8: 8419,
        w9: 16734,
        cards: 10153,
        coins: 49635
    }, {
        w0: 567,
        w1: 982,
        w2: 1281,
        w3: 904,
        w4: 1139,
        w5: 2025,
        w6: 2826,
        w7: 4319,
        w8: 8476,
        w9: 16846,
        cards: 10296,
        coins: 50340
    }, {
        w0: 572,
        w1: 990,
        w2: 1289,
        w3: 911,
        w4: 1148,
        w5: 2042,
        w6: 2846,
        w7: 4348,
        w8: 8538,
        w9: 16962,
        cards: 10440,
        coins: 51050
    }, {
        w0: 575,
        w1: 996,
        w2: 1297,
        w3: 916,
        w4: 1155,
        w5: 2058,
        w6: 2868,
        w7: 4378,
        w8: 8601,
        w9: 17076,
        cards: 10585,
        coins: 51765
    }, {
        w0: 580,
        w1: 1002,
        w2: 1306,
        w3: 922,
        w4: 1162,
        w5: 2075,
        w6: 2893,
        w7: 4407,
        w8: 8658,
        w9: 17190,
        cards: 10731,
        coins: 52485
    }, {
        w0: 583,
        w1: 1010,
        w2: 1314,
        w3: 929,
        w4: 1169,
        w5: 2089,
        w6: 2918,
        w7: 4437,
        w8: 8721,
        w9: 17313,
        cards: 10878,
        coins: 53210
    }, {
        w0: 587,
        w1: 1017,
        w2: 1324,
        w3: 936,
        w4: 1177,
        w5: 2106,
        w6: 2933,
        w7: 4465,
        w8: 8779,
        w9: 17423,
        cards: 11026,
        coins: 53940
    }, {
        w0: 592,
        w1: 1024,
        w2: 1333,
        w3: 943,
        w4: 1185,
        w5: 2119,
        w6: 2958,
        w7: 4494,
        w8: 8841,
        w9: 17544,
        cards: 11175,
        coins: 54675
    }, {
        w0: 597,
        w1: 1031,
        w2: 1342,
        w3: 948,
        w4: 1192,
        w5: 2133,
        w6: 2975,
        w7: 4527,
        w8: 8897,
        w9: 17674,
        cards: 11325,
        coins: 55415
    }, {
        w0: 602,
        w1: 1039,
        w2: 1351,
        w3: 955,
        w4: 1200,
        w5: 2147,
        w6: 2994,
        w7: 4556,
        w8: 8961,
        w9: 17795,
        cards: 11476,
        coins: 56160
    }, {
        w0: 605,
        w1: 1047,
        w2: 1360,
        w3: 960,
        w4: 1209,
        w5: 2165,
        w6: 3019,
        w7: 4587,
        w8: 9021,
        w9: 17917,
        cards: 11628,
        coins: 56910
    }, {
        w0: 609,
        w1: 1054,
        w2: 1369,
        w3: 965,
        w4: 1216,
        w5: 2177,
        w6: 3035,
        w7: 4614,
        w8: 9078,
        w9: 18043,
        cards: 11781,
        coins: 57665
    }, {
        w0: 613,
        w1: 1060,
        w2: 1377,
        w3: 971,
        w4: 1225,
        w5: 2192,
        w6: 3055,
        w7: 4645,
        w8: 9142,
        w9: 18162,
        cards: 11935,
        coins: 58425
    }, {
        w0: 618,
        w1: 1066,
        w2: 1387,
        w3: 977,
        w4: 1232,
        w5: 2207,
        w6: 3075,
        w7: 4675,
        w8: 9204,
        w9: 18275,
        cards: 12090,
        coins: 59190
    }, {
        w0: 623,
        w1: 1074,
        w2: 1396,
        w3: 982,
        w4: 1240,
        w5: 2222,
        w6: 3094,
        w7: 4709,
        w8: 9269,
        w9: 18386,
        cards: 12246,
        coins: 59960
    }, {
        w0: 626,
        w1: 1082,
        w2: 1405,
        w3: 988,
        w4: 1249,
        w5: 2234,
        w6: 3109,
        w7: 4739,
        w8: 9331,
        w9: 18505,
        cards: 12403,
        coins: 60735
    }, {
        w0: 631,
        w1: 1090,
        w2: 1413,
        w3: 993,
        w4: 1256,
        w5: 2250,
        w6: 3128,
        w7: 4768,
        w8: 9386,
        w9: 18623,
        cards: 12561,
        coins: 61515
    }, {
        w0: 636,
        w1: 1098,
        w2: 1422,
        w3: 998,
        w4: 1264,
        w5: 2262,
        w6: 3145,
        w7: 4798,
        w8: 9444,
        w9: 18734,
        cards: 12720,
        coins: 62300
    }, {
        w0: 640,
        w1: 1104,
        w2: 1430,
        w3: 1003,
        w4: 1271,
        w5: 2278,
        w6: 3165,
        w7: 4832,
        w8: 9501,
        w9: 18856,
        cards: 12880,
        coins: 63090
    }, {
        w0: 645,
        w1: 1112,
        w2: 1439,
        w3: 1009,
        w4: 1280,
        w5: 2290,
        w6: 3182,
        w7: 4860,
        w8: 9560,
        w9: 18970,
        cards: 13041,
        coins: 63885
    }, {
        w0: 650,
        w1: 1118,
        w2: 1447,
        w3: 1017,
        w4: 1287,
        w5: 2305,
        w6: 3198,
        w7: 4894,
        w8: 9621,
        w9: 19098,
        cards: 13203,
        coins: 64685
    }, {
        w0: 655,
        w1: 1124,
        w2: 1456,
        w3: 1024,
        w4: 1295,
        w5: 2320,
        w6: 3221,
        w7: 4926,
        w8: 9677,
        w9: 19228,
        cards: 13366,
        coins: 65490
    }, {
        w0: 659,
        w1: 1131,
        w2: 1464,
        w3: 1029,
        w4: 1304,
        w5: 2335,
        w6: 3242,
        w7: 4958,
        w8: 9735,
        w9: 19341,
        cards: 13530,
        coins: 66300
    }, {
        w0: 662,
        w1: 1138,
        w2: 1473,
        w3: 1035,
        w4: 1311,
        w5: 2352,
        w6: 3263,
        w7: 4989,
        w8: 9800,
        w9: 19454,
        cards: 13695,
        coins: 67115
    }, {
        w0: 667,
        w1: 1144,
        w2: 1481,
        w3: 1042,
        w4: 1320,
        w5: 2363,
        w6: 3286,
        w7: 5021,
        w8: 9864,
        w9: 19567,
        cards: 13861,
        coins: 67935
    }, {
        w0: 671,
        w1: 1150,
        w2: 1490,
        w3: 1050,
        w4: 1328,
        w5: 2379,
        w6: 3304,
        w7: 5050,
        w8: 9925,
        w9: 19684,
        cards: 14028,
        coins: 68760
    }, {
        w0: 676,
        w1: 1158,
        w2: 1498,
        w3: 1058,
        w4: 1337,
        w5: 2391,
        w6: 3329,
        w7: 5083,
        w8: 9985,
        w9: 19797,
        cards: 14196,
        coins: 69590
    }, {
        w0: 679,
        w1: 1166,
        w2: 1506,
        w3: 1064,
        w4: 1346,
        w5: 2404,
        w6: 3345,
        w7: 5110,
        w8: 10048,
        w9: 19917,
        cards: 14365,
        coins: 70425
    }, {
        w0: 684,
        w1: 1172,
        w2: 1515,
        w3: 1072,
        w4: 1354,
        w5: 2419,
        w6: 3364,
        w7: 5142,
        w8: 10107,
        w9: 20046,
        cards: 14535,
        coins: 71265
    }, {
        w0: 688,
        w1: 1179,
        w2: 1525,
        w3: 1077,
        w4: 1362,
        w5: 2432,
        w6: 3384,
        w7: 5176,
        w8: 10165,
        w9: 20164,
        cards: 14706,
        coins: 72110
    }, {
        w0: 692,
        w1: 1187,
        w2: 1534,
        w3: 1083,
        w4: 1371,
        w5: 2444,
        w6: 3402,
        w7: 5210,
        w8: 10229,
        w9: 20286,
        cards: 14878,
        coins: 72960
    }, {
        w0: 697,
        w1: 1195,
        w2: 1542,
        w3: 1089,
        w4: 1379,
        w5: 2456,
        w6: 3426,
        w7: 5243,
        w8: 10287,
        w9: 20405,
        cards: 15051,
        coins: 73815
    }, {
        w0: 700,
        w1: 1203,
        w2: 1550,
        w3: 1094,
        w4: 1387,
        w5: 2466,
        w6: 3447,
        w7: 5272,
        w8: 10344,
        w9: 20517,
        cards: 15225,
        coins: 74675
    }, {
        w0: 703,
        w1: 1209,
        w2: 1558,
        w3: 1102,
        w4: 1394,
        w5: 2477,
        w6: 3470,
        w7: 5300,
        w8: 10404,
        w9: 20646,
        cards: 15400,
        coins: 75540
    }, {
        w0: 706,
        w1: 1216,
        w2: 1567,
        w3: 1107,
        w4: 1401,
        w5: 2488,
        w6: 3494,
        w7: 5327,
        w8: 10461,
        w9: 20767,
        cards: 15576,
        coins: 76410
    }, {
        w0: 710,
        w1: 1224,
        w2: 1575,
        w3: 1115,
        w4: 1409,
        w5: 2503,
        w6: 3511,
        w7: 5354,
        w8: 10517,
        w9: 20889,
        cards: 15753,
        coins: 77285
    }, {
        w0: 715,
        w1: 1231,
        w2: 1584,
        w3: 1120,
        w4: 1416,
        w5: 2516,
        w6: 3535,
        w7: 5381,
        w8: 10574,
        w9: 21017,
        cards: 15931,
        coins: 78165
    }, {
        w0: 719,
        w1: 1237,
        w2: 1594,
        w3: 1128,
        w4: 1424,
        w5: 2529,
        w6: 3552,
        w7: 5408,
        w8: 10635,
        w9: 21138,
        cards: 16110,
        coins: 79050
    }, {
        w0: 723,
        w1: 1245,
        w2: 1602,
        w3: 1134,
        w4: 1433,
        w5: 2546,
        w6: 3569,
        w7: 5438,
        w8: 10691,
        w9: 21266,
        cards: 16290,
        coins: 79940
    }, {
        w0: 726,
        w1: 1253,
        w2: 1612,
        w3: 1142,
        w4: 1442,
        w5: 2561,
        w6: 3593,
        w7: 5466,
        w8: 10747,
        w9: 21394,
        cards: 16471,
        coins: 80835
    }, {
        w0: 729,
        w1: 1259,
        w2: 1622,
        w3: 1149,
        w4: 1451,
        w5: 2572,
        w6: 3613,
        w7: 5493,
        w8: 10806,
        w9: 21523,
        cards: 16653,
        coins: 81735
    }, {
        w0: 733,
        w1: 1266,
        w2: 1631,
        w3: 1157,
        w4: 1459,
        w5: 2590,
        w6: 3638,
        w7: 5520,
        w8: 10870,
        w9: 21645,
        cards: 16836,
        coins: 82640
    }, {
        w0: 736,
        w1: 1273,
        w2: 1640,
        w3: 1165,
        w4: 1466,
        w5: 2606,
        w6: 3657,
        w7: 5549,
        w8: 10932,
        w9: 21766,
        cards: 17020,
        coins: 83550
    }, {
        w0: 741,
        w1: 1279,
        w2: 1648,
        w3: 1171,
        w4: 1474,
        w5: 2622,
        w6: 3676,
        w7: 5582,
        w8: 10996,
        w9: 21888,
        cards: 17205,
        coins: 84465
    }, {
        w0: 745,
        w1: 1285,
        w2: 1657,
        w3: 1179,
        w4: 1482,
        w5: 2635,
        w6: 3696,
        w7: 5611,
        w8: 11052,
        w9: 22003,
        cards: 17391,
        coins: 85385
    }, {
        w0: 748,
        w1: 1291,
        w2: 1665,
        w3: 1184,
        w4: 1489,
        w5: 2649,
        w6: 3714,
        w7: 5645,
        w8: 11113,
        w9: 22125,
        cards: 17578,
        coins: 86310
    }, {
        w0: 751,
        w1: 1299,
        w2: 1675,
        w3: 1189,
        w4: 1498,
        w5: 2664,
        w6: 3731,
        w7: 5678,
        w8: 11176,
        w9: 22250,
        cards: 17766,
        coins: 87240
    }, {
        w0: 755,
        w1: 1306,
        w2: 1685,
        w3: 1196,
        w4: 1507,
        w5: 2678,
        w6: 3746,
        w7: 5709,
        w8: 11241,
        w9: 22370,
        cards: 17955,
        coins: 88175
    }, {
        w0: 760,
        w1: 1313,
        w2: 1695,
        w3: 1201,
        w4: 1515,
        w5: 2689,
        w6: 3768,
        w7: 5742,
        w8: 11302,
        w9: 22481,
        cards: 18145,
        coins: 89115
    }, {
        w0: 764,
        w1: 1319,
        w2: 1703,
        w3: 1208,
        w4: 1523,
        w5: 2699,
        w6: 3788,
        w7: 5773,
        w8: 11361,
        w9: 22594,
        cards: 18336,
        coins: 90060
    }, {
        w0: 769,
        w1: 1325,
        w2: 1713,
        w3: 1215,
        w4: 1532,
        w5: 2709,
        w6: 3811,
        w7: 5803,
        w8: 11422,
        w9: 22715,
        cards: 18528,
        coins: 91010
    }, {
        w0: 772,
        w1: 1332,
        w2: 1722,
        w3: 1222,
        w4: 1540,
        w5: 2722,
        w6: 3833,
        w7: 5835,
        w8: 11482,
        w9: 22842,
        cards: 18721,
        coins: 91965
    }, {
        w0: 776,
        w1: 1338,
        w2: 1731,
        w3: 1228,
        w4: 1547,
        w5: 2734,
        w6: 3850,
        w7: 5866,
        w8: 11541,
        w9: 22961,
        cards: 18915,
        coins: 92925
    }, {
        w0: 779,
        w1: 1345,
        w2: 1740,
        w3: 1235,
        w4: 1554,
        w5: 2752,
        w6: 3872,
        w7: 5893,
        w8: 11606,
        w9: 23071,
        cards: 19110,
        coins: 93890
    }, {
        w0: 784,
        w1: 1352,
        w2: 1749,
        w3: 1241,
        w4: 1563,
        w5: 2768,
        w6: 3892,
        w7: 5921,
        w8: 11667,
        w9: 23184,
        cards: 19306,
        coins: 94860
    }, {
        w0: 789,
        w1: 1358,
        w2: 1757,
        w3: 1249,
        w4: 1571,
        w5: 2783,
        w6: 3909,
        w7: 5948,
        w8: 11724,
        w9: 23303,
        cards: 19503,
        coins: 95835
    }, {
        w0: 794,
        w1: 1366,
        w2: 1766,
        w3: 1256,
        w4: 1580,
        w5: 2799,
        w6: 3929,
        w7: 5981,
        w8: 11785,
        w9: 23432,
        cards: 19701,
        coins: 96815
    }, {
        w0: 798,
        w1: 1372,
        w2: 1775,
        w3: 1264,
        w4: 1587,
        w5: 2811,
        w6: 3949,
        w7: 6009,
        w8: 11845,
        w9: 23561,
        cards: 19900,
        coins: 97800
    }, {
        w0: 802,
        w1: 1380,
        w2: 1784,
        w3: 1272,
        w4: 1594,
        w5: 2829,
        w6: 3970,
        w7: 6040,
        w8: 11903,
        w9: 23685,
        cards: 20100,
        coins: 98790
    }, {
        w0: 807,
        w1: 1388,
        w2: 1794,
        w3: 1277,
        w4: 1601,
        w5: 2839,
        w6: 3991,
        w7: 6074,
        w8: 11959,
        w9: 23797,
        cards: 20301,
        coins: 99785
    }, {
        w0: 810,
        w1: 1394,
        w2: 1802,
        w3: 1283,
        w4: 1609,
        w5: 2853,
        w6: 4012,
        w7: 6105,
        w8: 12019,
        w9: 23914,
        cards: 20503,
        coins: 100785
    } ],
    "2": [ {
        w0: 3,
        w1: 8,
        w2: 9,
        w3: 9,
        w4: 8,
        w5: 17,
        w6: 18,
        w7: 37,
        w8: 61,
        w9: 128,
        cards: 1,
        coins: 0
    }, {
        w0: 8,
        w1: 15,
        w2: 20,
        w3: 17,
        w4: 15,
        w5: 32,
        w6: 43,
        w7: 74,
        w8: 130,
        w9: 259,
        cards: 10,
        coins: 300
    }, {
        w0: 12,
        w1: 24,
        w2: 31,
        w3: 25,
        w4: 25,
        w5: 43,
        w6: 62,
        w7: 111,
        w8: 198,
        w9: 387,
        cards: 15,
        coins: 317
    }, {
        w0: 15,
        w1: 31,
        w2: 42,
        w3: 32,
        w4: 35,
        w5: 55,
        w6: 89,
        w7: 145,
        w8: 267,
        w9: 525,
        cards: 21,
        coins: 339
    }, {
        w0: 19,
        w1: 37,
        w2: 51,
        w3: 40,
        w4: 43,
        w5: 75,
        w6: 107,
        w7: 182,
        w8: 332,
        w9: 666,
        cards: 28,
        coins: 367
    }, {
        w0: 23,
        w1: 44,
        w2: 59,
        w3: 46,
        w4: 51,
        w5: 89,
        w6: 133,
        w7: 215,
        w8: 404,
        w9: 801,
        cards: 36,
        coins: 400
    }, {
        w0: 29,
        w1: 53,
        w2: 68,
        w3: 55,
        w4: 58,
        w5: 108,
        w6: 154,
        w7: 252,
        w8: 465,
        w9: 926,
        cards: 45,
        coins: 439
    }, {
        w0: 34,
        w1: 59,
        w2: 77,
        w3: 63,
        w4: 68,
        w5: 128,
        w6: 172,
        w7: 283,
        w8: 530,
        w9: 1067,
        cards: 55,
        coins: 483
    }, {
        w0: 39,
        w1: 67,
        w2: 88,
        w3: 68,
        w4: 78,
        w5: 140,
        w6: 198,
        w7: 314,
        w8: 597,
        w9: 1206,
        cards: 66,
        coins: 533
    }, {
        w0: 44,
        w1: 75,
        w2: 97,
        w3: 75,
        w4: 86,
        w5: 158,
        w6: 222,
        w7: 344,
        w8: 663,
        w9: 1349,
        cards: 78,
        coins: 588
    }, {
        w0: 47,
        w1: 81,
        w2: 108,
        w3: 80,
        w4: 94,
        w5: 171,
        w6: 240,
        w7: 375,
        w8: 733,
        w9: 1487,
        cards: 91,
        coins: 649
    }, {
        w0: 51,
        w1: 89,
        w2: 117,
        w3: 87,
        w4: 102,
        w5: 182,
        w6: 266,
        w7: 411,
        w8: 799,
        w9: 1625,
        cards: 105,
        coins: 715
    }, {
        w0: 56,
        w1: 97,
        w2: 125,
        w3: 92,
        w4: 112,
        w5: 195,
        w6: 284,
        w7: 444,
        w8: 859,
        w9: 1766,
        cards: 120,
        coins: 787
    }, {
        w0: 62,
        w1: 103,
        w2: 134,
        w3: 100,
        w4: 121,
        w5: 213,
        w6: 307,
        w7: 482,
        w8: 927,
        w9: 1894,
        cards: 136,
        coins: 864
    }, {
        w0: 66,
        w1: 111,
        w2: 145,
        w3: 109,
        w4: 131,
        w5: 230,
        w6: 332,
        w7: 513,
        w8: 997,
        w9: 2027,
        cards: 153,
        coins: 947
    }, {
        w0: 69,
        w1: 119,
        w2: 154,
        w3: 118,
        w4: 139,
        w5: 250,
        w6: 350,
        w7: 549,
        w8: 1058,
        w9: 2163,
        cards: 171,
        coins: 1035
    }, {
        w0: 75,
        w1: 128,
        w2: 165,
        w3: 123,
        w4: 149,
        w5: 263,
        w6: 370,
        w7: 586,
        w8: 1119,
        w9: 2286,
        cards: 190,
        coins: 1129
    }, {
        w0: 80,
        w1: 136,
        w2: 176,
        w3: 130,
        w4: 158,
        w5: 279,
        w6: 387,
        w7: 623,
        w8: 1187,
        w9: 2410,
        cards: 210,
        coins: 1228
    }, {
        w0: 86,
        w1: 143,
        w2: 185,
        w3: 135,
        w4: 166,
        w5: 290,
        w6: 407,
        w7: 653,
        w8: 1249,
        w9: 2537,
        cards: 231,
        coins: 1333
    }, {
        w0: 89,
        w1: 152,
        w2: 196,
        w3: 142,
        w4: 174,
        w5: 308,
        w6: 425,
        w7: 688,
        w8: 1320,
        w9: 2672,
        cards: 253,
        coins: 1443
    }, {
        w0: 92,
        w1: 161,
        w2: 206,
        w3: 151,
        w4: 182,
        w5: 328,
        w6: 443,
        w7: 725,
        w8: 1387,
        w9: 2814,
        cards: 276,
        coins: 1559
    }, {
        w0: 98,
        w1: 168,
        w2: 217,
        w3: 158,
        w4: 189,
        w5: 342,
        w6: 464,
        w7: 759,
        w8: 1454,
        w9: 2948,
        cards: 300,
        coins: 1680
    }, {
        w0: 103,
        w1: 176,
        w2: 228,
        w3: 164,
        w4: 198,
        w5: 353,
        w6: 488,
        w7: 792,
        w8: 1525,
        w9: 3070,
        cards: 325,
        coins: 1807
    }, {
        w0: 109,
        w1: 183,
        w2: 237,
        w3: 172,
        w4: 206,
        w5: 365,
        w6: 507,
        w7: 828,
        w8: 1592,
        w9: 3193,
        cards: 351,
        coins: 1939
    }, {
        w0: 113,
        w1: 190,
        w2: 248,
        w3: 179,
        w4: 216,
        w5: 385,
        w6: 524,
        w7: 864,
        w8: 1654,
        w9: 3314,
        cards: 378,
        coins: 2077
    }, {
        w0: 118,
        w1: 199,
        w2: 256,
        w3: 188,
        w4: 223,
        w5: 396,
        w6: 546,
        w7: 893,
        w8: 1725,
        w9: 3440,
        cards: 406,
        coins: 2220
    }, {
        w0: 123,
        w1: 207,
        w2: 265,
        w3: 196,
        w4: 231,
        w5: 411,
        w6: 570,
        w7: 923,
        w8: 1794,
        w9: 3579,
        cards: 435,
        coins: 2369
    }, {
        w0: 127,
        w1: 213,
        w2: 274,
        w3: 201,
        w4: 241,
        w5: 430,
        w6: 587,
        w7: 954,
        w8: 1858,
        w9: 3706,
        cards: 465,
        coins: 2523
    }, {
        w0: 130,
        w1: 222,
        w2: 285,
        w3: 209,
        w4: 249,
        w5: 444,
        w6: 604,
        w7: 987,
        w8: 1927,
        w9: 3840,
        cards: 496,
        coins: 2683
    }, {
        w0: 135,
        w1: 229,
        w2: 296,
        w3: 217,
        w4: 259,
        w5: 455,
        w6: 620,
        w7: 1020,
        w8: 1992,
        w9: 3980,
        cards: 528,
        coins: 2848
    }, {
        w0: 140,
        w1: 237,
        w2: 305,
        w3: 226,
        w4: 266,
        w5: 470,
        w6: 638,
        w7: 1053,
        w8: 2057,
        w9: 4105,
        cards: 561,
        coins: 3019
    }, {
        w0: 145,
        w1: 245,
        w2: 315,
        w3: 233,
        w4: 274,
        w5: 487,
        w6: 656,
        w7: 1085,
        w8: 2121,
        w9: 4228,
        cards: 595,
        coins: 3195
    }, {
        w0: 151,
        w1: 252,
        w2: 325,
        w3: 241,
        w4: 283,
        w5: 507,
        w6: 682,
        w7: 1120,
        w8: 2181,
        w9: 4363,
        cards: 630,
        coins: 3377
    }, {
        w0: 156,
        w1: 260,
        w2: 334,
        w3: 248,
        w4: 292,
        w5: 527,
        w6: 702,
        w7: 1152,
        w8: 2253,
        w9: 4495,
        cards: 666,
        coins: 3564
    }, {
        w0: 161,
        w1: 268,
        w2: 345,
        w3: 256,
        w4: 301,
        w5: 540,
        w6: 722,
        w7: 1187,
        w8: 2317,
        w9: 4619,
        cards: 703,
        coins: 3757
    }, {
        w0: 165,
        w1: 277,
        w2: 354,
        w3: 262,
        w4: 310,
        w5: 553,
        w6: 747,
        w7: 1219,
        w8: 2386,
        w9: 4742,
        cards: 741,
        coins: 3955
    }, {
        w0: 171,
        w1: 285,
        w2: 365,
        w3: 271,
        w4: 319,
        w5: 573,
        w6: 768,
        w7: 1253,
        w8: 2456,
        w9: 4873,
        cards: 780,
        coins: 4159
    }, {
        w0: 176,
        w1: 294,
        w2: 374,
        w3: 279,
        w4: 328,
        w5: 585,
        w6: 785,
        w7: 1284,
        w8: 2520,
        w9: 5012,
        cards: 820,
        coins: 4368
    }, {
        w0: 182,
        w1: 301,
        w2: 384,
        w3: 288,
        w4: 338,
        w5: 605,
        w6: 805,
        w7: 1315,
        w8: 2585,
        w9: 5135,
        cards: 861,
        coins: 4583
    }, {
        w0: 186,
        w1: 309,
        w2: 393,
        w3: 296,
        w4: 347,
        w5: 623,
        w6: 828,
        w7: 1352,
        w8: 2652,
        w9: 5265,
        cards: 903,
        coins: 4803
    }, {
        w0: 190,
        w1: 316,
        w2: 402,
        w3: 303,
        w4: 356,
        w5: 638,
        w6: 854,
        w7: 1385,
        w8: 2716,
        w9: 5387,
        cards: 946,
        coins: 5029
    }, {
        w0: 196,
        w1: 325,
        w2: 411,
        w3: 311,
        w4: 365,
        w5: 658,
        w6: 881,
        w7: 1417,
        w8: 2784,
        w9: 5525,
        cards: 990,
        coins: 5260
    }, {
        w0: 201,
        w1: 332,
        w2: 420,
        w3: 320,
        w4: 374,
        w5: 674,
        w6: 901,
        w7: 1454,
        w8: 2853,
        w9: 5652,
        cards: 1035,
        coins: 5497
    }, {
        w0: 206,
        w1: 340,
        w2: 431,
        w3: 326,
        w4: 383,
        w5: 689,
        w6: 925,
        w7: 1484,
        w8: 2923,
        w9: 5774,
        cards: 1081,
        coins: 5739
    }, {
        w0: 210,
        w1: 349,
        w2: 441,
        w3: 334,
        w4: 392,
        w5: 701,
        w6: 945,
        w7: 1514,
        w8: 2985,
        w9: 5899,
        cards: 1128,
        coins: 5987
    }, {
        w0: 213,
        w1: 355,
        w2: 450,
        w3: 342,
        w4: 402,
        w5: 716,
        w6: 964,
        w7: 1543,
        w8: 3051,
        w9: 6030,
        cards: 1176,
        coins: 6240
    }, {
        w0: 217,
        w1: 363,
        w2: 459,
        w3: 350,
        w4: 411,
        w5: 732,
        w6: 989,
        w7: 1576,
        w8: 3116,
        w9: 6152,
        cards: 1225,
        coins: 6499
    }, {
        w0: 220,
        w1: 371,
        w2: 469,
        w3: 358,
        w4: 420,
        w5: 747,
        w6: 1010,
        w7: 1608,
        w8: 3182,
        w9: 6292,
        cards: 1275,
        coins: 6763
    }, {
        w0: 223,
        w1: 378,
        w2: 479,
        w3: 365,
        w4: 428,
        w5: 759,
        w6: 1033,
        w7: 1639,
        w8: 3244,
        w9: 6414,
        cards: 1326,
        coins: 7033
    }, {
        w0: 228,
        w1: 387,
        w2: 487,
        w3: 374,
        w4: 436,
        w5: 770,
        w6: 1056,
        w7: 1673,
        w8: 3312,
        w9: 6555,
        cards: 1378,
        coins: 7308
    }, {
        w0: 232,
        w1: 395,
        w2: 497,
        w3: 383,
        w4: 443,
        w5: 784,
        w6: 1078,
        w7: 1706,
        w8: 3380,
        w9: 6680,
        cards: 1431,
        coins: 7589
    }, {
        w0: 237,
        w1: 403,
        w2: 507,
        w3: 391,
        w4: 452,
        w5: 796,
        w6: 1102,
        w7: 1742,
        w8: 3445,
        w9: 6822,
        cards: 1485,
        coins: 7875
    }, {
        w0: 241,
        w1: 410,
        w2: 518,
        w3: 398,
        w4: 460,
        w5: 815,
        w6: 1123,
        w7: 1780,
        w8: 3509,
        w9: 6959,
        cards: 1540,
        coins: 8167
    }, {
        w0: 244,
        w1: 418,
        w2: 528,
        w3: 407,
        w4: 470,
        w5: 831,
        w6: 1144,
        w7: 1810,
        w8: 3576,
        w9: 7097,
        cards: 1596,
        coins: 8464
    }, {
        w0: 250,
        w1: 425,
        w2: 539,
        w3: 415,
        w4: 477,
        w5: 846,
        w6: 1166,
        w7: 1845,
        w8: 3637,
        w9: 7220,
        cards: 1653,
        coins: 8767
    }, {
        w0: 254,
        w1: 433,
        w2: 549,
        w3: 420,
        w4: 487,
        w5: 857,
        w6: 1189,
        w7: 1878,
        w8: 3704,
        w9: 7341,
        cards: 1711,
        coins: 9075
    }, {
        w0: 260,
        w1: 440,
        w2: 558,
        w3: 426,
        w4: 495,
        w5: 871,
        w6: 1213,
        w7: 1909,
        w8: 3775,
        w9: 7484,
        cards: 1770,
        coins: 9389
    }, {
        w0: 265,
        w1: 447,
        w2: 567,
        w3: 431,
        w4: 505,
        w5: 882,
        w6: 1231,
        w7: 1938,
        w8: 3837,
        w9: 7625,
        cards: 1830,
        coins: 9708
    }, {
        w0: 271,
        w1: 455,
        w2: 576,
        w3: 438,
        w4: 515,
        w5: 899,
        w6: 1253,
        w7: 1970,
        w8: 3907,
        w9: 7762,
        cards: 1891,
        coins: 10033
    }, {
        w0: 274,
        w1: 464,
        w2: 587,
        w3: 443,
        w4: 525,
        w5: 916,
        w6: 1277,
        w7: 2005,
        w8: 3972,
        w9: 7885,
        cards: 1953,
        coins: 10363
    }, {
        w0: 278,
        w1: 471,
        w2: 596,
        w3: 450,
        w4: 532,
        w5: 928,
        w6: 1304,
        w7: 2036,
        w8: 4037,
        w9: 8009,
        cards: 2016,
        coins: 10699
    }, {
        w0: 282,
        w1: 479,
        w2: 606,
        w3: 459,
        w4: 542,
        w5: 942,
        w6: 1326,
        w7: 2068,
        w8: 4105,
        w9: 8139,
        cards: 2080,
        coins: 11040
    }, {
        w0: 285,
        w1: 485,
        w2: 615,
        w3: 468,
        w4: 550,
        w5: 957,
        w6: 1349,
        w7: 2098,
        w8: 4170,
        w9: 8264,
        cards: 2145,
        coins: 11387
    }, {
        w0: 289,
        w1: 492,
        w2: 625,
        w3: 475,
        w4: 560,
        w5: 970,
        w6: 1367,
        w7: 2127,
        w8: 4241,
        w9: 8391,
        cards: 2211,
        coins: 11739
    }, {
        w0: 293,
        w1: 501,
        w2: 634,
        w3: 483,
        w4: 570,
        w5: 983,
        w6: 1393,
        w7: 2163,
        w8: 4304,
        w9: 8533,
        cards: 2278,
        coins: 12097
    }, {
        w0: 298,
        w1: 509,
        w2: 645,
        w3: 491,
        w4: 579,
        w5: 1002,
        w6: 1417,
        w7: 2198,
        w8: 4369,
        w9: 8675,
        cards: 2346,
        coins: 12460
    }, {
        w0: 301,
        w1: 518,
        w2: 653,
        w3: 499,
        w4: 587,
        w5: 1021,
        w6: 1443,
        w7: 2234,
        w8: 4441,
        w9: 8807,
        cards: 2415,
        coins: 12829
    }, {
        w0: 306,
        w1: 527,
        w2: 663,
        w3: 506,
        w4: 595,
        w5: 1035,
        w6: 1463,
        w7: 2269,
        w8: 4501,
        w9: 8936,
        cards: 2485,
        coins: 13203
    }, {
        w0: 309,
        w1: 536,
        w2: 672,
        w3: 512,
        w4: 603,
        w5: 1053,
        w6: 1485,
        w7: 2307,
        w8: 4563,
        w9: 9061,
        cards: 2556,
        coins: 13583
    }, {
        w0: 315,
        w1: 545,
        w2: 681,
        w3: 517,
        w4: 611,
        w5: 1067,
        w6: 1511,
        w7: 2338,
        w8: 4623,
        w9: 9189,
        cards: 2628,
        coins: 13968
    }, {
        w0: 318,
        w1: 553,
        w2: 691,
        w3: 524,
        w4: 620,
        w5: 1080,
        w6: 1535,
        w7: 2371,
        w8: 4694,
        w9: 9313,
        cards: 2701,
        coins: 14359
    }, {
        w0: 322,
        w1: 561,
        w2: 701,
        w3: 530,
        w4: 630,
        w5: 1098,
        w6: 1554,
        w7: 2408,
        w8: 4758,
        w9: 9440,
        cards: 2775,
        coins: 14755
    }, {
        w0: 327,
        w1: 569,
        w2: 711,
        w3: 538,
        w4: 639,
        w5: 1111,
        w6: 1579,
        w7: 2443,
        w8: 4820,
        w9: 9581,
        cards: 2850,
        coins: 15157
    }, {
        w0: 330,
        w1: 576,
        w2: 719,
        w3: 545,
        w4: 649,
        w5: 1122,
        w6: 1599,
        w7: 2476,
        w8: 4887,
        w9: 9702,
        cards: 2926,
        coins: 15564
    }, {
        w0: 334,
        w1: 585,
        w2: 728,
        w3: 551,
        w4: 657,
        w5: 1139,
        w6: 1617,
        w7: 2509,
        w8: 4958,
        w9: 9845,
        cards: 3003,
        coins: 15977
    }, {
        w0: 340,
        w1: 594,
        w2: 739,
        w3: 558,
        w4: 667,
        w5: 1152,
        w6: 1638,
        w7: 2542,
        w8: 5020,
        w9: 9974,
        cards: 3081,
        coins: 16395
    }, {
        w0: 343,
        w1: 602,
        w2: 749,
        w3: 563,
        w4: 677,
        w5: 1168,
        w6: 1657,
        w7: 2575,
        w8: 5082,
        w9: 10099,
        cards: 3160,
        coins: 16819
    }, {
        w0: 348,
        w1: 611,
        w2: 758,
        w3: 569,
        w4: 685,
        w5: 1184,
        w6: 1674,
        w7: 2605,
        w8: 5151,
        w9: 10232,
        cards: 3240,
        coins: 17248
    }, {
        w0: 351,
        w1: 618,
        w2: 768,
        w3: 576,
        w4: 694,
        w5: 1195,
        w6: 1697,
        w7: 2635,
        w8: 5222,
        w9: 10369,
        cards: 3321,
        coins: 17683
    }, {
        w0: 356,
        w1: 626,
        w2: 777,
        w3: 582,
        w4: 702,
        w5: 1209,
        w6: 1723,
        w7: 2672,
        w8: 5290,
        w9: 10492,
        cards: 3403,
        coins: 18123
    }, {
        w0: 360,
        w1: 634,
        w2: 788,
        w3: 589,
        w4: 712,
        w5: 1225,
        w6: 1742,
        w7: 2704,
        w8: 5356,
        w9: 10624,
        cards: 3486,
        coins: 18569
    }, {
        w0: 364,
        w1: 642,
        w2: 799,
        w3: 597,
        w4: 722,
        w5: 1244,
        w6: 1759,
        w7: 2741,
        w8: 5421,
        w9: 10748,
        cards: 3570,
        coins: 19020
    }, {
        w0: 367,
        w1: 649,
        w2: 810,
        w3: 606,
        w4: 730,
        w5: 1264,
        w6: 1783,
        w7: 2775,
        w8: 5490,
        w9: 10874,
        cards: 3655,
        coins: 19477
    }, {
        w0: 371,
        w1: 658,
        w2: 821,
        w3: 612,
        w4: 740,
        w5: 1275,
        w6: 1808,
        w7: 2812,
        w8: 5557,
        w9: 11e3,
        cards: 3741,
        coins: 19939
    }, {
        w0: 376,
        w1: 666,
        w2: 829,
        w3: 617,
        w4: 750,
        w5: 1286,
        w6: 1826,
        w7: 2846,
        w8: 5625,
        w9: 11128,
        cards: 3828,
        coins: 20407
    }, {
        w0: 381,
        w1: 673,
        w2: 839,
        w3: 623,
        w4: 760,
        w5: 1306,
        w6: 1848,
        w7: 2875,
        w8: 5694,
        w9: 11262,
        cards: 3916,
        coins: 20880
    }, {
        w0: 384,
        w1: 680,
        w2: 848,
        w3: 629,
        w4: 768,
        w5: 1320,
        w6: 1872,
        w7: 2913,
        w8: 5755,
        w9: 11402,
        cards: 4005,
        coins: 21359
    }, {
        w0: 389,
        w1: 686,
        w2: 859,
        w3: 636,
        w4: 776,
        w5: 1335,
        w6: 1892,
        w7: 2950,
        w8: 5823,
        w9: 11529,
        cards: 4095,
        coins: 21843
    }, {
        w0: 395,
        w1: 695,
        w2: 868,
        w3: 645,
        w4: 785,
        w5: 1346,
        w6: 1916,
        w7: 2984,
        w8: 5888,
        w9: 11671,
        cards: 4186,
        coins: 22333
    }, {
        w0: 398,
        w1: 703,
        w2: 877,
        w3: 650,
        w4: 793,
        w5: 1364,
        w6: 1944,
        w7: 3020,
        w8: 5953,
        w9: 11800,
        cards: 4278,
        coins: 22828
    }, {
        w0: 403,
        w1: 710,
        w2: 888,
        w3: 658,
        w4: 802,
        w5: 1381,
        w6: 1971,
        w7: 3049,
        w8: 6020,
        w9: 11935,
        cards: 4371,
        coins: 23329
    }, {
        w0: 408,
        w1: 718,
        w2: 899,
        w3: 663,
        w4: 810,
        w5: 1398,
        w6: 1992,
        w7: 3084,
        w8: 6081,
        w9: 12059,
        cards: 4465,
        coins: 23835
    }, {
        w0: 414,
        w1: 725,
        w2: 908,
        w3: 670,
        w4: 820,
        w5: 1417,
        w6: 2014,
        w7: 3122,
        w8: 6147,
        w9: 12188,
        cards: 4560,
        coins: 24347
    }, {
        w0: 418,
        w1: 734,
        w2: 916,
        w3: 677,
        w4: 828,
        w5: 1428,
        w6: 2037,
        w7: 3159,
        w8: 6214,
        w9: 12315,
        cards: 4656,
        coins: 24864
    }, {
        w0: 422,
        w1: 740,
        w2: 926,
        w3: 684,
        w4: 837,
        w5: 1441,
        w6: 2064,
        w7: 3190,
        w8: 6284,
        w9: 12445,
        cards: 4753,
        coins: 25387
    }, {
        w0: 426,
        w1: 747,
        w2: 937,
        w3: 690,
        w4: 845,
        w5: 1454,
        w6: 2090,
        w7: 3220,
        w8: 6348,
        w9: 12576,
        cards: 4851,
        coins: 25915
    }, {
        w0: 431,
        w1: 755,
        w2: 946,
        w3: 695,
        w4: 855,
        w5: 1471,
        w6: 2113,
        w7: 3249,
        w8: 6417,
        w9: 12718,
        cards: 4950,
        coins: 26449
    }, {
        w0: 435,
        w1: 761,
        w2: 956,
        w3: 704,
        w4: 865,
        w5: 1491,
        w6: 2134,
        w7: 3284,
        w8: 6483,
        w9: 12844,
        cards: 5050,
        coins: 26988
    }, {
        w0: 438,
        w1: 768,
        w2: 967,
        w3: 712,
        w4: 872,
        w5: 1506,
        w6: 2151,
        w7: 3320,
        w8: 6554,
        w9: 12982,
        cards: 5151,
        coins: 27533
    }, {
        w0: 442,
        w1: 774,
        w2: 976,
        w3: 721,
        w4: 882,
        w5: 1517,
        w6: 2176,
        w7: 3350,
        w8: 6614,
        w9: 13125,
        cards: 5253,
        coins: 28083
    }, {
        w0: 448,
        w1: 783,
        w2: 987,
        w3: 728,
        w4: 890,
        w5: 1537,
        w6: 2195,
        w7: 3385,
        w8: 6680,
        w9: 13248,
        cards: 5356,
        coins: 28639
    }, {
        w0: 451,
        w1: 790,
        w2: 996,
        w3: 737,
        w4: 898,
        w5: 1557,
        w6: 2215,
        w7: 3422,
        w8: 6746,
        w9: 13375,
        cards: 5460,
        coins: 29200
    }, {
        w0: 455,
        w1: 796,
        w2: 1004,
        w3: 745,
        w4: 905,
        w5: 1569,
        w6: 2239,
        w7: 3457,
        w8: 6810,
        w9: 13518,
        cards: 5565,
        coins: 29767
    }, {
        w0: 460,
        w1: 805,
        w2: 1015,
        w3: 750,
        w4: 913,
        w5: 1588,
        w6: 2262,
        w7: 3495,
        w8: 6874,
        w9: 13644,
        cards: 5671,
        coins: 30339
    }, {
        w0: 465,
        w1: 813,
        w2: 1026,
        w3: 758,
        w4: 922,
        w5: 1601,
        w6: 2288,
        w7: 3532,
        w8: 6945,
        w9: 13774,
        cards: 5778,
        coins: 30917
    }, {
        w0: 469,
        w1: 821,
        w2: 1037,
        w3: 765,
        w4: 930,
        w5: 1616,
        w6: 2313,
        w7: 3562,
        w8: 7016,
        w9: 13900,
        cards: 5886,
        coins: 31500
    }, {
        w0: 472,
        w1: 829,
        w2: 1046,
        w3: 773,
        w4: 937,
        w5: 1628,
        w6: 2338,
        w7: 3598,
        w8: 7087,
        w9: 14028,
        cards: 5995,
        coins: 32089
    }, {
        w0: 476,
        w1: 836,
        w2: 1057,
        w3: 781,
        w4: 946,
        w5: 1648,
        w6: 2354,
        w7: 3629,
        w8: 7157,
        w9: 14163,
        cards: 6105,
        coins: 32683
    }, {
        w0: 482,
        w1: 844,
        w2: 1068,
        w3: 790,
        w4: 954,
        w5: 1667,
        w6: 2372,
        w7: 3665,
        w8: 7217,
        w9: 14295,
        cards: 6216,
        coins: 33283
    }, {
        w0: 487,
        w1: 853,
        w2: 1079,
        w3: 795,
        w4: 961,
        w5: 1685,
        w6: 2394,
        w7: 3698,
        w8: 7280,
        w9: 14424,
        cards: 6328,
        coins: 33888
    }, {
        w0: 492,
        w1: 859,
        w2: 1088,
        w3: 801,
        w4: 970,
        w5: 1700,
        w6: 2412,
        w7: 3729,
        w8: 7346,
        w9: 14548,
        cards: 6441,
        coins: 34499
    }, {
        w0: 495,
        w1: 867,
        w2: 1098,
        w3: 810,
        w4: 980,
        w5: 1716,
        w6: 2435,
        w7: 3766,
        w8: 7416,
        w9: 14671,
        cards: 6555,
        coins: 35115
    }, {
        w0: 498,
        w1: 876,
        w2: 1107,
        w3: 818,
        w4: 990,
        w5: 1729,
        w6: 2462,
        w7: 3799,
        w8: 7481,
        w9: 14812,
        cards: 6670,
        coins: 35737
    }, {
        w0: 503,
        w1: 883,
        w2: 1118,
        w3: 825,
        w4: 998,
        w5: 1742,
        w6: 2484,
        w7: 3835,
        w8: 7542,
        w9: 14945,
        cards: 6786,
        coins: 36364
    }, {
        w0: 506,
        w1: 891,
        w2: 1126,
        w3: 832,
        w4: 1005,
        w5: 1753,
        w6: 2505,
        w7: 3864,
        w8: 7604,
        w9: 15076,
        cards: 6903,
        coins: 36997
    }, {
        w0: 512,
        w1: 900,
        w2: 1137,
        w3: 838,
        w4: 1014,
        w5: 1767,
        w6: 2521,
        w7: 3902,
        w8: 7673,
        w9: 15201,
        cards: 7021,
        coins: 37635
    }, {
        w0: 517,
        w1: 906,
        w2: 1146,
        w3: 844,
        w4: 1022,
        w5: 1783,
        w6: 2539,
        w7: 3937,
        w8: 7742,
        w9: 15326,
        cards: 7140,
        coins: 38279
    }, {
        w0: 523,
        w1: 913,
        w2: 1157,
        w3: 850,
        w4: 1030,
        w5: 1800,
        w6: 2564,
        w7: 3972,
        w8: 7811,
        w9: 15454,
        cards: 7260,
        coins: 38928
    }, {
        w0: 528,
        w1: 920,
        w2: 1166,
        w3: 856,
        w4: 1038,
        w5: 1815,
        w6: 2585,
        w7: 4002,
        w8: 7876,
        w9: 15575,
        cards: 7381,
        coins: 39583
    }, {
        w0: 534,
        w1: 926,
        w2: 1177,
        w3: 862,
        w4: 1048,
        w5: 1829,
        w6: 2609,
        w7: 4032,
        w8: 7948,
        w9: 15698,
        cards: 7503,
        coins: 40243
    }, {
        w0: 537,
        w1: 935,
        w2: 1188,
        w3: 871,
        w4: 1056,
        w5: 1847,
        w6: 2632,
        w7: 4068,
        w8: 8019,
        w9: 15821,
        cards: 7626,
        coins: 40909
    }, {
        w0: 542,
        w1: 943,
        w2: 1198,
        w3: 878,
        w4: 1066,
        w5: 1862,
        w6: 2658,
        w7: 4098,
        w8: 8088,
        w9: 15963,
        cards: 7750,
        coins: 41580
    }, {
        w0: 547,
        w1: 952,
        w2: 1207,
        w3: 887,
        w4: 1074,
        w5: 1881,
        w6: 2680,
        w7: 4133,
        w8: 8159,
        w9: 16101,
        cards: 7875,
        coins: 42257
    }, {
        w0: 552,
        w1: 960,
        w2: 1216,
        w3: 893,
        w4: 1084,
        w5: 1896,
        w6: 2707,
        w7: 4164,
        w8: 8220,
        w9: 16227,
        cards: 8001,
        coins: 42939
    }, {
        w0: 558,
        w1: 967,
        w2: 1224,
        w3: 902,
        w4: 1092,
        w5: 1913,
        w6: 2730,
        w7: 4194,
        w8: 8290,
        w9: 16364,
        cards: 8128,
        coins: 43627
    }, {
        w0: 561,
        w1: 974,
        w2: 1234,
        w3: 910,
        w4: 1102,
        w5: 1925,
        w6: 2751,
        w7: 4227,
        w8: 8350,
        w9: 16485,
        cards: 8256,
        coins: 44320
    }, {
        w0: 567,
        w1: 982,
        w2: 1245,
        w3: 917,
        w4: 1111,
        w5: 1938,
        w6: 2773,
        w7: 4263,
        w8: 8411,
        w9: 16614,
        cards: 8385,
        coins: 45019
    }, {
        w0: 571,
        w1: 991,
        w2: 1256,
        w3: 925,
        w4: 1119,
        w5: 1956,
        w6: 2793,
        w7: 4299,
        w8: 8471,
        w9: 16755,
        cards: 8515,
        coins: 45723
    }, {
        w0: 576,
        w1: 1e3,
        w2: 1265,
        w3: 932,
        w4: 1128,
        w5: 1967,
        w6: 2818,
        w7: 4332,
        w8: 8538,
        w9: 16894,
        cards: 8646,
        coins: 46433
    }, {
        w0: 582,
        w1: 1008,
        w2: 1274,
        w3: 939,
        w4: 1135,
        w5: 1984,
        w6: 2840,
        w7: 4362,
        w8: 8608,
        w9: 17026,
        cards: 8778,
        coins: 47148
    }, {
        w0: 587,
        w1: 1015,
        w2: 1285,
        w3: 948,
        w4: 1145,
        w5: 2004,
        w6: 2864,
        w7: 4391,
        w8: 8668,
        w9: 17161,
        cards: 8911,
        coins: 47869
    }, {
        w0: 593,
        w1: 1022,
        w2: 1295,
        w3: 957,
        w4: 1155,
        w5: 2015,
        w6: 2885,
        w7: 4424,
        w8: 8731,
        w9: 17301,
        cards: 9045,
        coins: 48595
    }, {
        w0: 597,
        w1: 1030,
        w2: 1304,
        w3: 963,
        w4: 1164,
        w5: 2032,
        w6: 2913,
        w7: 4455,
        w8: 8792,
        w9: 17435,
        cards: 9180,
        coins: 49327
    }, {
        w0: 603,
        w1: 1036,
        w2: 1315,
        w3: 969,
        w4: 1172,
        w5: 2044,
        w6: 2929,
        w7: 4490,
        w8: 8856,
        w9: 17575,
        cards: 9316,
        coins: 50064
    }, {
        w0: 606,
        w1: 1043,
        w2: 1323,
        w3: 976,
        w4: 1181,
        w5: 2055,
        w6: 2950,
        w7: 4524,
        w8: 8928,
        w9: 17709,
        cards: 9453,
        coins: 50807
    }, {
        w0: 612,
        w1: 1052,
        w2: 1333,
        w3: 983,
        w4: 1189,
        w5: 2068,
        w6: 2974,
        w7: 4555,
        w8: 8998,
        w9: 17834,
        cards: 9591,
        coins: 51555
    }, {
        w0: 617,
        w1: 1058,
        w2: 1342,
        w3: 992,
        w4: 1199,
        w5: 2079,
        w6: 2992,
        w7: 4593,
        w8: 9066,
        w9: 17956,
        cards: 9730,
        coins: 52309
    }, {
        w0: 620,
        w1: 1065,
        w2: 1352,
        w3: 999,
        w4: 1208,
        w5: 2091,
        w6: 3009,
        w7: 4628,
        w8: 9133,
        w9: 18087,
        cards: 9870,
        coins: 53068
    }, {
        w0: 624,
        w1: 1071,
        w2: 1362,
        w3: 1008,
        w4: 1217,
        w5: 2110,
        w6: 3035,
        w7: 4665,
        w8: 9199,
        w9: 18217,
        cards: 10011,
        coins: 53833
    }, {
        w0: 628,
        w1: 1080,
        w2: 1371,
        w3: 1016,
        w4: 1224,
        w5: 2124,
        w6: 3056,
        w7: 4703,
        w8: 9262,
        w9: 18341,
        cards: 10153,
        coins: 54603
    }, {
        w0: 631,
        w1: 1087,
        w2: 1379,
        w3: 1022,
        w4: 1234,
        w5: 2136,
        w6: 3075,
        w7: 4740,
        w8: 9328,
        w9: 18466,
        cards: 10296,
        coins: 55379
    }, {
        w0: 635,
        w1: 1093,
        w2: 1389,
        w3: 1030,
        w4: 1242,
        w5: 2152,
        w6: 3098,
        w7: 4771,
        w8: 9392,
        w9: 18603,
        cards: 10440,
        coins: 56160
    }, {
        w0: 639,
        w1: 1101,
        w2: 1399,
        w3: 1035,
        w4: 1251,
        w5: 2167,
        w6: 3124,
        w7: 4803,
        w8: 9463,
        w9: 18744,
        cards: 10585,
        coins: 56947
    }, {
        w0: 642,
        w1: 1110,
        w2: 1410,
        w3: 1042,
        w4: 1261,
        w5: 2178,
        w6: 3141,
        w7: 4832,
        w8: 9529,
        w9: 18882,
        cards: 10731,
        coins: 57739
    }, {
        w0: 647,
        w1: 1119,
        w2: 1421,
        w3: 1047,
        w4: 1269,
        w5: 2197,
        w6: 3160,
        w7: 4864,
        w8: 9592,
        w9: 19023,
        cards: 10878,
        coins: 58537
    }, {
        w0: 652,
        w1: 1125,
        w2: 1431,
        w3: 1053,
        w4: 1278,
        w5: 2214,
        w6: 3182,
        w7: 4894,
        w8: 9656,
        w9: 19163,
        cards: 11026,
        coins: 59340
    }, {
        w0: 657,
        w1: 1133,
        w2: 1441,
        w3: 1058,
        w4: 1287,
        w5: 2231,
        w6: 3207,
        w7: 4931,
        w8: 9724,
        w9: 19293,
        cards: 11175,
        coins: 60149
    }, {
        w0: 660,
        w1: 1141,
        w2: 1451,
        w3: 1067,
        w4: 1297,
        w5: 2244,
        w6: 3233,
        w7: 4961,
        w8: 9791,
        w9: 19426,
        cards: 11325,
        coins: 60963
    }, {
        w0: 664,
        w1: 1150,
        w2: 1461,
        w3: 1073,
        w4: 1307,
        w5: 2256,
        w6: 3260,
        w7: 4997,
        w8: 9852,
        w9: 19569,
        cards: 11476,
        coins: 61783
    }, {
        w0: 670,
        w1: 1156,
        w2: 1472,
        w3: 1078,
        w4: 1316,
        w5: 2267,
        w6: 3284,
        w7: 5027,
        w8: 9917,
        w9: 19702,
        cards: 11628,
        coins: 62608
    }, {
        w0: 673,
        w1: 1164,
        w2: 1483,
        w3: 1087,
        w4: 1323,
        w5: 2286,
        w6: 3302,
        w7: 5062,
        w8: 9984,
        w9: 19839,
        cards: 11781,
        coins: 63439
    }, {
        w0: 678,
        w1: 1170,
        w2: 1493,
        w3: 1093,
        w4: 1331,
        w5: 2299,
        w6: 3320,
        w7: 5092,
        w8: 10054,
        w9: 19963,
        cards: 11935,
        coins: 64275
    }, {
        w0: 681,
        w1: 1177,
        w2: 1504,
        w3: 1102,
        w4: 1339,
        w5: 2316,
        w6: 3339,
        w7: 5126,
        w8: 10126,
        w9: 20092,
        cards: 12090,
        coins: 65117
    }, {
        w0: 685,
        w1: 1184,
        w2: 1515,
        w3: 1110,
        w4: 1349,
        w5: 2328,
        w6: 3366,
        w7: 5157,
        w8: 10189,
        w9: 20221,
        cards: 12246,
        coins: 65964
    }, {
        w0: 691,
        w1: 1190,
        w2: 1525,
        w3: 1115,
        w4: 1356,
        w5: 2341,
        w6: 3383,
        w7: 5187,
        w8: 10256,
        w9: 20359,
        cards: 12403,
        coins: 66817
    }, {
        w0: 695,
        w1: 1199,
        w2: 1533,
        w3: 1121,
        w4: 1365,
        w5: 2360,
        w6: 3406,
        w7: 5218,
        w8: 10325,
        w9: 20497,
        cards: 12561,
        coins: 67675
    }, {
        w0: 701,
        w1: 1207,
        w2: 1543,
        w3: 1128,
        w4: 1375,
        w5: 2378,
        w6: 3423,
        w7: 5248,
        w8: 10395,
        w9: 20623,
        cards: 12720,
        coins: 68539
    }, {
        w0: 705,
        w1: 1214,
        w2: 1552,
        w3: 1133,
        w4: 1383,
        w5: 2393,
        w6: 3446,
        w7: 5278,
        w8: 10461,
        w9: 20764,
        cards: 12880,
        coins: 69408
    }, {
        w0: 710,
        w1: 1223,
        w2: 1563,
        w3: 1140,
        w4: 1392,
        w5: 2407,
        w6: 3473,
        w7: 5315,
        w8: 10530,
        w9: 20903,
        cards: 13041,
        coins: 70283
    }, {
        w0: 713,
        w1: 1231,
        w2: 1572,
        w3: 1145,
        w4: 1400,
        w5: 2418,
        w6: 3496,
        w7: 5349,
        w8: 10592,
        w9: 21024,
        cards: 13203,
        coins: 71163
    }, {
        w0: 718,
        w1: 1239,
        w2: 1581,
        w3: 1151,
        w4: 1408,
        w5: 2432,
        w6: 3519,
        w7: 5381,
        w8: 10663,
        w9: 21159,
        cards: 13366,
        coins: 72049
    }, {
        w0: 722,
        w1: 1245,
        w2: 1592,
        w3: 1158,
        w4: 1416,
        w5: 2449,
        w6: 3539,
        w7: 5419,
        w8: 10732,
        w9: 21292,
        cards: 13530,
        coins: 72940
    }, {
        w0: 727,
        w1: 1254,
        w2: 1601,
        w3: 1167,
        w4: 1425,
        w5: 2467,
        w6: 3562,
        w7: 5455,
        w8: 10799,
        w9: 21435,
        cards: 13695,
        coins: 73837
    }, {
        w0: 733,
        w1: 1262,
        w2: 1612,
        w3: 1175,
        w4: 1432,
        w5: 2482,
        w6: 3584,
        w7: 5488,
        w8: 10868,
        w9: 21578,
        cards: 13861,
        coins: 74739
    }, {
        w0: 736,
        w1: 1271,
        w2: 1621,
        w3: 1183,
        w4: 1440,
        w5: 2496,
        w6: 3603,
        w7: 5523,
        w8: 10937,
        w9: 21705,
        cards: 14028,
        coins: 75647
    }, {
        w0: 741,
        w1: 1278,
        w2: 1632,
        w3: 1188,
        w4: 1448,
        w5: 2508,
        w6: 3627,
        w7: 5553,
        w8: 11009,
        w9: 21835,
        cards: 14196,
        coins: 76560
    }, {
        w0: 745,
        w1: 1286,
        w2: 1641,
        w3: 1196,
        w4: 1456,
        w5: 2523,
        w6: 3643,
        w7: 5585,
        w8: 11077,
        w9: 21962,
        cards: 14365,
        coins: 77479
    }, {
        w0: 750,
        w1: 1295,
        w2: 1650,
        w3: 1201,
        w4: 1464,
        w5: 2542,
        w6: 3662,
        w7: 5614,
        w8: 11146,
        w9: 22094,
        cards: 14535,
        coins: 78403
    }, {
        w0: 756,
        w1: 1304,
        w2: 1659,
        w3: 1208,
        w4: 1474,
        w5: 2558,
        w6: 3685,
        w7: 5647,
        w8: 11218,
        w9: 22217,
        cards: 14706,
        coins: 79333
    }, {
        w0: 759,
        w1: 1311,
        w2: 1669,
        w3: 1217,
        w4: 1482,
        w5: 2569,
        w6: 3711,
        w7: 5685,
        w8: 11279,
        w9: 22344,
        cards: 14878,
        coins: 80268
    }, {
        w0: 765,
        w1: 1318,
        w2: 1678,
        w3: 1225,
        w4: 1489,
        w5: 2583,
        w6: 3729,
        w7: 5721,
        w8: 11340,
        w9: 22479,
        cards: 15051,
        coins: 81209
    }, {
        w0: 770,
        w1: 1324,
        w2: 1687,
        w3: 1231,
        w4: 1499,
        w5: 2595,
        w6: 3757,
        w7: 5756,
        w8: 11404,
        w9: 22617,
        cards: 15225,
        coins: 82155
    }, {
        w0: 774,
        w1: 1333,
        w2: 1697,
        w3: 1240,
        w4: 1508,
        w5: 2609,
        w6: 3783,
        w7: 5788,
        w8: 11468,
        w9: 22740,
        cards: 15400,
        coins: 83107
    }, {
        w0: 780,
        w1: 1341,
        w2: 1706,
        w3: 1247,
        w4: 1518,
        w5: 2629,
        w6: 3799,
        w7: 5820,
        w8: 11530,
        w9: 22864,
        cards: 15576,
        coins: 84064
    }, {
        w0: 783,
        w1: 1350,
        w2: 1716,
        w3: 1255,
        w4: 1526,
        w5: 2647,
        w6: 3819,
        w7: 5858,
        w8: 11591,
        w9: 22999,
        cards: 15753,
        coins: 85027
    }, {
        w0: 789,
        w1: 1356,
        w2: 1726,
        w3: 1261,
        w4: 1533,
        w5: 2666,
        w6: 3840,
        w7: 5887,
        w8: 11652,
        w9: 23122,
        cards: 15931,
        coins: 85995
    }, {
        w0: 794,
        w1: 1363,
        w2: 1736,
        w3: 1266,
        w4: 1543,
        w5: 2686,
        w6: 3860,
        w7: 5924,
        w8: 11716,
        w9: 23265,
        cards: 16110,
        coins: 86969
    }, {
        w0: 800,
        w1: 1372,
        w2: 1745,
        w3: 1272,
        w4: 1551,
        w5: 2702,
        w6: 3882,
        w7: 5957,
        w8: 11785,
        w9: 23386,
        cards: 16290,
        coins: 87948
    }, {
        w0: 804,
        w1: 1378,
        w2: 1755,
        w3: 1279,
        w4: 1560,
        w5: 2716,
        w6: 3909,
        w7: 5994,
        w8: 11850,
        w9: 23521,
        cards: 16471,
        coins: 88933
    }, {
        w0: 810,
        w1: 1386,
        w2: 1764,
        w3: 1288,
        w4: 1569,
        w5: 2735,
        w6: 3933,
        w7: 6028,
        w8: 11922,
        w9: 23645,
        cards: 16653,
        coins: 89923
    }, {
        w0: 813,
        w1: 1395,
        w2: 1774,
        w3: 1295,
        w4: 1577,
        w5: 2746,
        w6: 3958,
        w7: 6061,
        w8: 11992,
        w9: 23773,
        cards: 16836,
        coins: 90919
    }, {
        w0: 818,
        w1: 1403,
        w2: 1784,
        w3: 1301,
        w4: 1585,
        w5: 2759,
        w6: 3978,
        w7: 6095,
        w8: 12060,
        w9: 23905,
        cards: 17020,
        coins: 91920
    }, {
        w0: 824,
        w1: 1409,
        w2: 1793,
        w3: 1309,
        w4: 1594,
        w5: 2771,
        w6: 4003,
        w7: 6128,
        w8: 12125,
        w9: 24042,
        cards: 17205,
        coins: 92927
    }, {
        w0: 827,
        w1: 1416,
        w2: 1803,
        w3: 1317,
        w4: 1603,
        w5: 2790,
        w6: 4030,
        w7: 6160,
        w8: 12186,
        w9: 24184,
        cards: 17391,
        coins: 93939
    }, {
        w0: 833,
        w1: 1422,
        w2: 1813,
        w3: 1324,
        w4: 1610,
        w5: 2806,
        w6: 4055,
        w7: 6197,
        w8: 12257,
        w9: 24319,
        cards: 17578,
        coins: 94957
    }, {
        w0: 837,
        w1: 1429,
        w2: 1823,
        w3: 1332,
        w4: 1619,
        w5: 2822,
        w6: 4080,
        w7: 6235,
        w8: 12322,
        w9: 24449,
        cards: 17766,
        coins: 95980
    }, {
        w0: 842,
        w1: 1436,
        w2: 1834,
        w3: 1340,
        w4: 1629,
        w5: 2836,
        w6: 4100,
        w7: 6272,
        w8: 12393,
        w9: 24580,
        cards: 17955,
        coins: 97009
    }, {
        w0: 846,
        w1: 1444,
        w2: 1844,
        w3: 1345,
        w4: 1638,
        w5: 2851,
        w6: 4127,
        w7: 6303,
        w8: 12453,
        w9: 24706,
        cards: 18145,
        coins: 98043
    }, {
        w0: 851,
        w1: 1451,
        w2: 1852,
        w3: 1354,
        w4: 1646,
        w5: 2870,
        w6: 4154,
        w7: 6336,
        w8: 12514,
        w9: 24835,
        cards: 18336,
        coins: 99083
    }, {
        w0: 856,
        w1: 1460,
        w2: 1863,
        w3: 1361,
        w4: 1654,
        w5: 2886,
        w6: 4179,
        w7: 6372,
        w8: 12574,
        w9: 24965,
        cards: 18528,
        coins: 100128
    }, {
        w0: 861,
        w1: 1467,
        w2: 1874,
        w3: 1366,
        w4: 1663,
        w5: 2903,
        w6: 4199,
        w7: 6406,
        w8: 12643,
        w9: 25108,
        cards: 18721,
        coins: 101179
    }, {
        w0: 867,
        w1: 1475,
        w2: 1884,
        w3: 1375,
        w4: 1673,
        w5: 2917,
        w6: 4226,
        w7: 6436,
        w8: 12707,
        w9: 25232,
        cards: 18915,
        coins: 102235
    }, {
        w0: 872,
        w1: 1482,
        w2: 1893,
        w3: 1384,
        w4: 1683,
        w5: 2937,
        w6: 4243,
        w7: 6466,
        w8: 12770,
        w9: 25367,
        cards: 19110,
        coins: 103297
    }, {
        w0: 878,
        w1: 1489,
        w2: 1904,
        w3: 1389,
        w4: 1693,
        w5: 2952,
        w6: 4261,
        w7: 6498,
        w8: 12833,
        w9: 25507,
        cards: 19306,
        coins: 104364
    }, {
        w0: 882,
        w1: 1496,
        w2: 1914,
        w3: 1398,
        w4: 1701,
        w5: 2968,
        w6: 4283,
        w7: 6530,
        w8: 12899,
        w9: 25630,
        cards: 19503,
        coins: 105437
    }, {
        w0: 888,
        w1: 1503,
        w2: 1923,
        w3: 1404,
        w4: 1709,
        w5: 2987,
        w6: 4310,
        w7: 6559,
        w8: 12959,
        w9: 25771,
        cards: 19701,
        coins: 106515
    }, {
        w0: 892,
        w1: 1511,
        w2: 1932,
        w3: 1410,
        w4: 1719,
        w5: 3006,
        w6: 4337,
        w7: 6597,
        w8: 13028,
        w9: 25898,
        cards: 19900,
        coins: 107599
    }, {
        w0: 898,
        w1: 1520,
        w2: 1943,
        w3: 1419,
        w4: 1727,
        w5: 3025,
        w6: 4358,
        w7: 6628,
        w8: 13098,
        w9: 26033,
        cards: 20100,
        coins: 108688
    }, {
        w0: 901,
        w1: 1527,
        w2: 1953,
        w3: 1427,
        w4: 1736,
        w5: 3044,
        w6: 4376,
        w7: 6665,
        w8: 13159,
        w9: 26167,
        cards: 20301,
        coins: 109783
    }, {
        w0: 905,
        w1: 1533,
        w2: 1961,
        w3: 1432,
        w4: 1745,
        w5: 3055,
        w6: 4403,
        w7: 6697,
        w8: 13229,
        w9: 26297,
        cards: 20503,
        coins: 110883
    } ],
    "3": [ {
        w0: 4,
        w1: 8,
        w2: 12,
        w3: 8,
        w4: 11,
        w5: 13,
        w6: 19,
        w7: 36,
        w8: 76,
        w9: 155,
        cards: 1,
        coins: 0
    }, {
        w0: 10,
        w1: 18,
        w2: 22,
        w3: 16,
        w4: 22,
        w5: 26,
        w6: 40,
        w7: 68,
        w8: 151,
        w9: 288,
        cards: 10,
        coins: 300
    }, {
        w0: 16,
        w1: 25,
        w2: 32,
        w3: 23,
        w4: 30,
        w5: 41,
        w6: 59,
        w7: 103,
        w8: 224,
        w9: 437,
        cards: 15,
        coins: 318
    }, {
        w0: 22,
        w1: 34,
        w2: 44,
        w3: 32,
        w4: 38,
        w5: 58,
        w6: 83,
        w7: 140,
        w8: 293,
        w9: 575,
        cards: 21,
        coins: 342
    }, {
        w0: 25,
        w1: 42,
        w2: 56,
        w3: 41,
        w4: 47,
        w5: 72,
        w6: 113,
        w7: 174,
        w8: 366,
        w9: 715,
        cards: 28,
        coins: 372
    }, {
        w0: 31,
        w1: 49,
        w2: 66,
        w3: 48,
        w4: 58,
        w5: 89,
        w6: 143,
        w7: 214,
        w8: 439,
        w9: 866,
        cards: 36,
        coins: 408
    }, {
        w0: 36,
        w1: 59,
        w2: 77,
        w3: 58,
        w4: 66,
        w5: 102,
        w6: 166,
        w7: 247,
        w8: 506,
        w9: 1003,
        cards: 45,
        coins: 450
    }, {
        w0: 40,
        w1: 67,
        w2: 86,
        w3: 67,
        w4: 76,
        w5: 118,
        w6: 184,
        w7: 281,
        w8: 580,
        w9: 1142,
        cards: 55,
        coins: 498
    }, {
        w0: 46,
        w1: 74,
        w2: 98,
        w3: 74,
        w4: 86,
        w5: 134,
        w6: 204,
        w7: 317,
        w8: 652,
        w9: 1274,
        cards: 66,
        coins: 552
    }, {
        w0: 52,
        w1: 84,
        w2: 109,
        w3: 84,
        w4: 95,
        w5: 148,
        w6: 233,
        w7: 355,
        w8: 728,
        w9: 1408,
        cards: 78,
        coins: 612
    }, {
        w0: 58,
        w1: 92,
        w2: 119,
        w3: 90,
        w4: 106,
        w5: 169,
        w6: 254,
        w7: 395,
        w8: 803,
        w9: 1555,
        cards: 91,
        coins: 678
    }, {
        w0: 61,
        w1: 102,
        w2: 131,
        w3: 97,
        w4: 115,
        w5: 187,
        w6: 277,
        w7: 434,
        w8: 880,
        w9: 1705,
        cards: 105,
        coins: 750
    }, {
        w0: 67,
        w1: 112,
        w2: 140,
        w3: 103,
        w4: 126,
        w5: 199,
        w6: 300,
        w7: 475,
        w8: 948,
        w9: 1858,
        cards: 120,
        coins: 828
    }, {
        w0: 72,
        w1: 119,
        w2: 150,
        w3: 112,
        w4: 137,
        w5: 220,
        w6: 325,
        w7: 514,
        w8: 1019,
        w9: 1997,
        cards: 136,
        coins: 912
    }, {
        w0: 77,
        w1: 126,
        w2: 160,
        w3: 119,
        w4: 145,
        w5: 233,
        w6: 352,
        w7: 552,
        w8: 1094,
        w9: 2147,
        cards: 153,
        coins: 1002
    }, {
        w0: 83,
        w1: 134,
        w2: 169,
        w3: 125,
        w4: 155,
        w5: 248,
        w6: 382,
        w7: 586,
        w8: 1165,
        w9: 2280,
        cards: 171,
        coins: 1098
    }, {
        w0: 86,
        w1: 143,
        w2: 180,
        w3: 134,
        w4: 164,
        w5: 265,
        w6: 404,
        w7: 624,
        w8: 1243,
        w9: 2435,
        cards: 190,
        coins: 1200
    }, {
        w0: 92,
        w1: 150,
        w2: 191,
        w3: 144,
        w4: 175,
        w5: 278,
        w6: 430,
        w7: 658,
        w8: 1320,
        w9: 2568,
        cards: 210,
        coins: 1308
    }, {
        w0: 97,
        w1: 160,
        w2: 202,
        w3: 150,
        w4: 184,
        w5: 295,
        w6: 448,
        w7: 698,
        w8: 1386,
        w9: 2724,
        cards: 231,
        coins: 1422
    }, {
        w0: 101,
        w1: 169,
        w2: 212,
        w3: 157,
        w4: 193,
        w5: 308,
        w6: 472,
        w7: 738,
        w8: 1456,
        w9: 2873,
        cards: 253,
        coins: 1542
    }, {
        w0: 106,
        w1: 176,
        w2: 222,
        w3: 163,
        w4: 203,
        w5: 324,
        w6: 491,
        w7: 774,
        w8: 1525,
        w9: 3023,
        cards: 276,
        coins: 1668
    }, {
        w0: 109,
        w1: 185,
        w2: 233,
        w3: 172,
        w4: 214,
        w5: 341,
        w6: 509,
        w7: 812,
        w8: 1602,
        w9: 3178,
        cards: 300,
        coins: 1800
    }, {
        w0: 115,
        w1: 194,
        w2: 242,
        w3: 178,
        w4: 224,
        w5: 362,
        w6: 528,
        w7: 853,
        w8: 1676,
        w9: 3323,
        cards: 325,
        coins: 1938
    }, {
        w0: 119,
        w1: 204,
        w2: 253,
        w3: 184,
        w4: 235,
        w5: 380,
        w6: 552,
        w7: 894,
        w8: 1742,
        w9: 3457,
        cards: 351,
        coins: 2082
    }, {
        w0: 125,
        w1: 214,
        w2: 264,
        w3: 190,
        w4: 244,
        w5: 398,
        w6: 580,
        w7: 935,
        w8: 1818,
        w9: 3613,
        cards: 378,
        coins: 2232
    }, {
        w0: 128,
        w1: 222,
        w2: 274,
        w3: 196,
        w4: 252,
        w5: 418,
        w6: 607,
        w7: 976,
        w8: 1896,
        w9: 3760,
        cards: 406,
        coins: 2388
    }, {
        w0: 134,
        w1: 230,
        w2: 286,
        w3: 205,
        w4: 262,
        w5: 437,
        w6: 626,
        w7: 1013,
        w8: 1972,
        w9: 3906,
        cards: 435,
        coins: 2550
    }, {
        w0: 139,
        w1: 238,
        w2: 296,
        w3: 214,
        w4: 271,
        w5: 455,
        w6: 653,
        w7: 1045,
        w8: 2040,
        w9: 4055,
        cards: 465,
        coins: 2718
    }, {
        w0: 145,
        w1: 245,
        w2: 306,
        w3: 223,
        w4: 281,
        w5: 468,
        w6: 679,
        w7: 1081,
        w8: 2106,
        w9: 4189,
        cards: 496,
        coins: 2892
    }, {
        w0: 149,
        w1: 253,
        w2: 316,
        w3: 230,
        w4: 289,
        w5: 480,
        w6: 707,
        w7: 1121,
        w8: 2184,
        w9: 4344,
        cards: 528,
        coins: 3072
    }, {
        w0: 155,
        w1: 262,
        w2: 325,
        w3: 236,
        w4: 300,
        w5: 493,
        w6: 728,
        w7: 1156,
        w8: 2255,
        w9: 4494,
        cards: 561,
        coins: 3258
    }, {
        w0: 160,
        w1: 271,
        w2: 337,
        w3: 245,
        w4: 310,
        w5: 511,
        w6: 751,
        w7: 1194,
        w8: 2324,
        w9: 4646,
        cards: 595,
        coins: 3450
    }, {
        w0: 164,
        w1: 281,
        w2: 349,
        w3: 253,
        w4: 320,
        w5: 524,
        w6: 780,
        w7: 1232,
        w8: 2394,
        w9: 4787,
        cards: 630,
        coins: 3648
    }, {
        w0: 169,
        w1: 290,
        w2: 359,
        w3: 262,
        w4: 329,
        w5: 536,
        w6: 803,
        w7: 1267,
        w8: 2467,
        w9: 4927,
        cards: 666,
        coins: 3852
    }, {
        w0: 175,
        w1: 300,
        w2: 368,
        w3: 271,
        w4: 337,
        w5: 550,
        w6: 833,
        w7: 1304,
        w8: 2542,
        w9: 5082,
        cards: 703,
        coins: 4062
    }, {
        w0: 181,
        w1: 308,
        w2: 380,
        w3: 281,
        w4: 346,
        w5: 565,
        w6: 857,
        w7: 1345,
        w8: 2612,
        w9: 5232,
        cards: 741,
        coins: 4278
    }, {
        w0: 185,
        w1: 316,
        w2: 392,
        w3: 289,
        w4: 354,
        w5: 587,
        w6: 877,
        w7: 1382,
        w8: 2690,
        w9: 5384,
        cards: 780,
        coins: 4500
    }, {
        w0: 190,
        w1: 325,
        w2: 403,
        w3: 295,
        w4: 365,
        w5: 601,
        w6: 898,
        w7: 1421,
        w8: 2764,
        w9: 5532,
        cards: 820,
        coins: 4728
    }, {
        w0: 193,
        w1: 335,
        w2: 413,
        w3: 302,
        w4: 374,
        w5: 623,
        w6: 918,
        w7: 1457,
        w8: 2839,
        w9: 5666,
        cards: 861,
        coins: 4962
    }, {
        w0: 198,
        w1: 342,
        w2: 425,
        w3: 308,
        w4: 384,
        w5: 636,
        w6: 936,
        w7: 1498,
        w8: 2911,
        w9: 5813,
        cards: 903,
        coins: 5202
    }, {
        w0: 204,
        w1: 349,
        w2: 434,
        w3: 316,
        w4: 394,
        w5: 649,
        w6: 961,
        w7: 1537,
        w8: 2984,
        w9: 5963,
        cards: 946,
        coins: 5448
    }, {
        w0: 208,
        w1: 358,
        w2: 444,
        w3: 325,
        w4: 404,
        w5: 661,
        w6: 984,
        w7: 1573,
        w8: 3053,
        w9: 6100,
        cards: 990,
        coins: 5700
    }, {
        w0: 211,
        w1: 367,
        w2: 454,
        w3: 334,
        w4: 414,
        w5: 674,
        w6: 1012,
        w7: 1610,
        w8: 3119,
        w9: 6238,
        cards: 1035,
        coins: 5958
    }, {
        w0: 217,
        w1: 374,
        w2: 463,
        w3: 340,
        w4: 424,
        w5: 692,
        w6: 1032,
        w7: 1648,
        w8: 3197,
        w9: 6380,
        cards: 1081,
        coins: 6222
    }, {
        w0: 223,
        w1: 384,
        w2: 474,
        w3: 346,
        w4: 434,
        w5: 709,
        w6: 1056,
        w7: 1681,
        w8: 3272,
        w9: 6535,
        cards: 1128,
        coins: 6492
    }, {
        w0: 229,
        w1: 392,
        w2: 486,
        w3: 354,
        w4: 444,
        w5: 731,
        w6: 1086,
        w7: 1722,
        w8: 3350,
        w9: 6682,
        cards: 1176,
        coins: 6768
    }, {
        w0: 235,
        w1: 400,
        w2: 498,
        w3: 362,
        w4: 455,
        w5: 746,
        w6: 1109,
        w7: 1756,
        w8: 3416,
        w9: 6828,
        cards: 1225,
        coins: 7050
    }, {
        w0: 239,
        w1: 408,
        w2: 510,
        w3: 370,
        w4: 466,
        w5: 766,
        w6: 1134,
        w7: 1790,
        w8: 3490,
        w9: 6979,
        cards: 1275,
        coins: 7338
    }, {
        w0: 244,
        w1: 418,
        w2: 520,
        w3: 377,
        w4: 476,
        w5: 786,
        w6: 1162,
        w7: 1826,
        w8: 3556,
        w9: 7118,
        cards: 1326,
        coins: 7632
    }, {
        w0: 250,
        w1: 425,
        w2: 530,
        w3: 384,
        w4: 487,
        w5: 803,
        w6: 1190,
        w7: 1861,
        w8: 3625,
        w9: 7272,
        cards: 1378,
        coins: 7932
    }, {
        w0: 256,
        w1: 434,
        w2: 542,
        w3: 391,
        w4: 498,
        w5: 821,
        w6: 1218,
        w7: 1901,
        w8: 3698,
        w9: 7411,
        cards: 1431,
        coins: 8238
    }, {
        w0: 262,
        w1: 442,
        w2: 554,
        w3: 401,
        w4: 509,
        w5: 835,
        w6: 1241,
        w7: 1939,
        w8: 3772,
        w9: 7567,
        cards: 1485,
        coins: 8550
    }, {
        w0: 265,
        w1: 450,
        w2: 565,
        w3: 407,
        w4: 520,
        w5: 857,
        w6: 1261,
        w7: 1976,
        w8: 3842,
        w9: 7708,
        cards: 1540,
        coins: 8868
    }, {
        w0: 269,
        w1: 460,
        w2: 575,
        w3: 415,
        w4: 530,
        w5: 877,
        w6: 1282,
        w7: 2012,
        w8: 3918,
        w9: 7847,
        cards: 1596,
        coins: 9192
    }, {
        w0: 274,
        w1: 469,
        w2: 584,
        w3: 424,
        w4: 540,
        w5: 896,
        w6: 1306,
        w7: 2048,
        w8: 3988,
        w9: 7993,
        cards: 1653,
        coins: 9522
    }, {
        w0: 277,
        w1: 478,
        w2: 596,
        w3: 431,
        w4: 548,
        w5: 912,
        w6: 1325,
        w7: 2082,
        w8: 4060,
        w9: 8148,
        cards: 1711,
        coins: 9858
    }, {
        w0: 281,
        w1: 485,
        w2: 608,
        w3: 439,
        w4: 557,
        w5: 932,
        w6: 1352,
        w7: 2118,
        w8: 4133,
        w9: 8303,
        cards: 1770,
        coins: 10200
    }, {
        w0: 284,
        w1: 492,
        w2: 618,
        w3: 448,
        w4: 566,
        w5: 946,
        w6: 1370,
        w7: 2152,
        w8: 4201,
        w9: 8452,
        cards: 1830,
        coins: 10548
    }, {
        w0: 288,
        w1: 500,
        w2: 629,
        w3: 455,
        w4: 577,
        w5: 965,
        w6: 1388,
        w7: 2192,
        w8: 4276,
        w9: 8591,
        cards: 1891,
        coins: 10902
    }, {
        w0: 292,
        w1: 508,
        w2: 638,
        w3: 461,
        w4: 587,
        w5: 986,
        w6: 1414,
        w7: 2225,
        w8: 4343,
        w9: 8740,
        cards: 1953,
        coins: 11262
    }, {
        w0: 295,
        w1: 517,
        w2: 648,
        w3: 468,
        w4: 598,
        w5: 1001,
        w6: 1434,
        w7: 2263,
        w8: 4414,
        w9: 8888,
        cards: 2016,
        coins: 11628
    }, {
        w0: 300,
        w1: 524,
        w2: 659,
        w3: 478,
        w4: 608,
        w5: 1020,
        w6: 1452,
        w7: 2302,
        w8: 4481,
        w9: 9025,
        cards: 2080,
        coins: 12e3
    }, {
        w0: 306,
        w1: 533,
        w2: 670,
        w3: 486,
        w4: 617,
        w5: 1042,
        w6: 1471,
        w7: 2334,
        w8: 4555,
        w9: 9158,
        cards: 2145,
        coins: 12378
    }, {
        w0: 312,
        w1: 540,
        w2: 682,
        w3: 493,
        w4: 625,
        w5: 1058,
        w6: 1498,
        w7: 2368,
        w8: 4626,
        w9: 9312,
        cards: 2211,
        coins: 12762
    }, {
        w0: 316,
        w1: 547,
        w2: 691,
        w3: 499,
        w4: 636,
        w5: 1075,
        w6: 1519,
        w7: 2402,
        w8: 4694,
        w9: 9466,
        cards: 2278,
        coins: 13152
    }, {
        w0: 319,
        w1: 554,
        w2: 703,
        w3: 508,
        w4: 644,
        w5: 1088,
        w6: 1537,
        w7: 2440,
        w8: 4766,
        w9: 9616,
        cards: 2346,
        coins: 13548
    }, {
        w0: 324,
        w1: 564,
        w2: 715,
        w3: 515,
        w4: 655,
        w5: 1102,
        w6: 1561,
        w7: 2479,
        w8: 4840,
        w9: 9768,
        cards: 2415,
        coins: 13950
    }, {
        w0: 329,
        w1: 571,
        w2: 727,
        w3: 523,
        w4: 666,
        w5: 1116,
        w6: 1580,
        w7: 2515,
        w8: 4912,
        w9: 9914,
        cards: 2485,
        coins: 14358
    }, {
        w0: 335,
        w1: 580,
        w2: 738,
        w3: 533,
        w4: 674,
        w5: 1129,
        w6: 1610,
        w7: 2550,
        w8: 4982,
        w9: 10063,
        cards: 2556,
        coins: 14772
    }, {
        w0: 340,
        w1: 588,
        w2: 750,
        w3: 542,
        w4: 684,
        w5: 1142,
        w6: 1638,
        w7: 2588,
        w8: 5056,
        w9: 10212,
        cards: 2628,
        coins: 15192
    }, {
        w0: 344,
        w1: 595,
        w2: 762,
        w3: 552,
        w4: 694,
        w5: 1154,
        w6: 1656,
        w7: 2627,
        w8: 5130,
        w9: 10358,
        cards: 2701,
        coins: 15618
    }, {
        w0: 348,
        w1: 605,
        w2: 774,
        w3: 559,
        w4: 702,
        w5: 1175,
        w6: 1684,
        w7: 2668,
        w8: 5207,
        w9: 10492,
        cards: 2775,
        coins: 16050
    }, {
        w0: 354,
        w1: 613,
        w2: 786,
        w3: 566,
        w4: 710,
        w5: 1190,
        w6: 1711,
        w7: 2704,
        w8: 5284,
        w9: 10625,
        cards: 2850,
        coins: 16488
    }, {
        w0: 360,
        w1: 623,
        w2: 797,
        w3: 574,
        w4: 721,
        w5: 1205,
        w6: 1734,
        w7: 2744,
        w8: 5358,
        w9: 10774,
        cards: 2926,
        coins: 16932
    }, {
        w0: 366,
        w1: 630,
        w2: 808,
        w3: 580,
        w4: 731,
        w5: 1217,
        w6: 1763,
        w7: 2785,
        w8: 5430,
        w9: 10915,
        cards: 3003,
        coins: 17382
    }, {
        w0: 370,
        w1: 640,
        w2: 817,
        w3: 588,
        w4: 739,
        w5: 1235,
        w6: 1792,
        w7: 2819,
        w8: 5507,
        w9: 11054,
        cards: 3081,
        coins: 17838
    }, {
        w0: 376,
        w1: 647,
        w2: 829,
        w3: 594,
        w4: 748,
        w5: 1252,
        w6: 1820,
        w7: 2860,
        w8: 5575,
        w9: 11188,
        cards: 3160,
        coins: 18300
    }, {
        w0: 382,
        w1: 656,
        w2: 840,
        w3: 601,
        w4: 756,
        w5: 1273,
        w6: 1848,
        w7: 2896,
        w8: 5646,
        w9: 11335,
        cards: 3240,
        coins: 18768
    }, {
        w0: 385,
        w1: 666,
        w2: 850,
        w3: 611,
        w4: 767,
        w5: 1291,
        w6: 1867,
        w7: 2928,
        w8: 5724,
        w9: 11478,
        cards: 3321,
        coins: 19242
    }, {
        w0: 390,
        w1: 673,
        w2: 859,
        w3: 617,
        w4: 775,
        w5: 1309,
        w6: 1894,
        w7: 2966,
        w8: 5791,
        w9: 11633,
        cards: 3403,
        coins: 19722
    }, {
        w0: 395,
        w1: 683,
        w2: 869,
        w3: 624,
        w4: 785,
        w5: 1331,
        w6: 1919,
        w7: 3001,
        w8: 5866,
        w9: 11768,
        cards: 3486,
        coins: 20208
    }, {
        w0: 401,
        w1: 691,
        w2: 880,
        w3: 634,
        w4: 796,
        w5: 1343,
        w6: 1942,
        w7: 3035,
        w8: 5941,
        w9: 11911,
        cards: 3570,
        coins: 20700
    }, {
        w0: 406,
        w1: 700,
        w2: 892,
        w3: 643,
        w4: 805,
        w5: 1362,
        w6: 1972,
        w7: 3071,
        w8: 6016,
        w9: 12067,
        cards: 3655,
        coins: 21198
    }, {
        w0: 410,
        w1: 708,
        w2: 901,
        w3: 650,
        w4: 816,
        w5: 1375,
        w6: 1994,
        w7: 3107,
        w8: 6086,
        w9: 12218,
        cards: 3741,
        coins: 21702
    }, {
        w0: 414,
        w1: 718,
        w2: 911,
        w3: 658,
        w4: 824,
        w5: 1388,
        w6: 2014,
        w7: 3143,
        w8: 6152,
        w9: 12355,
        cards: 3828,
        coins: 22212
    }, {
        w0: 419,
        w1: 727,
        w2: 923,
        w3: 665,
        w4: 834,
        w5: 1406,
        w6: 2038,
        w7: 3176,
        w8: 6226,
        w9: 12499,
        cards: 3916,
        coins: 22728
    }, {
        w0: 424,
        w1: 734,
        w2: 934,
        w3: 674,
        w4: 844,
        w5: 1424,
        w6: 2068,
        w7: 3214,
        w8: 6301,
        w9: 12650,
        cards: 4005,
        coins: 23250
    }, {
        w0: 428,
        w1: 743,
        w2: 946,
        w3: 680,
        w4: 853,
        w5: 1440,
        w6: 2089,
        w7: 3253,
        w8: 6378,
        w9: 12806,
        cards: 4095,
        coins: 23778
    }, {
        w0: 432,
        w1: 750,
        w2: 956,
        w3: 686,
        w4: 863,
        w5: 1458,
        w6: 2119,
        w7: 3286,
        w8: 6444,
        w9: 12958,
        cards: 4186,
        coins: 24312
    }, {
        w0: 437,
        w1: 757,
        w2: 968,
        w3: 696,
        w4: 872,
        w5: 1480,
        w6: 2149,
        w7: 3319,
        w8: 6511,
        w9: 13099,
        cards: 4278,
        coins: 24852
    }, {
        w0: 443,
        w1: 766,
        w2: 979,
        w3: 706,
        w4: 882,
        w5: 1498,
        w6: 2171,
        w7: 3354,
        w8: 6588,
        w9: 13247,
        cards: 4371,
        coins: 25398
    }, {
        w0: 448,
        w1: 773,
        w2: 989,
        w3: 713,
        w4: 893,
        w5: 1513,
        w6: 2197,
        w7: 3395,
        w8: 6660,
        w9: 13397,
        cards: 4465,
        coins: 25950
    }, {
        w0: 451,
        w1: 781,
        w2: 1e3,
        w3: 720,
        w4: 902,
        w5: 1528,
        w6: 2227,
        w7: 3431,
        w8: 6728,
        w9: 13553,
        cards: 4560,
        coins: 26508
    }, {
        w0: 455,
        w1: 788,
        w2: 1009,
        w3: 727,
        w4: 913,
        w5: 1541,
        w6: 2249,
        w7: 3469,
        w8: 6796,
        w9: 13694,
        cards: 4656,
        coins: 27072
    }, {
        w0: 460,
        w1: 796,
        w2: 1019,
        w3: 734,
        w4: 922,
        w5: 1554,
        w6: 2269,
        w7: 3504,
        w8: 6866,
        w9: 13846,
        cards: 4753,
        coins: 27642
    }, {
        w0: 463,
        w1: 804,
        w2: 1030,
        w3: 743,
        w4: 931,
        w5: 1576,
        w6: 2290,
        w7: 3545,
        w8: 6934,
        w9: 13993,
        cards: 4851,
        coins: 28218
    }, {
        w0: 467,
        w1: 811,
        w2: 1042,
        w3: 750,
        w4: 940,
        w5: 1588,
        w6: 2311,
        w7: 3577,
        w8: 7008,
        w9: 14141,
        cards: 4950,
        coins: 28800
    }, {
        w0: 473,
        w1: 818,
        w2: 1054,
        w3: 757,
        w4: 950,
        w5: 1603,
        w6: 2335,
        w7: 3612,
        w8: 7085,
        w9: 14280,
        cards: 5050,
        coins: 29388
    }, {
        w0: 479,
        w1: 828,
        w2: 1063,
        w3: 767,
        w4: 959,
        w5: 1616,
        w6: 2365,
        w7: 3653,
        w8: 7156,
        w9: 14417,
        cards: 5151,
        coins: 29982
    }, {
        w0: 485,
        w1: 835,
        w2: 1075,
        w3: 774,
        w4: 967,
        w5: 1631,
        w6: 2387,
        w7: 3692,
        w8: 7225,
        w9: 14564,
        cards: 5253,
        coins: 30582
    }, {
        w0: 488,
        w1: 842,
        w2: 1087,
        w3: 782,
        w4: 976,
        w5: 1650,
        w6: 2410,
        w7: 3727,
        w8: 7303,
        w9: 14707,
        cards: 5356,
        coins: 31188
    }, {
        w0: 494,
        w1: 851,
        w2: 1097,
        w3: 790,
        w4: 986,
        w5: 1670,
        w6: 2434,
        w7: 3766,
        w8: 7381,
        w9: 14849,
        cards: 5460,
        coins: 31800
    }, {
        w0: 499,
        w1: 860,
        w2: 1108,
        w3: 796,
        w4: 996,
        w5: 1691,
        w6: 2458,
        w7: 3798,
        w8: 7448,
        w9: 14996,
        cards: 5565,
        coins: 32418
    }, {
        w0: 505,
        w1: 869,
        w2: 1118,
        w3: 805,
        w4: 1006,
        w5: 1709,
        w6: 2486,
        w7: 3832,
        w8: 7526,
        w9: 15138,
        cards: 5671,
        coins: 33042
    }, {
        w0: 510,
        w1: 878,
        w2: 1128,
        w3: 815,
        w4: 1016,
        w5: 1729,
        w6: 2508,
        w7: 3871,
        w8: 7592,
        w9: 15289,
        cards: 5778,
        coins: 33672
    }, {
        w0: 516,
        w1: 886,
        w2: 1138,
        w3: 821,
        w4: 1026,
        w5: 1747,
        w6: 2530,
        w7: 3906,
        w8: 7661,
        w9: 15422,
        cards: 5886,
        coins: 34308
    }, {
        w0: 521,
        w1: 895,
        w2: 1148,
        w3: 829,
        w4: 1036,
        w5: 1762,
        w6: 2551,
        w7: 3938,
        w8: 7727,
        w9: 15568,
        cards: 5995,
        coins: 34950
    }, {
        w0: 524,
        w1: 904,
        w2: 1159,
        w3: 839,
        w4: 1045,
        w5: 1781,
        w6: 2578,
        w7: 3973,
        w8: 7801,
        w9: 15721,
        cards: 6105,
        coins: 35598
    }, {
        w0: 528,
        w1: 911,
        w2: 1169,
        w3: 847,
        w4: 1055,
        w5: 1802,
        w6: 2598,
        w7: 4010,
        w8: 7876,
        w9: 15859,
        cards: 6216,
        coins: 36252
    }, {
        w0: 534,
        w1: 918,
        w2: 1180,
        w3: 857,
        w4: 1063,
        w5: 1814,
        w6: 2627,
        w7: 4048,
        w8: 7945,
        w9: 16003,
        cards: 6328,
        coins: 36912
    }, {
        w0: 540,
        w1: 928,
        w2: 1192,
        w3: 866,
        w4: 1072,
        w5: 1830,
        w6: 2650,
        w7: 4085,
        w8: 8015,
        w9: 16151,
        cards: 6441,
        coins: 37578
    }, {
        w0: 544,
        w1: 935,
        w2: 1204,
        w3: 872,
        w4: 1080,
        w5: 1844,
        w6: 2669,
        w7: 4126,
        w8: 8093,
        w9: 16306,
        cards: 6555,
        coins: 38250
    }, {
        w0: 548,
        w1: 942,
        w2: 1213,
        w3: 882,
        w4: 1088,
        w5: 1856,
        w6: 2687,
        w7: 4166,
        w8: 8170,
        w9: 16452,
        cards: 6670,
        coins: 38928
    }, {
        w0: 554,
        w1: 950,
        w2: 1225,
        w3: 892,
        w4: 1098,
        w5: 1872,
        w6: 2707,
        w7: 4207,
        w8: 8237,
        w9: 16585,
        cards: 6786,
        coins: 39612
    }, {
        w0: 560,
        w1: 960,
        w2: 1237,
        w3: 900,
        w4: 1108,
        w5: 1884,
        w6: 2734,
        w7: 4247,
        w8: 8304,
        w9: 16734,
        cards: 6903,
        coins: 40302
    }, {
        w0: 564,
        w1: 970,
        w2: 1249,
        w3: 908,
        w4: 1116,
        w5: 1906,
        w6: 2764,
        w7: 4280,
        w8: 8377,
        w9: 16879,
        cards: 7021,
        coins: 40998
    }, {
        w0: 570,
        w1: 978,
        w2: 1259,
        w3: 917,
        w4: 1127,
        w5: 1919,
        w6: 2789,
        w7: 4318,
        w8: 8447,
        w9: 17018,
        cards: 7140,
        coins: 41700
    }, {
        w0: 575,
        w1: 985,
        w2: 1270,
        w3: 925,
        w4: 1135,
        w5: 1939,
        w6: 2808,
        w7: 4354,
        w8: 8515,
        w9: 17153,
        cards: 7260,
        coins: 42408
    }, {
        w0: 578,
        w1: 994,
        w2: 1280,
        w3: 932,
        w4: 1145,
        w5: 1952,
        w6: 2830,
        w7: 4388,
        w8: 8591,
        w9: 17308,
        cards: 7381,
        coins: 43122
    }, {
        w0: 584,
        w1: 1002,
        w2: 1290,
        w3: 938,
        w4: 1153,
        w5: 1964,
        w6: 2852,
        w7: 4423,
        w8: 8660,
        w9: 17440,
        cards: 7503,
        coins: 43842
    }, {
        w0: 588,
        w1: 1012,
        w2: 1302,
        w3: 946,
        w4: 1163,
        w5: 1976,
        w6: 2874,
        w7: 4459,
        w8: 8734,
        w9: 17584,
        cards: 7626,
        coins: 44568
    }, {
        w0: 594,
        w1: 1020,
        w2: 1312,
        w3: 952,
        w4: 1171,
        w5: 1991,
        w6: 2897,
        w7: 4498,
        w8: 8802,
        w9: 17724,
        cards: 7750,
        coins: 45300
    }, {
        w0: 599,
        w1: 1028,
        w2: 1321,
        w3: 960,
        w4: 1181,
        w5: 2008,
        w6: 2922,
        w7: 4531,
        w8: 8879,
        w9: 17856,
        cards: 7875,
        coins: 46038
    }, {
        w0: 605,
        w1: 1037,
        w2: 1332,
        w3: 968,
        w4: 1189,
        w5: 2022,
        w6: 2941,
        w7: 4568,
        w8: 8948,
        w9: 18012,
        cards: 8001,
        coins: 46782
    }, {
        w0: 608,
        w1: 1045,
        w2: 1342,
        w3: 977,
        w4: 1199,
        w5: 2038,
        w6: 2963,
        w7: 4609,
        w8: 9022,
        w9: 18164,
        cards: 8128,
        coins: 47532
    }, {
        w0: 613,
        w1: 1054,
        w2: 1352,
        w3: 984,
        w4: 1207,
        w5: 2056,
        w6: 2986,
        w7: 4650,
        w8: 9098,
        w9: 18320,
        cards: 8256,
        coins: 48288
    }, {
        w0: 618,
        w1: 1062,
        w2: 1364,
        w3: 991,
        w4: 1217,
        w5: 2076,
        w6: 3012,
        w7: 4685,
        w8: 9176,
        w9: 18452,
        cards: 8385,
        coins: 49050
    }, {
        w0: 624,
        w1: 1070,
        w2: 1375,
        w3: 1e3,
        w4: 1225,
        w5: 2095,
        w6: 3034,
        w7: 4717,
        w8: 9244,
        w9: 18604,
        cards: 8515,
        coins: 49818
    }, {
        w0: 628,
        w1: 1080,
        w2: 1385,
        w3: 1006,
        w4: 1235,
        w5: 2114,
        w6: 3052,
        w7: 4750,
        w8: 9311,
        w9: 18754,
        cards: 8646,
        coins: 50592
    }, {
        w0: 634,
        w1: 1087,
        w2: 1394,
        w3: 1013,
        w4: 1246,
        w5: 2129,
        w6: 3079,
        w7: 4783,
        w8: 9384,
        w9: 18887,
        cards: 8778,
        coins: 51372
    }, {
        w0: 638,
        w1: 1097,
        w2: 1404,
        w3: 1020,
        w4: 1256,
        w5: 2143,
        w6: 3104,
        w7: 4822,
        w8: 9455,
        w9: 19024,
        cards: 8911,
        coins: 52158
    }, {
        w0: 643,
        w1: 1104,
        w2: 1415,
        w3: 1026,
        w4: 1267,
        w5: 2165,
        w6: 3127,
        w7: 4854,
        w8: 9528,
        w9: 19168,
        cards: 9045,
        coins: 52950
    }, {
        w0: 649,
        w1: 1114,
        w2: 1427,
        w3: 1036,
        w4: 1276,
        w5: 2177,
        w6: 3155,
        w7: 4891,
        w8: 9605,
        w9: 19314,
        cards: 9180,
        coins: 53748
    }, {
        w0: 653,
        w1: 1123,
        w2: 1439,
        w3: 1043,
        w4: 1284,
        w5: 2197,
        w6: 3175,
        w7: 4931,
        w8: 9679,
        w9: 19456,
        cards: 9316,
        coins: 54552
    }, {
        w0: 659,
        w1: 1133,
        w2: 1450,
        w3: 1052,
        w4: 1295,
        w5: 2212,
        w6: 3194,
        w7: 4970,
        w8: 9755,
        w9: 19592,
        cards: 9453,
        coins: 55362
    }, {
        w0: 664,
        w1: 1142,
        w2: 1459,
        w3: 1062,
        w4: 1304,
        w5: 2226,
        w6: 3222,
        w7: 5009,
        w8: 9823,
        w9: 19736,
        cards: 9591,
        coins: 56178
    }, {
        w0: 668,
        w1: 1151,
        w2: 1469,
        w3: 1072,
        w4: 1315,
        w5: 2242,
        w6: 3245,
        w7: 5048,
        w8: 9890,
        w9: 19874,
        cards: 9730,
        coins: 57e3
    }, {
        w0: 673,
        w1: 1160,
        w2: 1480,
        w3: 1081,
        w4: 1325,
        w5: 2254,
        w6: 3268,
        w7: 5082,
        w8: 9966,
        w9: 20018,
        cards: 9870,
        coins: 57828
    }, {
        w0: 679,
        w1: 1170,
        w2: 1490,
        w3: 1091,
        w4: 1333,
        w5: 2274,
        w6: 3290,
        w7: 5117,
        w8: 10036,
        w9: 20173,
        cards: 10011,
        coins: 58662
    }, {
        w0: 684,
        w1: 1177,
        w2: 1500,
        w3: 1099,
        w4: 1344,
        w5: 2291,
        w6: 3319,
        w7: 5155,
        w8: 10110,
        w9: 20312,
        cards: 10153,
        coins: 59502
    }, {
        w0: 688,
        w1: 1187,
        w2: 1510,
        w3: 1105,
        w4: 1355,
        w5: 2303,
        w6: 3337,
        w7: 5196,
        w8: 10178,
        w9: 20468,
        cards: 10296,
        coins: 60348
    }, {
        w0: 692,
        w1: 1196,
        w2: 1520,
        w3: 1112,
        w4: 1366,
        w5: 2316,
        w6: 3355,
        w7: 5232,
        w8: 10246,
        w9: 20606,
        cards: 10440,
        coins: 61200
    }, {
        w0: 697,
        w1: 1206,
        w2: 1532,
        w3: 1120,
        w4: 1376,
        w5: 2333,
        w6: 3376,
        w7: 5272,
        w8: 10312,
        w9: 20744,
        cards: 10585,
        coins: 62058
    }, {
        w0: 701,
        w1: 1216,
        w2: 1544,
        w3: 1126,
        w4: 1385,
        w5: 2345,
        w6: 3398,
        w7: 5311,
        w8: 10381,
        w9: 20882,
        cards: 10731,
        coins: 62922
    }, {
        w0: 706,
        w1: 1224,
        w2: 1554,
        w3: 1135,
        w4: 1393,
        w5: 2360,
        w6: 3419,
        w7: 5352,
        w8: 10448,
        w9: 21026,
        cards: 10878,
        coins: 63792
    }, {
        w0: 712,
        w1: 1231,
        w2: 1564,
        w3: 1144,
        w4: 1402,
        w5: 2376,
        w6: 3446,
        w7: 5384,
        w8: 10523,
        w9: 21170,
        cards: 11026,
        coins: 64668
    }, {
        w0: 718,
        w1: 1240,
        w2: 1573,
        w3: 1153,
        w4: 1412,
        w5: 2395,
        w6: 3466,
        w7: 5422,
        w8: 10590,
        w9: 21312,
        cards: 11175,
        coins: 65550
    }, {
        w0: 721,
        w1: 1248,
        w2: 1583,
        w3: 1162,
        w4: 1422,
        w5: 2413,
        w6: 3486,
        w7: 5460,
        w8: 10657,
        w9: 21458,
        cards: 11325,
        coins: 66438
    }, {
        w0: 727,
        w1: 1258,
        w2: 1595,
        w3: 1169,
        w4: 1432,
        w5: 2426,
        w6: 3510,
        w7: 5494,
        w8: 10728,
        w9: 21598,
        cards: 11476,
        coins: 67332
    }, {
        w0: 731,
        w1: 1265,
        w2: 1604,
        w3: 1176,
        w4: 1440,
        w5: 2447,
        w6: 3532,
        w7: 5533,
        w8: 10806,
        w9: 21745,
        cards: 11628,
        coins: 68232
    }, {
        w0: 734,
        w1: 1272,
        w2: 1615,
        w3: 1183,
        w4: 1451,
        w5: 2464,
        w6: 3562,
        w7: 5572,
        w8: 10880,
        w9: 21899,
        cards: 11781,
        coins: 69138
    }, {
        w0: 739,
        w1: 1282,
        w2: 1627,
        w3: 1192,
        w4: 1460,
        w5: 2483,
        w6: 3586,
        w7: 5611,
        w8: 10956,
        w9: 22033,
        cards: 11935,
        coins: 70050
    }, {
        w0: 745,
        w1: 1290,
        w2: 1637,
        w3: 1199,
        w4: 1470,
        w5: 2500,
        w6: 3616,
        w7: 5650,
        w8: 11027,
        w9: 22172,
        cards: 12090,
        coins: 70968
    }, {
        w0: 751,
        w1: 1297,
        w2: 1648,
        w3: 1205,
        w4: 1478,
        w5: 2519,
        w6: 3643,
        w7: 5688,
        w8: 11098,
        w9: 22325,
        cards: 12246,
        coins: 71892
    }, {
        w0: 756,
        w1: 1304,
        w2: 1660,
        w3: 1212,
        w4: 1488,
        w5: 2536,
        w6: 3672,
        w7: 5728,
        w8: 11172,
        w9: 22478,
        cards: 12403,
        coins: 72822
    }, {
        w0: 760,
        w1: 1312,
        w2: 1670,
        w3: 1219,
        w4: 1498,
        w5: 2554,
        w6: 3698,
        w7: 5767,
        w8: 11250,
        w9: 22624,
        cards: 12561,
        coins: 73758
    }, {
        w0: 764,
        w1: 1319,
        w2: 1682,
        w3: 1228,
        w4: 1506,
        w5: 2575,
        w6: 3728,
        w7: 5807,
        w8: 11324,
        w9: 22765,
        cards: 12720,
        coins: 74700
    }, {
        w0: 769,
        w1: 1326,
        w2: 1693,
        w3: 1237,
        w4: 1517,
        w5: 2591,
        w6: 3750,
        w7: 5844,
        w8: 11390,
        w9: 22900,
        cards: 12880,
        coins: 75648
    }, {
        w0: 773,
        w1: 1334,
        w2: 1704,
        w3: 1244,
        w4: 1525,
        w5: 2612,
        w6: 3773,
        w7: 5884,
        w8: 11460,
        w9: 23047,
        cards: 13041,
        coins: 76602
    }, {
        w0: 776,
        w1: 1343,
        w2: 1714,
        w3: 1253,
        w4: 1534,
        w5: 2629,
        w6: 3802,
        w7: 5920,
        w8: 11530,
        w9: 23194,
        cards: 13203,
        coins: 77562
    }, {
        w0: 781,
        w1: 1352,
        w2: 1723,
        w3: 1261,
        w4: 1542,
        w5: 2651,
        w6: 3822,
        w7: 5952,
        w8: 11605,
        w9: 23326,
        cards: 13366,
        coins: 78528
    }, {
        w0: 787,
        w1: 1361,
        w2: 1735,
        w3: 1268,
        w4: 1553,
        w5: 2664,
        w6: 3844,
        w7: 5986,
        w8: 11678,
        w9: 23476,
        cards: 13530,
        coins: 79500
    }, {
        w0: 791,
        w1: 1368,
        w2: 1745,
        w3: 1274,
        w4: 1562,
        w5: 2680,
        w6: 3864,
        w7: 6025,
        w8: 11748,
        w9: 23610,
        cards: 13695,
        coins: 80478
    }, {
        w0: 794,
        w1: 1376,
        w2: 1756,
        w3: 1280,
        w4: 1572,
        w5: 2692,
        w6: 3884,
        w7: 6064,
        w8: 11824,
        w9: 23754,
        cards: 13861,
        coins: 81462
    }, {
        w0: 798,
        w1: 1384,
        w2: 1765,
        w3: 1289,
        w4: 1580,
        w5: 2713,
        w6: 3910,
        w7: 6101,
        w8: 11900,
        w9: 23892,
        cards: 14028,
        coins: 82452
    }, {
        w0: 803,
        w1: 1391,
        w2: 1776,
        w3: 1295,
        w4: 1590,
        w5: 2728,
        w6: 3940,
        w7: 6140,
        w8: 11972,
        w9: 24037,
        cards: 14196,
        coins: 83448
    }, {
        w0: 808,
        w1: 1399,
        w2: 1788,
        w3: 1302,
        w4: 1601,
        w5: 2746,
        w6: 3965,
        w7: 6178,
        w8: 12050,
        w9: 24172,
        cards: 14365,
        coins: 84450
    }, {
        w0: 811,
        w1: 1408,
        w2: 1798,
        w3: 1310,
        w4: 1612,
        w5: 2764,
        w6: 3995,
        w7: 6216,
        w8: 12126,
        w9: 24316,
        cards: 14535,
        coins: 85458
    }, {
        w0: 816,
        w1: 1416,
        w2: 1808,
        w3: 1316,
        w4: 1622,
        w5: 2784,
        w6: 4018,
        w7: 6257,
        w8: 12200,
        w9: 24448,
        cards: 14706,
        coins: 86472
    }, {
        w0: 822,
        w1: 1424,
        w2: 1819,
        w3: 1325,
        w4: 1632,
        w5: 2801,
        w6: 4038,
        w7: 6296,
        w8: 12274,
        w9: 24599,
        cards: 14878,
        coins: 87492
    }, {
        w0: 826,
        w1: 1432,
        w2: 1831,
        w3: 1334,
        w4: 1640,
        w5: 2821,
        w6: 4057,
        w7: 6331,
        w8: 12350,
        w9: 24751,
        cards: 15051,
        coins: 88518
    }, {
        w0: 832,
        w1: 1441,
        w2: 1842,
        w3: 1340,
        w4: 1649,
        w5: 2836,
        w6: 4087,
        w7: 6372,
        w8: 12425,
        w9: 24888,
        cards: 15225,
        coins: 89550
    }, {
        w0: 835,
        w1: 1448,
        w2: 1852,
        w3: 1348,
        w4: 1658,
        w5: 2850,
        w6: 4117,
        w7: 6410,
        w8: 12492,
        w9: 25027,
        cards: 15400,
        coins: 90588
    }, {
        w0: 841,
        w1: 1456,
        w2: 1862,
        w3: 1355,
        w4: 1667,
        w5: 2872,
        w6: 4138,
        w7: 6443,
        w8: 12559,
        w9: 25181,
        cards: 15576,
        coins: 91632
    }, {
        w0: 847,
        w1: 1463,
        w2: 1872,
        w3: 1361,
        w4: 1675,
        w5: 2893,
        w6: 4156,
        w7: 6480,
        w8: 12629,
        w9: 25326,
        cards: 15753,
        coins: 92682
    }, {
        w0: 851,
        w1: 1471,
        w2: 1884,
        w3: 1370,
        w4: 1686,
        w5: 2911,
        w6: 4177,
        w7: 6514,
        w8: 12706,
        w9: 25482,
        cards: 15931,
        coins: 93738
    }, {
        w0: 856,
        w1: 1480,
        w2: 1896,
        w3: 1380,
        w4: 1694,
        w5: 2930,
        w6: 4202,
        w7: 6550,
        w8: 12781,
        w9: 25632,
        cards: 16110,
        coins: 94800
    }, {
        w0: 860,
        w1: 1487,
        w2: 1908,
        w3: 1388,
        w4: 1705,
        w5: 2948,
        w6: 4224,
        w7: 6589,
        w8: 12851,
        w9: 25771,
        cards: 16290,
        coins: 95868
    }, {
        w0: 865,
        w1: 1495,
        w2: 1919,
        w3: 1398,
        w4: 1715,
        w5: 2966,
        w6: 4247,
        w7: 6623,
        w8: 12923,
        w9: 25919,
        cards: 16471,
        coins: 96942
    }, {
        w0: 871,
        w1: 1504,
        w2: 1931,
        w3: 1408,
        w4: 1726,
        w5: 2988,
        w6: 4270,
        w7: 6661,
        w8: 12997,
        w9: 26069,
        cards: 16653,
        coins: 98022
    }, {
        w0: 876,
        w1: 1512,
        w2: 1940,
        w3: 1416,
        w4: 1735,
        w5: 3002,
        w6: 4295,
        w7: 6701,
        w8: 13075,
        w9: 26221,
        cards: 16836,
        coins: 99108
    }, {
        w0: 882,
        w1: 1520,
        w2: 1952,
        w3: 1422,
        w4: 1745,
        w5: 3024,
        w6: 4313,
        w7: 6736,
        w8: 13141,
        w9: 26374,
        cards: 17020,
        coins: 100200
    }, {
        w0: 887,
        w1: 1529,
        w2: 1962,
        w3: 1432,
        w4: 1753,
        w5: 3041,
        w6: 4343,
        w7: 6776,
        w8: 13207,
        w9: 26510,
        cards: 17205,
        coins: 101298
    }, {
        w0: 890,
        w1: 1537,
        w2: 1972,
        w3: 1440,
        w4: 1764,
        w5: 3061,
        w6: 4366,
        w7: 6811,
        w8: 13277,
        w9: 26647,
        cards: 17391,
        coins: 102402
    }, {
        w0: 894,
        w1: 1546,
        w2: 1984,
        w3: 1447,
        w4: 1774,
        w5: 3076,
        w6: 4396,
        w7: 6848,
        w8: 13355,
        w9: 26784,
        cards: 17578,
        coins: 103512
    }, {
        w0: 900,
        w1: 1553,
        w2: 1993,
        w3: 1453,
        w4: 1783,
        w5: 3091,
        w6: 4415,
        w7: 6888,
        w8: 13426,
        w9: 26939,
        cards: 17766,
        coins: 104628
    }, {
        w0: 905,
        w1: 1561,
        w2: 2005,
        w3: 1460,
        w4: 1793,
        w5: 3103,
        w6: 4445,
        w7: 6928,
        w8: 13499,
        w9: 27072,
        cards: 17955,
        coins: 105750
    }, {
        w0: 911,
        w1: 1570,
        w2: 2016,
        w3: 1469,
        w4: 1802,
        w5: 3122,
        w6: 4465,
        w7: 6960,
        w8: 13572,
        w9: 27228,
        cards: 18145,
        coins: 106878
    }, {
        w0: 914,
        w1: 1579,
        w2: 2027,
        w3: 1478,
        w4: 1812,
        w5: 3137,
        w6: 4493,
        w7: 6992,
        w8: 13648,
        w9: 27361,
        cards: 18336,
        coins: 108012
    }, {
        w0: 919,
        w1: 1588,
        w2: 2038,
        w3: 1487,
        w4: 1823,
        w5: 3158,
        w6: 4519,
        w7: 7026,
        w8: 13724,
        w9: 27499,
        cards: 18528,
        coins: 109152
    }, {
        w0: 924,
        w1: 1596,
        w2: 2047,
        w3: 1496,
        w4: 1832,
        w5: 3178,
        w6: 4537,
        w7: 7066,
        w8: 13799,
        w9: 27642,
        cards: 18721,
        coins: 110298
    }, {
        w0: 929,
        w1: 1606,
        w2: 2057,
        w3: 1502,
        w4: 1842,
        w5: 3190,
        w6: 4560,
        w7: 7099,
        w8: 13866,
        w9: 27776,
        cards: 18915,
        coins: 111450
    }, {
        w0: 934,
        w1: 1613,
        w2: 2066,
        w3: 1508,
        w4: 1853,
        w5: 3211,
        w6: 4579,
        w7: 7135,
        w8: 13936,
        w9: 27925,
        cards: 19110,
        coins: 112608
    }, {
        w0: 937,
        w1: 1621,
        w2: 2078,
        w3: 1518,
        w4: 1864,
        w5: 3230,
        w6: 4608,
        w7: 7176,
        w8: 14010,
        w9: 28073,
        cards: 19306,
        coins: 113772
    }, {
        w0: 941,
        w1: 1630,
        w2: 2090,
        w3: 1528,
        w4: 1873,
        w5: 3242,
        w6: 4633,
        w7: 7217,
        w8: 14081,
        w9: 28210,
        cards: 19503,
        coins: 114942
    }, {
        w0: 944,
        w1: 1639,
        w2: 2101,
        w3: 1536,
        w4: 1882,
        w5: 3256,
        w6: 4661,
        w7: 7255,
        w8: 14156,
        w9: 28344,
        cards: 19701,
        coins: 116118
    }, {
        w0: 949,
        w1: 1649,
        w2: 2113,
        w3: 1546,
        w4: 1890,
        w5: 3271,
        w6: 4684,
        w7: 7288,
        w8: 14227,
        w9: 28498,
        cards: 19900,
        coins: 117300
    }, {
        w0: 955,
        w1: 1658,
        w2: 2125,
        w3: 1555,
        w4: 1898,
        w5: 3289,
        w6: 4703,
        w7: 7325,
        w8: 14302,
        w9: 28639,
        cards: 20100,
        coins: 118488
    }, {
        w0: 959,
        w1: 1668,
        w2: 2135,
        w3: 1565,
        w4: 1907,
        w5: 3307,
        w6: 4729,
        w7: 7362,
        w8: 14369,
        w9: 28795,
        cards: 20301,
        coins: 119682
    }, {
        w0: 964,
        w1: 1676,
        w2: 2147,
        w3: 1573,
        w4: 1918,
        w5: 3326,
        w6: 4754,
        w7: 7403,
        w8: 14443,
        w9: 28950,
        cards: 20503,
        coins: 120882
    } ],
    "4": [ {
        w0: 7,
        w1: 10,
        w2: 13,
        w3: 7,
        w4: 12,
        w5: 14,
        w6: 33,
        w7: 43,
        w8: 74,
        w9: 143,
        cards: 1,
        coins: 0
    }, {
        w0: 13,
        w1: 18,
        w2: 25,
        w3: 14,
        w4: 21,
        w5: 29,
        w6: 52,
        w7: 87,
        w8: 152,
        w9: 298,
        cards: 10,
        coins: 300
    }, {
        w0: 17,
        w1: 29,
        w2: 35,
        w3: 23,
        w4: 31,
        w5: 44,
        w6: 82,
        w7: 124,
        w8: 224,
        w9: 442,
        cards: 15,
        coins: 320
    }, {
        w0: 23,
        w1: 36,
        w2: 47,
        w3: 34,
        w4: 42,
        w5: 57,
        w6: 111,
        w7: 168,
        w8: 296,
        w9: 603,
        cards: 21,
        coins: 346
    }, {
        w0: 27,
        w1: 46,
        w2: 60,
        w3: 44,
        w4: 51,
        w5: 79,
        w6: 142,
        w7: 204,
        w8: 369,
        w9: 754,
        cards: 28,
        coins: 379
    }, {
        w0: 34,
        w1: 53,
        w2: 72,
        w3: 53,
        w4: 61,
        w5: 92,
        w6: 174,
        w7: 247,
        w8: 447,
        w9: 902,
        cards: 36,
        coins: 418
    }, {
        w0: 38,
        w1: 62,
        w2: 85,
        w3: 61,
        w4: 73,
        w5: 114,
        w6: 198,
        w7: 290,
        w8: 523,
        w9: 1067,
        cards: 45,
        coins: 464
    }, {
        w0: 43,
        w1: 73,
        w2: 98,
        w3: 69,
        w4: 85,
        w5: 135,
        w6: 224,
        w7: 334,
        w8: 595,
        w9: 1213,
        cards: 55,
        coins: 516
    }, {
        w0: 48,
        w1: 81,
        w2: 111,
        w3: 79,
        w4: 96,
        w5: 157,
        w6: 251,
        w7: 371,
        w8: 680,
        w9: 1381,
        cards: 66,
        coins: 575
    }, {
        w0: 55,
        w1: 91,
        w2: 124,
        w3: 87,
        w4: 105,
        w5: 172,
        w6: 280,
        w7: 412,
        w8: 764,
        w9: 1544,
        cards: 78,
        coins: 640
    }, {
        w0: 60,
        w1: 100,
        w2: 134,
        w3: 98,
        w4: 116,
        w5: 190,
        w6: 311,
        w7: 451,
        w8: 845,
        w9: 1690,
        cards: 91,
        coins: 712
    }, {
        w0: 64,
        w1: 109,
        w2: 147,
        w3: 108,
        w4: 125,
        w5: 203,
        w6: 330,
        w7: 490,
        w8: 919,
        w9: 1833,
        cards: 105,
        coins: 790
    }, {
        w0: 68,
        w1: 120,
        w2: 159,
        w3: 116,
        w4: 135,
        w5: 225,
        w6: 363,
        w7: 532,
        w8: 991,
        w9: 2002,
        cards: 120,
        coins: 875
    }, {
        w0: 73,
        w1: 130,
        w2: 170,
        w3: 125,
        w4: 146,
        w5: 238,
        w6: 385,
        w7: 575,
        w8: 1069,
        w9: 2159,
        cards: 136,
        coins: 966
    }, {
        w0: 78,
        w1: 139,
        w2: 183,
        w3: 134,
        w4: 156,
        w5: 260,
        w6: 404,
        w7: 610,
        w8: 1149,
        w9: 2302,
        cards: 153,
        coins: 1064
    }, {
        w0: 82,
        w1: 150,
        w2: 196,
        w3: 143,
        w4: 166,
        w5: 274,
        w6: 434,
        w7: 646,
        w8: 1225,
        w9: 2471,
        cards: 171,
        coins: 1168
    }, {
        w0: 86,
        w1: 157,
        w2: 208,
        w3: 152,
        w4: 177,
        w5: 294,
        w6: 465,
        w7: 686,
        w8: 1300,
        w9: 2629,
        cards: 190,
        coins: 1279
    }, {
        w0: 90,
        w1: 166,
        w2: 218,
        w3: 161,
        w4: 186,
        w5: 313,
        w6: 497,
        w7: 729,
        w8: 1381,
        w9: 2795,
        cards: 210,
        coins: 1396
    }, {
        w0: 94,
        w1: 174,
        w2: 230,
        w3: 170,
        w4: 198,
        w5: 332,
        w6: 528,
        w7: 767,
        w8: 1461,
        w9: 2938,
        cards: 231,
        coins: 1520
    }, {
        w0: 99,
        w1: 185,
        w2: 242,
        w3: 179,
        w4: 209,
        w5: 354,
        w6: 551,
        w7: 807,
        w8: 1534,
        w9: 3095,
        cards: 253,
        coins: 1650
    }, {
        w0: 104,
        w1: 195,
        w2: 252,
        w3: 190,
        w4: 218,
        w5: 369,
        w6: 571,
        w7: 848,
        w8: 1611,
        w9: 3247,
        cards: 276,
        coins: 1787
    }, {
        w0: 111,
        w1: 204,
        w2: 265,
        w3: 196,
        w4: 230,
        w5: 384,
        w6: 601,
        w7: 888,
        w8: 1687,
        w9: 3410,
        cards: 300,
        coins: 1930
    }, {
        w0: 117,
        w1: 215,
        w2: 276,
        w3: 205,
        w4: 239,
        w5: 406,
        w6: 629,
        w7: 926,
        w8: 1771,
        w9: 3561,
        cards: 325,
        coins: 2080
    }, {
        w0: 121,
        w1: 225,
        w2: 289,
        w3: 215,
        w4: 251,
        w5: 424,
        w6: 650,
        w7: 970,
        w8: 1843,
        w9: 3704,
        cards: 351,
        coins: 2236
    }, {
        w0: 125,
        w1: 234,
        w2: 300,
        w3: 222,
        w4: 260,
        w5: 439,
        w6: 677,
        w7: 1008,
        w8: 1923,
        w9: 3855,
        cards: 378,
        coins: 2399
    }, {
        w0: 129,
        w1: 243,
        w2: 312,
        w3: 231,
        w4: 270,
        w5: 460,
        w6: 703,
        w7: 1049,
        w8: 1994,
        w9: 3999,
        cards: 406,
        coins: 2568
    }, {
        w0: 133,
        w1: 252,
        w2: 324,
        w3: 241,
        w4: 282,
        w5: 477,
        w6: 732,
        w7: 1089,
        w8: 2067,
        w9: 4157,
        cards: 435,
        coins: 2744
    }, {
        w0: 139,
        w1: 260,
        w2: 335,
        w3: 250,
        w4: 293,
        w5: 497,
        w6: 759,
        w7: 1132,
        w8: 2139,
        w9: 4304,
        cards: 465,
        coins: 2926
    }, {
        w0: 144,
        w1: 269,
        w2: 347,
        w3: 260,
        w4: 302,
        w5: 517,
        w6: 783,
        w7: 1173,
        w8: 2211,
        w9: 4464,
        cards: 496,
        coins: 3115
    }, {
        w0: 151,
        w1: 277,
        w2: 358,
        w3: 270,
        w4: 311,
        w5: 537,
        w6: 815,
        w7: 1209,
        w8: 2285,
        w9: 4631,
        cards: 528,
        coins: 3310
    }, {
        w0: 155,
        w1: 285,
        w2: 369,
        w3: 280,
        w4: 320,
        w5: 560,
        w6: 844,
        w7: 1245,
        w8: 2362,
        w9: 4784,
        cards: 561,
        coins: 3512
    }, {
        w0: 160,
        w1: 295,
        w2: 382,
        w3: 286,
        w4: 332,
        w5: 575,
        w6: 863,
        w7: 1288,
        w8: 2443,
        w9: 4948,
        cards: 595,
        coins: 3720
    }, {
        w0: 165,
        w1: 306,
        w2: 393,
        w3: 294,
        w4: 341,
        w5: 590,
        w6: 884,
        w7: 1333,
        w8: 2522,
        w9: 5117,
        cards: 630,
        coins: 3935
    }, {
        w0: 172,
        w1: 315,
        w2: 404,
        w3: 302,
        w4: 350,
        w5: 607,
        w6: 907,
        w7: 1377,
        w8: 2607,
        w9: 5286,
        cards: 666,
        coins: 4156
    }, {
        w0: 177,
        w1: 324,
        w2: 417,
        w3: 312,
        w4: 361,
        w5: 621,
        w6: 940,
        w7: 1420,
        w8: 2687,
        w9: 5438,
        cards: 703,
        coins: 4384
    }, {
        w0: 183,
        w1: 334,
        w2: 430,
        w3: 322,
        w4: 372,
        w5: 644,
        w6: 970,
        w7: 1457,
        w8: 2765,
        w9: 5604,
        cards: 741,
        coins: 4618
    }, {
        w0: 187,
        w1: 345,
        w2: 441,
        w3: 330,
        w4: 384,
        w5: 658,
        w6: 1e3,
        w7: 1496,
        w8: 2837,
        w9: 5763,
        cards: 780,
        coins: 4859
    }, {
        w0: 191,
        w1: 352,
        w2: 452,
        w3: 339,
        w4: 394,
        w5: 673,
        w6: 1022,
        w7: 1537,
        w8: 2909,
        w9: 5906,
        cards: 820,
        coins: 5106
    }, {
        w0: 196,
        w1: 361,
        w2: 463,
        w3: 348,
        w4: 403,
        w5: 689,
        w6: 1041,
        w7: 1580,
        w8: 2984,
        w9: 6057,
        cards: 861,
        coins: 5360
    }, {
        w0: 200,
        w1: 372,
        w2: 476,
        w3: 355,
        w4: 412,
        w5: 712,
        w6: 1066,
        w7: 1622,
        w8: 3059,
        w9: 6214,
        cards: 903,
        coins: 5620
    }, {
        w0: 205,
        w1: 381,
        w2: 488,
        w3: 365,
        w4: 421,
        w5: 729,
        w6: 1096,
        w7: 1660,
        w8: 3130,
        w9: 6358,
        cards: 946,
        coins: 5887
    }, {
        w0: 209,
        w1: 390,
        w2: 501,
        w3: 374,
        w4: 430,
        w5: 753,
        w6: 1123,
        w7: 1700,
        w8: 3212,
        w9: 6526,
        cards: 990,
        coins: 6160
    }, {
        w0: 215,
        w1: 399,
        w2: 514,
        w3: 382,
        w4: 441,
        w5: 776,
        w6: 1143,
        w7: 1738,
        w8: 3292,
        w9: 6676,
        cards: 1035,
        coins: 6440
    }, {
        w0: 221,
        w1: 410,
        w2: 524,
        w3: 390,
        w4: 452,
        w5: 792,
        w6: 1170,
        w7: 1776,
        w8: 3370,
        w9: 6825,
        cards: 1081,
        coins: 6726
    }, {
        w0: 228,
        w1: 419,
        w2: 537,
        w3: 398,
        w4: 462,
        w5: 814,
        w6: 1197,
        w7: 1811,
        w8: 3441,
        w9: 6990,
        cards: 1128,
        coins: 7019
    }, {
        w0: 233,
        w1: 428,
        w2: 549,
        w3: 404,
        w4: 473,
        w5: 829,
        w6: 1226,
        w7: 1846,
        w8: 3515,
        w9: 7141,
        cards: 1176,
        coins: 7318
    }, {
        w0: 238,
        w1: 436,
        w2: 560,
        w3: 411,
        w4: 482,
        w5: 844,
        w6: 1249,
        w7: 1881,
        w8: 3588,
        w9: 7289,
        cards: 1225,
        coins: 7624
    }, {
        w0: 243,
        w1: 445,
        w2: 571,
        w3: 421,
        w4: 491,
        w5: 865,
        w6: 1281,
        w7: 1921,
        w8: 3673,
        w9: 7456,
        cards: 1275,
        coins: 7936
    }, {
        w0: 250,
        w1: 454,
        w2: 584,
        w3: 428,
        w4: 503,
        w5: 880,
        w6: 1308,
        w7: 1958,
        w8: 3754,
        w9: 7600,
        cards: 1326,
        coins: 8255
    }, {
        w0: 255,
        w1: 462,
        w2: 595,
        w3: 437,
        w4: 512,
        w5: 896,
        w6: 1329,
        w7: 1994,
        w8: 3829,
        w9: 7769,
        cards: 1378,
        coins: 8580
    }, {
        w0: 259,
        w1: 471,
        w2: 606,
        w3: 446,
        w4: 524,
        w5: 911,
        w6: 1357,
        w7: 2031,
        w8: 3904,
        w9: 7921,
        cards: 1431,
        coins: 8912
    }, {
        w0: 264,
        w1: 480,
        w2: 616,
        w3: 456,
        w4: 534,
        w5: 935,
        w6: 1386,
        w7: 2066,
        w8: 3981,
        w9: 8089,
        cards: 1485,
        coins: 9250
    }, {
        w0: 268,
        w1: 488,
        w2: 628,
        w3: 463,
        w4: 543,
        w5: 956,
        w6: 1407,
        w7: 2109,
        w8: 4060,
        w9: 8242,
        cards: 1540,
        coins: 9595
    }, {
        w0: 273,
        w1: 495,
        w2: 641,
        w3: 473,
        w4: 555,
        w5: 972,
        w6: 1435,
        w7: 2144,
        w8: 4144,
        w9: 8389,
        cards: 1596,
        coins: 9946
    }, {
        w0: 277,
        w1: 504,
        w2: 651,
        w3: 482,
        w4: 567,
        w5: 989,
        w6: 1468,
        w7: 2180,
        w8: 4229,
        w9: 8540,
        cards: 1653,
        coins: 10304
    }, {
        w0: 283,
        w1: 514,
        w2: 664,
        w3: 489,
        w4: 576,
        w5: 1011,
        w6: 1487,
        w7: 2222,
        w8: 4311,
        w9: 8700,
        cards: 1711,
        coins: 10668
    }, {
        w0: 289,
        w1: 523,
        w2: 676,
        w3: 497,
        w4: 588,
        w5: 1035,
        w6: 1516,
        w7: 2265,
        w8: 4394,
        w9: 8843,
        cards: 1770,
        coins: 11039
    }, {
        w0: 293,
        w1: 530,
        w2: 686,
        w3: 506,
        w4: 599,
        w5: 1057,
        w6: 1541,
        w7: 2300,
        w8: 4468,
        w9: 9012,
        cards: 1830,
        coins: 11416
    }, {
        w0: 298,
        w1: 538,
        w2: 698,
        w3: 516,
        w4: 611,
        w5: 1075,
        w6: 1567,
        w7: 2339,
        w8: 4540,
        w9: 9155,
        cards: 1891,
        coins: 11800
    }, {
        w0: 302,
        w1: 547,
        w2: 709,
        w3: 523,
        w4: 620,
        w5: 1095,
        w6: 1586,
        w7: 2375,
        w8: 4612,
        w9: 9315,
        cards: 1953,
        coins: 12190
    }, {
        w0: 308,
        w1: 558,
        w2: 719,
        w3: 532,
        w4: 629,
        w5: 1110,
        w6: 1617,
        w7: 2417,
        w8: 4684,
        w9: 9459,
        cards: 2016,
        coins: 12587
    }, {
        w0: 313,
        w1: 568,
        w2: 729,
        w3: 538,
        w4: 638,
        w5: 1128,
        w6: 1638,
        w7: 2457,
        w8: 4755,
        w9: 9616,
        cards: 2080,
        coins: 12990
    }, {
        w0: 317,
        w1: 576,
        w2: 740,
        w3: 549,
        w4: 647,
        w5: 1148,
        w6: 1658,
        w7: 2492,
        w8: 4835,
        w9: 9777,
        cards: 2145,
        coins: 13400
    }, {
        w0: 321,
        w1: 586,
        w2: 751,
        w3: 555,
        w4: 658,
        w5: 1167,
        w6: 1689,
        w7: 2530,
        w8: 4915,
        w9: 9922,
        cards: 2211,
        coins: 13816
    }, {
        w0: 325,
        w1: 597,
        w2: 763,
        w3: 566,
        w4: 668,
        w5: 1190,
        w6: 1711,
        w7: 2571,
        w8: 4987,
        w9: 10069,
        cards: 2278,
        coins: 14239
    }, {
        w0: 329,
        w1: 606,
        w2: 774,
        w3: 576,
        w4: 679,
        w5: 1213,
        w6: 1742,
        w7: 2614,
        w8: 5066,
        w9: 10214,
        cards: 2346,
        coins: 14668
    }, {
        w0: 335,
        w1: 615,
        w2: 784,
        w3: 585,
        w4: 689,
        w5: 1229,
        w6: 1762,
        w7: 2649,
        w8: 5151,
        w9: 10374,
        cards: 2415,
        coins: 15104
    }, {
        w0: 341,
        w1: 625,
        w2: 796,
        w3: 595,
        w4: 698,
        w5: 1243,
        w6: 1781,
        w7: 2692,
        w8: 5222,
        w9: 10522,
        cards: 2485,
        coins: 15546
    }, {
        w0: 346,
        w1: 634,
        w2: 806,
        w3: 603,
        w4: 707,
        w5: 1258,
        w6: 1802,
        w7: 2729,
        w8: 5304,
        w9: 10673,
        cards: 2556,
        coins: 15995
    }, {
        w0: 350,
        w1: 642,
        w2: 816,
        w3: 611,
        w4: 716,
        w5: 1277,
        w6: 1830,
        w7: 2773,
        w8: 5379,
        w9: 10819,
        cards: 2628,
        coins: 16450
    }, {
        w0: 355,
        w1: 651,
        w2: 829,
        w3: 621,
        w4: 728,
        w5: 1295,
        w6: 1859,
        w7: 2809,
        w8: 5464,
        w9: 10963,
        cards: 2701,
        coins: 16912
    }, {
        w0: 360,
        w1: 662,
        w2: 842,
        w3: 628,
        w4: 737,
        w5: 1308,
        w6: 1879,
        w7: 2854,
        w8: 5539,
        w9: 11111,
        cards: 2775,
        coins: 17380
    }, {
        w0: 367,
        w1: 670,
        w2: 854,
        w3: 636,
        w4: 748,
        w5: 1322,
        w6: 1911,
        w7: 2894,
        w8: 5611,
        w9: 11276,
        cards: 2850,
        coins: 17855
    }, {
        w0: 371,
        w1: 680,
        w2: 867,
        w3: 646,
        w4: 757,
        w5: 1342,
        w6: 1940,
        w7: 2934,
        w8: 5682,
        w9: 11432,
        cards: 2926,
        coins: 18336
    }, {
        w0: 377,
        w1: 688,
        w2: 879,
        w3: 654,
        w4: 766,
        w5: 1361,
        w6: 1970,
        w7: 2976,
        w8: 5764,
        w9: 11597,
        cards: 3003,
        coins: 18824
    }, {
        w0: 382,
        w1: 697,
        w2: 892,
        w3: 663,
        w4: 775,
        w5: 1382,
        w6: 1992,
        w7: 3017,
        w8: 5837,
        w9: 11762,
        cards: 3081,
        coins: 19318
    }, {
        w0: 389,
        w1: 705,
        w2: 902,
        w3: 670,
        w4: 785,
        w5: 1405,
        w6: 2015,
        w7: 3062,
        w8: 5912,
        w9: 11913,
        cards: 3160,
        coins: 19819
    }, {
        w0: 395,
        w1: 712,
        w2: 914,
        w3: 677,
        w4: 794,
        w5: 1427,
        w6: 2048,
        w7: 3099,
        w8: 5997,
        w9: 12069,
        cards: 3240,
        coins: 20326
    }, {
        w0: 400,
        w1: 720,
        w2: 924,
        w3: 686,
        w4: 806,
        w5: 1440,
        w6: 2071,
        w7: 3136,
        w8: 6071,
        w9: 12232,
        cards: 3321,
        coins: 20840
    }, {
        w0: 404,
        w1: 731,
        w2: 936,
        w3: 696,
        w4: 818,
        w5: 1460,
        w6: 2093,
        w7: 3180,
        w8: 6149,
        w9: 12379,
        cards: 3403,
        coins: 21360
    }, {
        w0: 411,
        w1: 740,
        w2: 946,
        w3: 702,
        w4: 827,
        w5: 1476,
        w6: 2126,
        w7: 3216,
        w8: 6228,
        w9: 12541,
        cards: 3486,
        coins: 21887
    }, {
        w0: 415,
        w1: 748,
        w2: 958,
        w3: 710,
        w4: 836,
        w5: 1499,
        w6: 2154,
        w7: 3259,
        w8: 6310,
        w9: 12700,
        cards: 3570,
        coins: 22420
    }, {
        w0: 421,
        w1: 758,
        w2: 971,
        w3: 716,
        w4: 845,
        w5: 1513,
        w6: 2185,
        w7: 3303,
        w8: 6395,
        w9: 12858,
        cards: 3655,
        coins: 22960
    }, {
        w0: 425,
        w1: 767,
        w2: 982,
        w3: 725,
        w4: 855,
        w5: 1531,
        w6: 2217,
        w7: 3346,
        w8: 6478,
        w9: 13001,
        cards: 3741,
        coins: 23506
    }, {
        w0: 432,
        w1: 776,
        w2: 993,
        w3: 735,
        w4: 866,
        w5: 1552,
        w6: 2244,
        w7: 3389,
        w8: 6560,
        w9: 13166,
        cards: 3828,
        coins: 24059
    }, {
        w0: 437,
        w1: 785,
        w2: 1006,
        w3: 744,
        w4: 875,
        w5: 1567,
        w6: 2266,
        w7: 3426,
        w8: 6634,
        w9: 13328,
        cards: 3916,
        coins: 24618
    }, {
        w0: 443,
        w1: 793,
        w2: 1019,
        w3: 751,
        w4: 884,
        w5: 1587,
        w6: 2291,
        w7: 3466,
        w8: 6705,
        w9: 13486,
        cards: 4005,
        coins: 25184
    }, {
        w0: 450,
        w1: 802,
        w2: 1031,
        w3: 758,
        w4: 896,
        w5: 1611,
        w6: 2310,
        w7: 3509,
        w8: 6785,
        w9: 13636,
        cards: 4095,
        coins: 25756
    }, {
        w0: 455,
        w1: 810,
        w2: 1041,
        w3: 766,
        w4: 906,
        w5: 1624,
        w6: 2341,
        w7: 3550,
        w8: 6869,
        w9: 13784,
        cards: 4186,
        coins: 26335
    }, {
        w0: 460,
        w1: 820,
        w2: 1054,
        w3: 776,
        w4: 915,
        w5: 1645,
        w6: 2371,
        w7: 3589,
        w8: 6946,
        w9: 13952,
        cards: 4278,
        coins: 26920
    }, {
        w0: 464,
        w1: 831,
        w2: 1066,
        w3: 784,
        w4: 927,
        w5: 1667,
        w6: 2396,
        w7: 3632,
        w8: 7024,
        w9: 14110,
        cards: 4371,
        coins: 27512
    }, {
        w0: 471,
        w1: 839,
        w2: 1079,
        w3: 792,
        w4: 937,
        w5: 1687,
        w6: 2425,
        w7: 3675,
        w8: 7101,
        w9: 14266,
        cards: 4465,
        coins: 28110
    }, {
        w0: 475,
        w1: 846,
        w2: 1092,
        w3: 801,
        w4: 948,
        w5: 1704,
        w6: 2457,
        w7: 3719,
        w8: 7184,
        w9: 14420,
        cards: 4560,
        coins: 28715
    }, {
        w0: 480,
        w1: 855,
        w2: 1105,
        w3: 810,
        w4: 959,
        w5: 1726,
        w6: 2490,
        w7: 3761,
        w8: 7257,
        w9: 14580,
        cards: 4656,
        coins: 29326
    }, {
        w0: 484,
        w1: 865,
        w2: 1115,
        w3: 819,
        w4: 971,
        w5: 1741,
        w6: 2509,
        w7: 3804,
        w8: 7329,
        w9: 14742,
        cards: 4753,
        coins: 29944
    }, {
        w0: 489,
        w1: 872,
        w2: 1126,
        w3: 827,
        w4: 980,
        w5: 1756,
        w6: 2536,
        w7: 3847,
        w8: 7410,
        w9: 14889,
        cards: 4851,
        coins: 30568
    }, {
        w0: 495,
        w1: 881,
        w2: 1138,
        w3: 835,
        w4: 992,
        w5: 1769,
        w6: 2558,
        w7: 3882,
        w8: 7484,
        w9: 15046,
        cards: 4950,
        coins: 31199
    }, {
        w0: 501,
        w1: 892,
        w2: 1151,
        w3: 842,
        w4: 1001,
        w5: 1782,
        w6: 2587,
        w7: 3918,
        w8: 7558,
        w9: 15213,
        cards: 5050,
        coins: 31836
    }, {
        w0: 506,
        w1: 901,
        w2: 1161,
        w3: 852,
        w4: 1010,
        w5: 1803,
        w6: 2607,
        w7: 3960,
        w8: 7643,
        w9: 15382,
        cards: 5151,
        coins: 32480
    }, {
        w0: 511,
        w1: 910,
        w2: 1171,
        w3: 858,
        w4: 1021,
        w5: 1825,
        w6: 2630,
        w7: 4e3,
        w8: 7723,
        w9: 15534,
        cards: 5253,
        coins: 33130
    }, {
        w0: 515,
        w1: 919,
        w2: 1182,
        w3: 867,
        w4: 1032,
        w5: 1846,
        w6: 2649,
        w7: 4039,
        w8: 7801,
        w9: 15679,
        cards: 5356,
        coins: 33787
    }, {
        w0: 519,
        w1: 930,
        w2: 1192,
        w3: 876,
        w4: 1044,
        w5: 1866,
        w6: 2674,
        w7: 4081,
        w8: 7879,
        w9: 15834,
        cards: 5460,
        coins: 34450
    }, {
        w0: 523,
        w1: 939,
        w2: 1205,
        w3: 887,
        w4: 1056,
        w5: 1888,
        w6: 2703,
        w7: 4121,
        w8: 7951,
        w9: 15995,
        cards: 5565,
        coins: 35120
    }, {
        w0: 529,
        w1: 948,
        w2: 1216,
        w3: 894,
        w4: 1066,
        w5: 1901,
        w6: 2727,
        w7: 4159,
        w8: 8022,
        w9: 16151,
        cards: 5671,
        coins: 35796
    }, {
        w0: 533,
        w1: 957,
        w2: 1229,
        w3: 902,
        w4: 1075,
        w5: 1916,
        w6: 2747,
        w7: 4203,
        w8: 8094,
        w9: 16294,
        cards: 5778,
        coins: 36479
    }, {
        w0: 537,
        w1: 967,
        w2: 1240,
        w3: 910,
        w4: 1087,
        w5: 1936,
        w6: 2774,
        w7: 4239,
        w8: 8174,
        w9: 16453,
        cards: 5886,
        coins: 37168
    }, {
        w0: 541,
        w1: 975,
        w2: 1251,
        w3: 919,
        w4: 1096,
        w5: 1955,
        w6: 2805,
        w7: 4281,
        w8: 8247,
        w9: 16597,
        cards: 5995,
        coins: 37864
    }, {
        w0: 545,
        w1: 983,
        w2: 1264,
        w3: 926,
        w4: 1105,
        w5: 1976,
        w6: 2826,
        w7: 4323,
        w8: 8320,
        w9: 16748,
        cards: 6105,
        coins: 38566
    }, {
        w0: 550,
        w1: 992,
        w2: 1275,
        w3: 933,
        w4: 1114,
        w5: 1992,
        w6: 2852,
        w7: 4358,
        w8: 8397,
        w9: 16900,
        cards: 6216,
        coins: 39275
    }, {
        w0: 554,
        w1: 1002,
        w2: 1287,
        w3: 941,
        w4: 1126,
        w5: 2015,
        w6: 2874,
        w7: 4397,
        w8: 8472,
        w9: 17063,
        cards: 6328,
        coins: 39990
    }, {
        w0: 559,
        w1: 1011,
        w2: 1299,
        w3: 952,
        w4: 1138,
        w5: 2031,
        w6: 2904,
        w7: 4434,
        w8: 8549,
        w9: 17228,
        cards: 6441,
        coins: 40712
    }, {
        w0: 563,
        w1: 1021,
        w2: 1310,
        w3: 958,
        w4: 1148,
        w5: 2054,
        w6: 2929,
        w7: 4475,
        w8: 8627,
        w9: 17389,
        cards: 6555,
        coins: 41440
    }, {
        w0: 568,
        w1: 1030,
        w2: 1322,
        w3: 966,
        w4: 1160,
        w5: 2068,
        w6: 2959,
        w7: 4516,
        w8: 8698,
        w9: 17545,
        cards: 6670,
        coins: 42175
    }, {
        w0: 575,
        w1: 1040,
        w2: 1334,
        w3: 974,
        w4: 1170,
        w5: 2085,
        w6: 2986,
        w7: 4554,
        w8: 8772,
        w9: 17707,
        cards: 6786,
        coins: 42916
    }, {
        w0: 579,
        w1: 1048,
        w2: 1346,
        w3: 984,
        w4: 1180,
        w5: 2107,
        w6: 3012,
        w7: 4597,
        w8: 8847,
        w9: 17850,
        cards: 6903,
        coins: 43664
    }, {
        w0: 584,
        w1: 1057,
        w2: 1359,
        w3: 995,
        w4: 1192,
        w5: 2120,
        w6: 3041,
        w7: 4633,
        w8: 8922,
        w9: 18e3,
        cards: 7021,
        coins: 44418
    }, {
        w0: 588,
        w1: 1065,
        w2: 1369,
        w3: 1001,
        w4: 1203,
        w5: 2144,
        w6: 3063,
        w7: 4674,
        w8: 8993,
        w9: 18158,
        cards: 7140,
        coins: 45179
    }, {
        w0: 592,
        w1: 1075,
        w2: 1381,
        w3: 1011,
        w4: 1213,
        w5: 2163,
        w6: 3088,
        w7: 4709,
        w8: 9065,
        w9: 18320,
        cards: 7260,
        coins: 45946
    }, {
        w0: 597,
        w1: 1084,
        w2: 1391,
        w3: 1021,
        w4: 1223,
        w5: 2180,
        w6: 3110,
        w7: 4750,
        w8: 9147,
        w9: 18487,
        cards: 7381,
        coins: 46720
    }, {
        w0: 603,
        w1: 1092,
        w2: 1401,
        w3: 1031,
        w4: 1235,
        w5: 2196,
        w6: 3142,
        w7: 4794,
        w8: 9230,
        w9: 18639,
        cards: 7503,
        coins: 47500
    }, {
        w0: 608,
        w1: 1102,
        w2: 1413,
        w3: 1037,
        w4: 1244,
        w5: 2213,
        w6: 3171,
        w7: 4831,
        w8: 9311,
        w9: 18795,
        cards: 7626,
        coins: 48287
    }, {
        w0: 615,
        w1: 1113,
        w2: 1426,
        w3: 1044,
        w4: 1255,
        w5: 2232,
        w6: 3197,
        w7: 4866,
        w8: 9383,
        w9: 18944,
        cards: 7750,
        coins: 49080
    }, {
        w0: 621,
        w1: 1123,
        w2: 1438,
        w3: 1052,
        w4: 1266,
        w5: 2246,
        w6: 3225,
        w7: 4902,
        w8: 9461,
        w9: 19087,
        cards: 7875,
        coins: 49880
    }, {
        w0: 625,
        w1: 1131,
        w2: 1450,
        w3: 1058,
        w4: 1275,
        w5: 2263,
        w6: 3247,
        w7: 4943,
        w8: 9536,
        w9: 19248,
        cards: 8001,
        coins: 50686
    }, {
        w0: 632,
        w1: 1139,
        w2: 1460,
        w3: 1065,
        w4: 1287,
        w5: 2285,
        w6: 3277,
        w7: 4984,
        w8: 9614,
        w9: 19408,
        cards: 8128,
        coins: 51499
    }, {
        w0: 638,
        w1: 1149,
        w2: 1473,
        w3: 1074,
        w4: 1297,
        w5: 2298,
        w6: 3301,
        w7: 5022,
        w8: 9689,
        w9: 19568,
        cards: 8256,
        coins: 52318
    }, {
        w0: 645,
        w1: 1157,
        w2: 1486,
        w3: 1083,
        w4: 1308,
        w5: 2318,
        w6: 3320,
        w7: 5064,
        w8: 9772,
        w9: 19737,
        cards: 8385,
        coins: 53144
    }, {
        w0: 651,
        w1: 1165,
        w2: 1496,
        w3: 1089,
        w4: 1318,
        w5: 2341,
        w6: 3341,
        w7: 5104,
        w8: 9849,
        w9: 19881,
        cards: 8515,
        coins: 53976
    }, {
        w0: 655,
        w1: 1175,
        w2: 1508,
        w3: 1096,
        w4: 1330,
        w5: 2362,
        w6: 3370,
        w7: 5144,
        w8: 9932,
        w9: 20032,
        cards: 8646,
        coins: 54815
    }, {
        w0: 660,
        w1: 1183,
        w2: 1521,
        w3: 1102,
        w4: 1339,
        w5: 2386,
        w6: 3392,
        w7: 5186,
        w8: 10010,
        w9: 20185,
        cards: 8778,
        coins: 55660
    }, {
        w0: 666,
        w1: 1192,
        w2: 1534,
        w3: 1109,
        w4: 1348,
        w5: 2400,
        w6: 3416,
        w7: 5223,
        w8: 10082,
        w9: 20332,
        cards: 8911,
        coins: 56512
    }, {
        w0: 672,
        w1: 1201,
        w2: 1544,
        w3: 1117,
        w4: 1359,
        w5: 2422,
        w6: 3437,
        w7: 5266,
        w8: 10156,
        w9: 20485,
        cards: 9045,
        coins: 57370
    }, {
        w0: 679,
        w1: 1212,
        w2: 1556,
        w3: 1126,
        w4: 1368,
        w5: 2444,
        w6: 3466,
        w7: 5305,
        w8: 10234,
        w9: 20643,
        cards: 9180,
        coins: 58235
    }, {
        w0: 684,
        w1: 1221,
        w2: 1567,
        w3: 1136,
        w4: 1379,
        w5: 2461,
        w6: 3496,
        w7: 5350,
        w8: 10306,
        w9: 20799,
        cards: 9316,
        coins: 59106
    }, {
        w0: 688,
        w1: 1230,
        w2: 1580,
        w3: 1145,
        w4: 1390,
        w5: 2480,
        w6: 3524,
        w7: 5394,
        w8: 10378,
        w9: 20944,
        cards: 9453,
        coins: 59984
    }, {
        w0: 693,
        w1: 1238,
        w2: 1593,
        w3: 1154,
        w4: 1400,
        w5: 2495,
        w6: 3546,
        w7: 5438,
        w8: 10459,
        w9: 21098,
        cards: 9591,
        coins: 60868
    }, {
        w0: 699,
        w1: 1247,
        w2: 1606,
        w3: 1161,
        w4: 1409,
        w5: 2510,
        w6: 3578,
        w7: 5482,
        w8: 10534,
        w9: 21258,
        cards: 9730,
        coins: 61759
    }, {
        w0: 705,
        w1: 1255,
        w2: 1617,
        w3: 1167,
        w4: 1418,
        w5: 2531,
        w6: 3597,
        w7: 5519,
        w8: 10608,
        w9: 21412,
        cards: 9870,
        coins: 62656
    }, {
        w0: 710,
        w1: 1262,
        w2: 1628,
        w3: 1175,
        w4: 1427,
        w5: 2551,
        w6: 3618,
        w7: 5559,
        w8: 10682,
        w9: 21577,
        cards: 10011,
        coins: 63560
    }, {
        w0: 716,
        w1: 1270,
        w2: 1638,
        w3: 1186,
        w4: 1438,
        w5: 2568,
        w6: 3637,
        w7: 5594,
        w8: 10758,
        w9: 21740,
        cards: 10153,
        coins: 64470
    }, {
        w0: 720,
        w1: 1281,
        w2: 1651,
        w3: 1195,
        w4: 1450,
        w5: 2584,
        w6: 3670,
        w7: 5630,
        w8: 10841,
        w9: 21884,
        cards: 10296,
        coins: 65387
    }, {
        w0: 724,
        w1: 1291,
        w2: 1661,
        w3: 1204,
        w4: 1461,
        w5: 2607,
        w6: 3696,
        w7: 5669,
        w8: 10920,
        w9: 22032,
        cards: 10440,
        coins: 66310
    }, {
        w0: 728,
        w1: 1299,
        w2: 1673,
        w3: 1214,
        w4: 1472,
        w5: 2625,
        w6: 3719,
        w7: 5712,
        w8: 11005,
        w9: 22195,
        cards: 10585,
        coins: 67240
    }, {
        w0: 735,
        w1: 1308,
        w2: 1684,
        w3: 1225,
        w4: 1482,
        w5: 2647,
        w6: 3739,
        w7: 5756,
        w8: 11076,
        w9: 22341,
        cards: 10731,
        coins: 68176
    }, {
        w0: 738,
        w1: 1318,
        w2: 1694,
        w3: 1231,
        w4: 1492,
        w5: 2660,
        w6: 3764,
        w7: 5795,
        w8: 11155,
        w9: 22491,
        cards: 10878,
        coins: 69119
    }, {
        w0: 744,
        w1: 1329,
        w2: 1707,
        w3: 1240,
        w4: 1504,
        w5: 2675,
        w6: 3791,
        w7: 5837,
        w8: 11227,
        w9: 22647,
        cards: 11026,
        coins: 70068
    }, {
        w0: 749,
        w1: 1336,
        w2: 1720,
        w3: 1247,
        w4: 1516,
        w5: 2699,
        w6: 3813,
        w7: 5879,
        w8: 11311,
        w9: 22816,
        cards: 11175,
        coins: 71024
    }, {
        w0: 753,
        w1: 1344,
        w2: 1733,
        w3: 1256,
        w4: 1525,
        w5: 2714,
        w6: 3845,
        w7: 5914,
        w8: 11395,
        w9: 22976,
        cards: 11325,
        coins: 71986
    }, {
        w0: 757,
        w1: 1352,
        w2: 1745,
        w3: 1266,
        w4: 1535,
        w5: 2731,
        w6: 3869,
        w7: 5949,
        w8: 11474,
        w9: 23140,
        cards: 11476,
        coins: 72955
    }, {
        w0: 763,
        w1: 1360,
        w2: 1758,
        w3: 1275,
        w4: 1547,
        w5: 2750,
        w6: 3892,
        w7: 5988,
        w8: 11553,
        w9: 23306,
        cards: 11628,
        coins: 73930
    }, {
        w0: 770,
        w1: 1370,
        w2: 1768,
        w3: 1286,
        w4: 1559,
        w5: 2763,
        w6: 3912,
        w7: 6026,
        w8: 11634,
        w9: 23455,
        cards: 11781,
        coins: 74912
    }, {
        w0: 775,
        w1: 1379,
        w2: 1780,
        w3: 1292,
        w4: 1569,
        w5: 2776,
        w6: 3933,
        w7: 6062,
        w8: 11714,
        w9: 23609,
        cards: 11935,
        coins: 75900
    }, {
        w0: 780,
        w1: 1387,
        w2: 1793,
        w3: 1299,
        w4: 1580,
        w5: 2794,
        w6: 3952,
        w7: 6098,
        w8: 11786,
        w9: 23760,
        cards: 12090,
        coins: 76895
    }, {
        w0: 785,
        w1: 1398,
        w2: 1806,
        w3: 1305,
        w4: 1591,
        w5: 2809,
        w6: 3979,
        w7: 6143,
        w8: 11868,
        w9: 23929,
        cards: 12246,
        coins: 77896
    }, {
        w0: 792,
        w1: 1405,
        w2: 1819,
        w3: 1312,
        w4: 1600,
        w5: 2822,
        w6: 4007,
        w7: 6187,
        w8: 11948,
        w9: 24076,
        cards: 12403,
        coins: 78904
    }, {
        w0: 798,
        w1: 1413,
        w2: 1832,
        w3: 1322,
        w4: 1611,
        w5: 2837,
        w6: 4027,
        w7: 6226,
        w8: 12032,
        w9: 24235,
        cards: 12561,
        coins: 79918
    }, {
        w0: 802,
        w1: 1424,
        w2: 1845,
        w3: 1331,
        w4: 1622,
        w5: 2860,
        w6: 4060,
        w7: 6267,
        w8: 12111,
        w9: 24384,
        cards: 12720,
        coins: 80939
    }, {
        w0: 807,
        w1: 1434,
        w2: 1855,
        w3: 1340,
        w4: 1634,
        w5: 2874,
        w6: 4085,
        w7: 6305,
        w8: 12195,
        w9: 24552,
        cards: 12880,
        coins: 81966
    }, {
        w0: 811,
        w1: 1443,
        w2: 1867,
        w3: 1349,
        w4: 1643,
        w5: 2893,
        w6: 4109,
        w7: 6344,
        w8: 12272,
        w9: 24714,
        cards: 13041,
        coins: 83e3
    }, {
        w0: 815,
        w1: 1453,
        w2: 1879,
        w3: 1360,
        w4: 1655,
        w5: 2916,
        w6: 4139,
        w7: 6383,
        w8: 12353,
        w9: 24877,
        cards: 13203,
        coins: 84040
    }, {
        w0: 820,
        w1: 1461,
        w2: 1892,
        w3: 1368,
        w4: 1667,
        w5: 2938,
        w6: 4167,
        w7: 6422,
        w8: 12429,
        w9: 25041,
        cards: 13366,
        coins: 85087
    }, {
        w0: 824,
        w1: 1472,
        w2: 1905,
        w3: 1378,
        w4: 1677,
        w5: 2952,
        w6: 4199,
        w7: 6462,
        w8: 12509,
        w9: 25201,
        cards: 13530,
        coins: 86140
    }, {
        w0: 831,
        w1: 1479,
        w2: 1915,
        w3: 1388,
        w4: 1686,
        w5: 2974,
        w6: 4225,
        w7: 6505,
        w8: 12592,
        w9: 25359,
        cards: 13695,
        coins: 87200
    }, {
        w0: 835,
        w1: 1489,
        w2: 1928,
        w3: 1395,
        w4: 1698,
        w5: 2993,
        w6: 4247,
        w7: 6540,
        w8: 12665,
        w9: 25524,
        cards: 13861,
        coins: 88266
    }, {
        w0: 839,
        w1: 1496,
        w2: 1938,
        w3: 1405,
        w4: 1707,
        w5: 3007,
        w6: 4267,
        w7: 6577,
        w8: 12737,
        w9: 25678,
        cards: 14028,
        coins: 89339
    }, {
        w0: 844,
        w1: 1505,
        w2: 1949,
        w3: 1413,
        w4: 1719,
        w5: 3025,
        w6: 4295,
        w7: 6621,
        w8: 12815,
        w9: 25845,
        cards: 14196,
        coins: 90418
    }, {
        w0: 850,
        w1: 1516,
        w2: 1960,
        w3: 1422,
        w4: 1730,
        w5: 3046,
        w6: 4326,
        w7: 6659,
        w8: 12895,
        w9: 26009,
        cards: 14365,
        coins: 91504
    }, {
        w0: 857,
        w1: 1525,
        w2: 1971,
        w3: 1433,
        w4: 1741,
        w5: 3059,
        w6: 4358,
        w7: 6696,
        w8: 12978,
        w9: 26166,
        cards: 14535,
        coins: 92596
    }, {
        w0: 862,
        w1: 1533,
        w2: 1983,
        w3: 1439,
        w4: 1752,
        w5: 3075,
        w6: 4378,
        w7: 6733,
        w8: 13051,
        w9: 26322,
        cards: 14706,
        coins: 93695
    }, {
        w0: 866,
        w1: 1542,
        w2: 1993,
        w3: 1447,
        w4: 1762,
        w5: 3090,
        w6: 4411,
        w7: 6769,
        w8: 13126,
        w9: 26480,
        cards: 14878,
        coins: 94800
    }, {
        w0: 870,
        w1: 1550,
        w2: 2003,
        w3: 1453,
        w4: 1771,
        w5: 3104,
        w6: 4437,
        w7: 6809,
        w8: 13205,
        w9: 26645,
        cards: 15051,
        coins: 95912
    }, {
        w0: 874,
        w1: 1559,
        w2: 2016,
        w3: 1463,
        w4: 1781,
        w5: 3120,
        w6: 4468,
        w7: 6846,
        w8: 13277,
        w9: 26805,
        cards: 15225,
        coins: 97030
    }, {
        w0: 880,
        w1: 1569,
        w2: 2029,
        w3: 1470,
        w4: 1791,
        w5: 3137,
        w6: 4501,
        w7: 6885,
        w8: 13350,
        w9: 26956,
        cards: 15400,
        coins: 98155
    }, {
        w0: 887,
        w1: 1580,
        w2: 2040,
        w3: 1479,
        w4: 1803,
        w5: 3153,
        w6: 4520,
        w7: 6926,
        w8: 13423,
        w9: 27100,
        cards: 15576,
        coins: 99286
    }, {
        w0: 892,
        w1: 1590,
        w2: 2050,
        w3: 1486,
        w4: 1812,
        w5: 3172,
        w6: 4549,
        w7: 6969,
        w8: 13501,
        w9: 27248,
        cards: 15753,
        coins: 100424
    }, {
        w0: 898,
        w1: 1600,
        w2: 2063,
        w3: 1492,
        w4: 1821,
        w5: 3190,
        w6: 4573,
        w7: 7012,
        w8: 13576,
        w9: 27409,
        cards: 15931,
        coins: 101568
    }, {
        w0: 902,
        w1: 1608,
        w2: 2076,
        w3: 1500,
        w4: 1832,
        w5: 3211,
        w6: 4605,
        w7: 7047,
        w8: 13653,
        w9: 27559,
        cards: 16110,
        coins: 102719
    }, {
        w0: 907,
        w1: 1616,
        w2: 2089,
        w3: 1511,
        w4: 1843,
        w5: 3233,
        w6: 4633,
        w7: 7082,
        w8: 13728,
        w9: 27715,
        cards: 16290,
        coins: 103876
    }, {
        w0: 913,
        w1: 1626,
        w2: 2101,
        w3: 1518,
        w4: 1855,
        w5: 3247,
        w6: 4663,
        w7: 7119,
        w8: 13810,
        w9: 27875,
        cards: 16471,
        coins: 105040
    }, {
        w0: 919,
        w1: 1635,
        w2: 2111,
        w3: 1528,
        w4: 1867,
        w5: 3268,
        w6: 4683,
        w7: 7159,
        w8: 13889,
        w9: 28038,
        cards: 16653,
        coins: 106210
    }, {
        w0: 923,
        w1: 1646,
        w2: 2123,
        w3: 1534,
        w4: 1876,
        w5: 3289,
        w6: 4706,
        w7: 7202,
        w8: 13966,
        w9: 28197,
        cards: 16836,
        coins: 107387
    }, {
        w0: 930,
        w1: 1655,
        w2: 2135,
        w3: 1544,
        w4: 1885,
        w5: 3305,
        w6: 4729,
        w7: 7242,
        w8: 14041,
        w9: 28362,
        cards: 17020,
        coins: 108570
    }, {
        w0: 933,
        w1: 1663,
        w2: 2146,
        w3: 1552,
        w4: 1894,
        w5: 3324,
        w6: 4762,
        w7: 7281,
        w8: 14122,
        w9: 28513,
        cards: 17205,
        coins: 109760
    }, {
        w0: 937,
        w1: 1671,
        w2: 2157,
        w3: 1560,
        w4: 1906,
        w5: 3346,
        w6: 4783,
        w7: 7326,
        w8: 14199,
        w9: 28677,
        cards: 17391,
        coins: 110956
    }, {
        w0: 944,
        w1: 1680,
        w2: 2170,
        w3: 1567,
        w4: 1916,
        w5: 3370,
        w6: 4802,
        w7: 7362,
        w8: 14274,
        w9: 28843,
        cards: 17578,
        coins: 112159
    }, {
        w0: 948,
        w1: 1689,
        w2: 2183,
        w3: 1577,
        w4: 1928,
        w5: 3388,
        w6: 4830,
        w7: 7404,
        w8: 14347,
        w9: 29008,
        cards: 17766,
        coins: 113368
    }, {
        w0: 954,
        w1: 1697,
        w2: 2196,
        w3: 1587,
        w4: 1937,
        w5: 3405,
        w6: 4861,
        w7: 7446,
        w8: 14418,
        w9: 29166,
        cards: 17955,
        coins: 114584
    }, {
        w0: 959,
        w1: 1704,
        w2: 2207,
        w3: 1598,
        w4: 1949,
        w5: 3422,
        w6: 4889,
        w7: 7491,
        w8: 14495,
        w9: 29316,
        cards: 18145,
        coins: 115806
    }, {
        w0: 963,
        w1: 1713,
        w2: 2219,
        w3: 1607,
        w4: 1958,
        w5: 3442,
        w6: 4918,
        w7: 7532,
        w8: 14567,
        w9: 29462,
        cards: 18336,
        coins: 117035
    }, {
        w0: 967,
        w1: 1724,
        w2: 2231,
        w3: 1617,
        w4: 1970,
        w5: 3463,
        w6: 4945,
        w7: 7567,
        w8: 14647,
        w9: 29611,
        cards: 18528,
        coins: 118270
    }, {
        w0: 971,
        w1: 1732,
        w2: 2244,
        w3: 1624,
        w4: 1981,
        w5: 3485,
        w6: 4965,
        w7: 7612,
        w8: 14720,
        w9: 29766,
        cards: 18721,
        coins: 119512
    }, {
        w0: 978,
        w1: 1741,
        w2: 2257,
        w3: 1634,
        w4: 1990,
        w5: 3500,
        w6: 4987,
        w7: 7651,
        w8: 14801,
        w9: 29909,
        cards: 18915,
        coins: 120760
    }, {
        w0: 983,
        w1: 1749,
        w2: 2269,
        w3: 1643,
        w4: 1999,
        w5: 3514,
        w6: 5019,
        w7: 7687,
        w8: 14875,
        w9: 30059,
        cards: 19110,
        coins: 122015
    }, {
        w0: 988,
        w1: 1758,
        w2: 2279,
        w3: 1654,
        w4: 2010,
        w5: 3536,
        w6: 5047,
        w7: 7722,
        w8: 14953,
        w9: 30222,
        cards: 19306,
        coins: 123276
    }, {
        w0: 992,
        w1: 1768,
        w2: 2289,
        w3: 1660,
        w4: 2019,
        w5: 3554,
        w6: 5075,
        w7: 7765,
        w8: 15037,
        w9: 30376,
        cards: 19503,
        coins: 124544
    }, {
        w0: 997,
        w1: 1776,
        w2: 2302,
        w3: 1669,
        w4: 2028,
        w5: 3576,
        w6: 5108,
        w7: 7803,
        w8: 15119,
        w9: 30545,
        cards: 19701,
        coins: 125818
    }, {
        w0: 1004,
        w1: 1785,
        w2: 2314,
        w3: 1680,
        w4: 2040,
        w5: 3600,
        w6: 5131,
        w7: 7842,
        w8: 15201,
        w9: 30693,
        cards: 19900,
        coins: 127099
    }, {
        w0: 1009,
        w1: 1794,
        w2: 2327,
        w3: 1687,
        w4: 2049,
        w5: 3622,
        w6: 5164,
        w7: 7882,
        w8: 15284,
        w9: 30862,
        cards: 20100,
        coins: 128386
    }, {
        w0: 1014,
        w1: 1802,
        w2: 2337,
        w3: 1694,
        w4: 2058,
        w5: 3637,
        w6: 5196,
        w7: 7921,
        w8: 15358,
        w9: 31015,
        cards: 20301,
        coins: 129680
    }, {
        w0: 1019,
        w1: 1812,
        w2: 2350,
        w3: 1702,
        w4: 2067,
        w5: 3654,
        w6: 5217,
        w7: 7957,
        w8: 15438,
        w9: 31177,
        cards: 20503,
        coins: 130980
    } ],
    "5": [ {
        w0: 8,
        w1: 12,
        w2: 12,
        w3: 8,
        w4: 12,
        w5: 17,
        w6: 24,
        w7: 41,
        w8: 90,
        w9: 191,
        cards: 1,
        coins: 0
    }, {
        w0: 14,
        w1: 24,
        w2: 24,
        w3: 18,
        w4: 24,
        w5: 35,
        w6: 62,
        w7: 84,
        w8: 182,
        w9: 371,
        cards: 10,
        coins: 300
    }, {
        w0: 20,
        w1: 35,
        w2: 38,
        w3: 29,
        w4: 36,
        w5: 56,
        w6: 93,
        w7: 132,
        w8: 273,
        w9: 549,
        cards: 15,
        coins: 323
    }, {
        w0: 24,
        w1: 45,
        w2: 53,
        w3: 36,
        w4: 50,
        w5: 72,
        w6: 117,
        w7: 180,
        w8: 371,
        w9: 728,
        cards: 21,
        coins: 353
    }, {
        w0: 29,
        w1: 54,
        w2: 68,
        w3: 48,
        w4: 62,
        w5: 96,
        w6: 140,
        w7: 221,
        w8: 464,
        w9: 893,
        cards: 28,
        coins: 391
    }, {
        w0: 35,
        w1: 65,
        w2: 80,
        w3: 59,
        w4: 75,
        w5: 114,
        w6: 168,
        w7: 266,
        w8: 546,
        w9: 1083,
        cards: 36,
        coins: 436
    }, {
        w0: 41,
        w1: 77,
        w2: 95,
        w3: 71,
        w4: 86,
        w5: 134,
        w6: 206,
        w7: 315,
        w8: 639,
        w9: 1257,
        cards: 45,
        coins: 489
    }, {
        w0: 48,
        w1: 86,
        w2: 110,
        w3: 78,
        w4: 98,
        w5: 152,
        w6: 237,
        w7: 360,
        w8: 725,
        w9: 1451,
        cards: 55,
        coins: 549
    }, {
        w0: 56,
        w1: 96,
        w2: 122,
        w3: 87,
        w4: 108,
        w5: 174,
        w6: 270,
        w7: 407,
        w8: 816,
        w9: 1620,
        cards: 66,
        coins: 617
    }, {
        w0: 60,
        w1: 107,
        w2: 134,
        w3: 96,
        w4: 122,
        w5: 194,
        w6: 302,
        w7: 455,
        w8: 900,
        w9: 1787,
        cards: 78,
        coins: 692
    }, {
        w0: 68,
        w1: 116,
        w2: 146,
        w3: 108,
        w4: 135,
        w5: 219,
        w6: 324,
        w7: 495,
        w8: 993,
        w9: 1959,
        cards: 91,
        coins: 775
    }, {
        w0: 75,
        w1: 125,
        w2: 158,
        w3: 116,
        w4: 147,
        w5: 234,
        w6: 353,
        w7: 537,
        w8: 1089,
        w9: 2126,
        cards: 105,
        coins: 865
    }, {
        w0: 83,
        w1: 134,
        w2: 171,
        w3: 126,
        w4: 161,
        w5: 254,
        w6: 387,
        w7: 584,
        w8: 1184,
        w9: 2291,
        cards: 120,
        coins: 963
    }, {
        w0: 87,
        w1: 146,
        w2: 185,
        w3: 138,
        w4: 173,
        w5: 270,
        w6: 410,
        w7: 629,
        w8: 1281,
        w9: 2457,
        cards: 136,
        coins: 1068
    }, {
        w0: 93,
        w1: 158,
        w2: 200,
        w3: 147,
        w4: 183,
        w5: 288,
        w6: 447,
        w7: 675,
        w8: 1364,
        w9: 2625,
        cards: 153,
        coins: 1181
    }, {
        w0: 101,
        w1: 170,
        w2: 212,
        w3: 155,
        w4: 197,
        w5: 306,
        w6: 480,
        w7: 719,
        w8: 1457,
        w9: 2793,
        cards: 171,
        coins: 1301
    }, {
        w0: 107,
        w1: 182,
        w2: 227,
        w3: 164,
        w4: 207,
        w5: 329,
        w6: 504,
        w7: 762,
        w8: 1551,
        w9: 2975,
        cards: 190,
        coins: 1429
    }, {
        w0: 113,
        w1: 191,
        w2: 242,
        w3: 173,
        w4: 221,
        w5: 347,
        w6: 528,
        w7: 807,
        w8: 1637,
        w9: 3143,
        cards: 210,
        coins: 1564
    }, {
        w0: 120,
        w1: 203,
        w2: 254,
        w3: 182,
        w4: 231,
        w5: 369,
        w6: 557,
        w7: 857,
        w8: 1733,
        w9: 3338,
        cards: 231,
        coins: 1707
    }, {
        w0: 128,
        w1: 213,
        w2: 267,
        w3: 191,
        w4: 245,
        w5: 387,
        w6: 588,
        w7: 900,
        w8: 1821,
        w9: 3531,
        cards: 253,
        coins: 1857
    }, {
        w0: 135,
        w1: 225,
        w2: 282,
        w3: 203,
        w4: 258,
        w5: 410,
        w6: 612,
        w7: 941,
        w8: 1917,
        w9: 3711,
        cards: 276,
        coins: 2015
    }, {
        w0: 141,
        w1: 237,
        w2: 296,
        w3: 213,
        w4: 272,
        w5: 431,
        w6: 638,
        w7: 981,
        w8: 2006,
        w9: 3894,
        cards: 300,
        coins: 2180
    }, {
        w0: 147,
        w1: 248,
        w2: 308,
        w3: 225,
        w4: 282,
        w5: 456,
        w6: 668,
        w7: 1032,
        w8: 2102,
        w9: 4068,
        cards: 325,
        coins: 2353
    }, {
        w0: 153,
        w1: 258,
        w2: 321,
        w3: 233,
        w4: 294,
        w5: 483,
        w6: 696,
        w7: 1083,
        w8: 2189,
        w9: 4262,
        cards: 351,
        coins: 2533
    }, {
        w0: 158,
        w1: 270,
        w2: 333,
        w3: 240,
        w4: 306,
        w5: 507,
        w6: 726,
        w7: 1125,
        w8: 2273,
        w9: 4449,
        cards: 378,
        coins: 2721
    }, {
        w0: 164,
        w1: 279,
        w2: 345,
        w3: 252,
        w4: 317,
        w5: 522,
        w6: 759,
        w7: 1167,
        w8: 2367,
        w9: 4629,
        cards: 406,
        coins: 2916
    }, {
        w0: 170,
        w1: 290,
        w2: 360,
        w3: 263,
        w4: 329,
        w5: 548,
        w6: 792,
        w7: 1209,
        w8: 2465,
        w9: 4809,
        cards: 435,
        coins: 3119
    }, {
        w0: 177,
        w1: 302,
        w2: 372,
        w3: 270,
        w4: 342,
        w5: 575,
        w6: 821,
        w7: 1250,
        w8: 2552,
        w9: 4985,
        cards: 465,
        coins: 3329
    }, {
        w0: 183,
        w1: 314,
        w2: 384,
        w3: 278,
        w4: 356,
        w5: 599,
        w6: 854,
        w7: 1298,
        w8: 2639,
        w9: 5169,
        cards: 496,
        coins: 3547
    }, {
        w0: 188,
        w1: 326,
        w2: 398,
        w3: 285,
        w4: 366,
        w5: 615,
        w6: 888,
        w7: 1340,
        w8: 2729,
        w9: 5364,
        cards: 528,
        coins: 3772
    }, {
        w0: 194,
        w1: 338,
        w2: 411,
        w3: 296,
        w4: 378,
        w5: 641,
        w6: 920,
        w7: 1383,
        w8: 2816,
        w9: 5532,
        cards: 561,
        coins: 4005
    }, {
        w0: 200,
        w1: 350,
        w2: 423,
        w3: 308,
        w4: 392,
        w5: 663,
        w6: 948,
        w7: 1431,
        w8: 2912,
        w9: 5726,
        cards: 595,
        coins: 4245
    }, {
        w0: 207,
        w1: 362,
        w2: 438,
        w3: 318,
        w4: 402,
        w5: 678,
        w6: 974,
        w7: 1482,
        w8: 3002,
        w9: 5913,
        cards: 630,
        coins: 4493
    }, {
        w0: 213,
        w1: 371,
        w2: 450,
        w3: 327,
        w4: 416,
        w5: 702,
        w6: 998,
        w7: 1533,
        w8: 3096,
        w9: 6099,
        cards: 666,
        coins: 4748
    }, {
        w0: 219,
        w1: 381,
        w2: 464,
        w3: 338,
        w4: 429,
        w5: 729,
        w6: 1028,
        w7: 1581,
        w8: 3182,
        w9: 6272,
        cards: 703,
        coins: 5011
    }, {
        w0: 227,
        w1: 393,
        w2: 476,
        w3: 348,
        w4: 440,
        w5: 749,
        w6: 1059,
        w7: 1623,
        w8: 3279,
        w9: 6441,
        cards: 741,
        coins: 5281
    }, {
        w0: 231,
        w1: 404,
        w2: 491,
        w3: 356,
        w4: 452,
        w5: 764,
        w6: 1095,
        w7: 1673,
        w8: 3369,
        w9: 6612,
        cards: 780,
        coins: 5559
    }, {
        w0: 236,
        w1: 414,
        w2: 504,
        w3: 368,
        w4: 464,
        w5: 785,
        w6: 1121,
        w7: 1716,
        w8: 3459,
        w9: 6786,
        cards: 820,
        coins: 5844
    }, {
        w0: 240,
        w1: 425,
        w2: 516,
        w3: 378,
        w4: 477,
        w5: 806,
        w6: 1149,
        w7: 1763,
        w8: 3552,
        w9: 6971,
        cards: 861,
        coins: 6137
    }, {
        w0: 245,
        w1: 435,
        w2: 531,
        w3: 387,
        w4: 489,
        w5: 825,
        w6: 1179,
        w7: 1803,
        w8: 3641,
        w9: 7146,
        cards: 903,
        coins: 6437
    }, {
        w0: 252,
        w1: 446,
        w2: 546,
        w3: 398,
        w4: 501,
        w5: 852,
        w6: 1208,
        w7: 1845,
        w8: 3726,
        w9: 7311,
        cards: 946,
        coins: 6745
    }, {
        w0: 258,
        w1: 458,
        w2: 561,
        w3: 408,
        w4: 512,
        w5: 878,
        w6: 1230,
        w7: 1893,
        w8: 3816,
        w9: 7479,
        cards: 990,
        coins: 7060
    }, {
        w0: 266,
        w1: 467,
        w2: 573,
        w3: 417,
        w4: 524,
        w5: 900,
        w6: 1256,
        w7: 1935,
        w8: 3908,
        w9: 7673,
        cards: 1035,
        coins: 7383
    }, {
        w0: 270,
        w1: 477,
        w2: 588,
        w3: 425,
        w4: 537,
        w5: 927,
        w6: 1293,
        w7: 1980,
        w8: 3996,
        w9: 7847,
        cards: 1081,
        coins: 7713
    }, {
        w0: 276,
        w1: 486,
        w2: 603,
        w3: 434,
        w4: 551,
        w5: 948,
        w6: 1316,
        w7: 2031,
        w8: 4091,
        w9: 8022,
        cards: 1128,
        coins: 8051
    }, {
        w0: 281,
        w1: 495,
        w2: 618,
        w3: 443,
        w4: 561,
        w5: 963,
        w6: 1349,
        w7: 2081,
        w8: 4176,
        w9: 8216,
        cards: 1176,
        coins: 8396
    }, {
        w0: 287,
        w1: 506,
        w2: 630,
        w3: 452,
        w4: 572,
        w5: 978,
        w6: 1380,
        w7: 2127,
        w8: 4274,
        w9: 8390,
        cards: 1225,
        coins: 8749
    }, {
        w0: 293,
        w1: 515,
        w2: 644,
        w3: 464,
        w4: 584,
        w5: 995,
        w6: 1407,
        w7: 2168,
        w8: 4362,
        w9: 8559,
        cards: 1275,
        coins: 9109
    }, {
        w0: 300,
        w1: 525,
        w2: 659,
        w3: 473,
        w4: 597,
        w5: 1013,
        w6: 1437,
        w7: 2214,
        w8: 4458,
        w9: 8754,
        cards: 1326,
        coins: 9477
    }, {
        w0: 305,
        w1: 537,
        w2: 671,
        w3: 482,
        w4: 609,
        w5: 1038,
        w6: 1461,
        w7: 2256,
        w8: 4550,
        w9: 8930,
        cards: 1378,
        coins: 9852
    }, {
        w0: 309,
        w1: 548,
        w2: 684,
        w3: 491,
        w4: 623,
        w5: 1065,
        w6: 1499,
        w7: 2307,
        w8: 4641,
        w9: 9122,
        cards: 1431,
        coins: 10235
    }, {
        w0: 315,
        w1: 558,
        w2: 699,
        w3: 498,
        w4: 633,
        w5: 1086,
        w6: 1526,
        w7: 2349,
        w8: 4731,
        w9: 9299,
        cards: 1485,
        coins: 10625
    }, {
        w0: 323,
        w1: 570,
        w2: 711,
        w3: 507,
        w4: 644,
        w5: 1106,
        w6: 1560,
        w7: 2391,
        w8: 4821,
        w9: 9476,
        cards: 1540,
        coins: 11023
    }, {
        w0: 329,
        w1: 581,
        w2: 725,
        w3: 519,
        w4: 656,
        w5: 1133,
        w6: 1598,
        w7: 2435,
        w8: 4917,
        w9: 9648,
        cards: 1596,
        coins: 11428
    }, {
        w0: 336,
        w1: 593,
        w2: 740,
        w3: 527,
        w4: 668,
        w5: 1148,
        w6: 1635,
        w7: 2481,
        w8: 5009,
        w9: 9843,
        cards: 1653,
        coins: 11841
    }, {
        w0: 344,
        w1: 603,
        w2: 752,
        w3: 536,
        w4: 678,
        w5: 1169,
        w6: 1673,
        w7: 2526,
        w8: 5100,
        w9: 10037,
        cards: 1711,
        coins: 12261
    }, {
        w0: 348,
        w1: 614,
        w2: 765,
        w3: 548,
        w4: 690,
        w5: 1184,
        w6: 1697,
        w7: 2570,
        w8: 5187,
        w9: 10212,
        cards: 1770,
        coins: 12689
    }, {
        w0: 356,
        w1: 626,
        w2: 780,
        w3: 560,
        w4: 704,
        w5: 1208,
        w6: 1725,
        w7: 2610,
        w8: 5277,
        w9: 10398,
        cards: 1830,
        coins: 13124
    }, {
        w0: 363,
        w1: 636,
        w2: 792,
        w3: 570,
        w4: 716,
        w5: 1229,
        w6: 1751,
        w7: 2652,
        w8: 5373,
        w9: 10572,
        cards: 1891,
        coins: 13567
    }, {
        w0: 369,
        w1: 647,
        w2: 807,
        w3: 581,
        w4: 728,
        w5: 1256,
        w6: 1787,
        w7: 2697,
        w8: 5468,
        w9: 10757,
        cards: 1953,
        coins: 14017
    }, {
        w0: 374,
        w1: 657,
        w2: 822,
        w3: 590,
        w4: 741,
        w5: 1272,
        w6: 1811,
        w7: 2748,
        w8: 5561,
        w9: 10925,
        cards: 2016,
        coins: 14475
    }, {
        w0: 378,
        w1: 669,
        w2: 836,
        w3: 597,
        w4: 755,
        w5: 1296,
        w6: 1844,
        w7: 2793,
        w8: 5651,
        w9: 11096,
        cards: 2080,
        coins: 14940
    }, {
        w0: 384,
        w1: 678,
        w2: 849,
        w3: 605,
        w4: 767,
        w5: 1317,
        w6: 1871,
        w7: 2837,
        w8: 5733,
        w9: 11264,
        cards: 2145,
        coins: 15413
    }, {
        w0: 389,
        w1: 689,
        w2: 861,
        w3: 614,
        w4: 780,
        w5: 1343,
        w6: 1908,
        w7: 2883,
        w8: 5826,
        w9: 11451,
        cards: 2211,
        coins: 15893
    }, {
        w0: 395,
        w1: 699,
        w2: 873,
        w3: 623,
        w4: 791,
        w5: 1365,
        w6: 1937,
        w7: 2925,
        w8: 5919,
        w9: 11628,
        cards: 2278,
        coins: 16381
    }, {
        w0: 402,
        w1: 710,
        w2: 885,
        w3: 633,
        w4: 801,
        w5: 1388,
        w6: 1970,
        w7: 2973,
        w8: 6012,
        w9: 11802,
        cards: 2346,
        coins: 16876
    }, {
        w0: 407,
        w1: 719,
        w2: 897,
        w3: 645,
        w4: 815,
        w5: 1412,
        w6: 2003,
        w7: 3020,
        w8: 6098,
        w9: 11981,
        cards: 2415,
        coins: 17379
    }, {
        w0: 411,
        w1: 731,
        w2: 912,
        w3: 656,
        w4: 828,
        w5: 1427,
        w6: 2027,
        w7: 3060,
        w8: 6182,
        w9: 12173,
        cards: 2485,
        coins: 17889
    }, {
        w0: 417,
        w1: 740,
        w2: 927,
        w3: 665,
        w4: 842,
        w5: 1446,
        w6: 2058,
        w7: 3107,
        w8: 6272,
        w9: 12360,
        cards: 2556,
        coins: 18407
    }, {
        w0: 423,
        w1: 752,
        w2: 941,
        w3: 672,
        w4: 854,
        w5: 1470,
        w6: 2096,
        w7: 3149,
        w8: 6363,
        w9: 12540,
        cards: 2628,
        coins: 18932
    }, {
        w0: 428,
        w1: 764,
        w2: 954,
        w3: 680,
        w4: 864,
        w5: 1491,
        w6: 2126,
        w7: 3200,
        w8: 6461,
        w9: 12731,
        cards: 2701,
        coins: 19465
    }, {
        w0: 434,
        w1: 773,
        w2: 968,
        w3: 690,
        w4: 875,
        w5: 1511,
        w6: 2153,
        w7: 3245,
        w8: 6546,
        w9: 12900,
        cards: 2775,
        coins: 20005
    }, {
        w0: 441,
        w1: 782,
        w2: 980,
        w3: 699,
        w4: 888,
        w5: 1536,
        w6: 2175,
        w7: 3287,
        w8: 6632,
        w9: 13086,
        cards: 2850,
        coins: 20553
    }, {
        w0: 447,
        w1: 794,
        w2: 992,
        w3: 710,
        w4: 900,
        w5: 1551,
        w6: 2198,
        w7: 3338,
        w8: 6726,
        w9: 13266,
        cards: 2926,
        coins: 21108
    }, {
        w0: 453,
        w1: 803,
        w2: 1005,
        w3: 719,
        w4: 914,
        w5: 1574,
        w6: 2222,
        w7: 3386,
        w8: 6815,
        w9: 13445,
        cards: 3003,
        coins: 21671
    }, {
        w0: 458,
        w1: 815,
        w2: 1020,
        w3: 728,
        w4: 924,
        w5: 1589,
        w6: 2250,
        w7: 3426,
        w8: 6911,
        w9: 13632,
        cards: 3081,
        coins: 22241
    }, {
        w0: 464,
        w1: 827,
        w2: 1032,
        w3: 737,
        w4: 935,
        w5: 1605,
        w6: 2282,
        w7: 3473,
        w8: 7005,
        w9: 13814,
        cards: 3160,
        coins: 22819
    }, {
        w0: 468,
        w1: 836,
        w2: 1047,
        w3: 749,
        w4: 947,
        w5: 1628,
        w6: 2307,
        w7: 3524,
        w8: 7091,
        w9: 14007,
        cards: 3240,
        coins: 23404
    }, {
        w0: 474,
        w1: 846,
        w2: 1062,
        w3: 756,
        w4: 959,
        w5: 1649,
        w6: 2345,
        w7: 3566,
        w8: 7185,
        w9: 14192,
        cards: 3321,
        coins: 23997
    }, {
        w0: 482,
        w1: 855,
        w2: 1076,
        w3: 764,
        w4: 971,
        w5: 1676,
        w6: 2373,
        w7: 3606,
        w8: 7281,
        w9: 14379,
        cards: 3403,
        coins: 24597
    }, {
        w0: 489,
        w1: 864,
        w2: 1091,
        w3: 776,
        w4: 984,
        w5: 1697,
        w6: 2396,
        w7: 3656,
        w8: 7379,
        w9: 14567,
        cards: 3486,
        coins: 25205
    }, {
        w0: 494,
        w1: 875,
        w2: 1106,
        w3: 786,
        w4: 998,
        w5: 1713,
        w6: 2433,
        w7: 3699,
        w8: 7463,
        w9: 14757,
        cards: 3570,
        coins: 25820
    }, {
        w0: 498,
        w1: 885,
        w2: 1119,
        w3: 795,
        w4: 1011,
        w5: 1734,
        w6: 2459,
        w7: 3750,
        w8: 7550,
        w9: 14943,
        cards: 3655,
        coins: 26443
    }, {
        w0: 504,
        w1: 896,
        w2: 1131,
        w3: 807,
        w4: 1025,
        w5: 1757,
        w6: 2484,
        w7: 3800,
        w8: 7643,
        w9: 15122,
        cards: 3741,
        coins: 27073
    }, {
        w0: 512,
        w1: 906,
        w2: 1146,
        w3: 816,
        w4: 1035,
        w5: 1779,
        w6: 2517,
        w7: 3842,
        w8: 7740,
        w9: 15306,
        cards: 3828,
        coins: 27711
    }, {
        w0: 516,
        w1: 918,
        w2: 1160,
        w3: 827,
        w4: 1047,
        w5: 1800,
        w6: 2541,
        w7: 3882,
        w8: 7824,
        w9: 15498,
        cards: 3916,
        coins: 28356
    }, {
        w0: 522,
        w1: 927,
        w2: 1175,
        w3: 839,
        w4: 1058,
        w5: 1824,
        w6: 2571,
        w7: 3930,
        w8: 7908,
        w9: 15663,
        cards: 4005,
        coins: 29009
    }, {
        w0: 527,
        w1: 936,
        w2: 1188,
        w3: 846,
        w4: 1070,
        w5: 1847,
        w6: 2597,
        w7: 3980,
        w8: 8003,
        w9: 15854,
        cards: 4095,
        coins: 29669
    }, {
        w0: 533,
        w1: 945,
        w2: 1200,
        w3: 854,
        w4: 1080,
        w5: 1874,
        w6: 2627,
        w7: 4026,
        w8: 8093,
        w9: 16031,
        cards: 4186,
        coins: 30337
    }, {
        w0: 540,
        w1: 956,
        w2: 1215,
        w3: 861,
        w4: 1092,
        w5: 1892,
        w6: 2657,
        w7: 4071,
        w8: 8178,
        w9: 16208,
        cards: 4278,
        coins: 31012
    }, {
        w0: 545,
        w1: 965,
        w2: 1229,
        w3: 870,
        w4: 1103,
        w5: 1907,
        w6: 2688,
        w7: 4121,
        w8: 8276,
        w9: 16400,
        cards: 4371,
        coins: 31695
    }, {
        w0: 551,
        w1: 974,
        w2: 1244,
        w3: 881,
        w4: 1113,
        w5: 1926,
        w6: 2723,
        w7: 4163,
        w8: 8358,
        w9: 16586,
        cards: 4465,
        coins: 32385
    }, {
        w0: 555,
        w1: 984,
        w2: 1257,
        w3: 891,
        w4: 1125,
        w5: 1946,
        w6: 2750,
        w7: 4206,
        w8: 8442,
        w9: 16751,
        cards: 4560,
        coins: 33083
    }, {
        w0: 560,
        w1: 996,
        w2: 1269,
        w3: 903,
        w4: 1139,
        w5: 1964,
        w6: 2778,
        w7: 4254,
        w8: 8529,
        w9: 16928,
        cards: 4656,
        coins: 33788
    }, {
        w0: 564,
        w1: 1007,
        w2: 1284,
        w3: 915,
        w4: 1151,
        w5: 1980,
        w6: 2814,
        w7: 4296,
        w8: 8621,
        w9: 17106,
        cards: 4753,
        coins: 34501
    }, {
        w0: 569,
        w1: 1016,
        w2: 1298,
        w3: 923,
        w4: 1161,
        w5: 2006,
        w6: 2849,
        w7: 4344,
        w8: 8717,
        w9: 17289,
        cards: 4851,
        coins: 35221
    }, {
        w0: 575,
        w1: 1028,
        w2: 1311,
        w3: 933,
        w4: 1173,
        w5: 2021,
        w6: 2876,
        w7: 4395,
        w8: 8811,
        w9: 17472,
        cards: 4950,
        coins: 35949
    }, {
        w0: 579,
        w1: 1038,
        w2: 1326,
        w3: 944,
        w4: 1185,
        w5: 2048,
        w6: 2910,
        w7: 4443,
        w8: 8909,
        w9: 17651,
        cards: 5050,
        coins: 36684
    }, {
        w0: 587,
        w1: 1049,
        w2: 1341,
        w3: 951,
        w4: 1196,
        w5: 2064,
        w6: 2945,
        w7: 4488,
        w8: 9003,
        w9: 17840,
        cards: 5151,
        coins: 37427
    }, {
        w0: 594,
        w1: 1058,
        w2: 1353,
        w3: 959,
        w4: 1209,
        w5: 2085,
        w6: 2972,
        w7: 4529,
        w8: 9090,
        w9: 18030,
        cards: 5253,
        coins: 38177
    }, {
        w0: 602,
        w1: 1070,
        w2: 1368,
        w3: 969,
        w4: 1223,
        w5: 2103,
        w6: 3e3,
        w7: 4569,
        w8: 9173,
        w9: 18212,
        cards: 5356,
        coins: 38935
    }, {
        w0: 608,
        w1: 1080,
        w2: 1380,
        w3: 977,
        w4: 1233,
        w5: 2124,
        w6: 3026,
        w7: 4610,
        w8: 9269,
        w9: 18377,
        cards: 5460,
        coins: 39700
    }, {
        w0: 615,
        w1: 1089,
        w2: 1392,
        w3: 986,
        w4: 1244,
        w5: 2145,
        w6: 3054,
        w7: 4655,
        w8: 9365,
        w9: 18546,
        cards: 5565,
        coins: 40473
    }, {
        w0: 620,
        w1: 1101,
        w2: 1407,
        w3: 995,
        w4: 1254,
        w5: 2168,
        w6: 3086,
        w7: 4700,
        w8: 9453,
        w9: 18737,
        cards: 5671,
        coins: 41253
    }, {
        w0: 624,
        w1: 1110,
        w2: 1419,
        w3: 1005,
        w4: 1266,
        w5: 2190,
        w6: 3117,
        w7: 4749,
        w8: 9537,
        w9: 18924,
        cards: 5778,
        coins: 42041
    }, {
        w0: 632,
        w1: 1122,
        w2: 1434,
        w3: 1017,
        w4: 1280,
        w5: 2208,
        w6: 3149,
        w7: 4800,
        w8: 9621,
        w9: 19095,
        cards: 5886,
        coins: 42836
    }, {
        w0: 638,
        w1: 1133,
        w2: 1449,
        w3: 1028,
        w4: 1292,
        w5: 2234,
        w6: 3179,
        w7: 4850,
        w8: 9704,
        w9: 19266,
        cards: 5995,
        coins: 43639
    }, {
        w0: 642,
        w1: 1143,
        w2: 1463,
        w3: 1038,
        w4: 1304,
        w5: 2261,
        w6: 3204,
        w7: 4899,
        w8: 9794,
        w9: 19460,
        cards: 6105,
        coins: 44449
    }, {
        w0: 650,
        w1: 1155,
        w2: 1475,
        w3: 1050,
        w4: 1314,
        w5: 2286,
        w6: 3231,
        w7: 4941,
        w8: 9885,
        w9: 19625,
        cards: 6216,
        coins: 45267
    }, {
        w0: 657,
        w1: 1167,
        w2: 1490,
        w3: 1061,
        w4: 1328,
        w5: 2306,
        w6: 3258,
        w7: 4982,
        w8: 9974,
        w9: 19793,
        cards: 6328,
        coins: 46092
    }, {
        w0: 665,
        w1: 1176,
        w2: 1502,
        w3: 1073,
        w4: 1341,
        w5: 2330,
        w6: 3285,
        w7: 5025,
        w8: 10056,
        w9: 19985,
        cards: 6441,
        coins: 46925
    }, {
        w0: 672,
        w1: 1188,
        w2: 1515,
        w3: 1085,
        w4: 1352,
        w5: 2355,
        w6: 3311,
        w7: 5076,
        w8: 10146,
        w9: 20180,
        cards: 6555,
        coins: 47765
    }, {
        w0: 678,
        w1: 1200,
        w2: 1529,
        w3: 1097,
        w4: 1362,
        w5: 2373,
        w6: 3344,
        w7: 5124,
        w8: 10233,
        w9: 20357,
        cards: 6670,
        coins: 48613
    }, {
        w0: 683,
        w1: 1212,
        w2: 1542,
        w3: 1104,
        w4: 1374,
        w5: 2399,
        w6: 3374,
        w7: 5171,
        w8: 10331,
        w9: 20546,
        cards: 6786,
        coins: 49468
    }, {
        w0: 689,
        w1: 1224,
        w2: 1556,
        w3: 1112,
        w4: 1385,
        w5: 2414,
        w6: 3404,
        w7: 5214,
        w8: 10424,
        w9: 20739,
        cards: 6903,
        coins: 50331
    }, {
        w0: 696,
        w1: 1236,
        w2: 1569,
        w3: 1121,
        w4: 1398,
        w5: 2432,
        w6: 3438,
        w7: 5258,
        w8: 10512,
        w9: 20922,
        cards: 7021,
        coins: 51201
    }, {
        w0: 702,
        w1: 1248,
        w2: 1584,
        w3: 1131,
        w4: 1412,
        w5: 2456,
        w6: 3474,
        w7: 5304,
        w8: 10598,
        w9: 21090,
        cards: 7140,
        coins: 52079
    }, {
        w0: 708,
        w1: 1259,
        w2: 1596,
        w3: 1142,
        w4: 1424,
        w5: 2481,
        w6: 3498,
        w7: 5352,
        w8: 10680,
        w9: 21258,
        cards: 7260,
        coins: 52964
    }, {
        w0: 713,
        w1: 1269,
        w2: 1610,
        w3: 1154,
        w4: 1437,
        w5: 2501,
        w6: 3531,
        w7: 5402,
        w8: 10767,
        w9: 21437,
        cards: 7381,
        coins: 53857
    }, {
        w0: 720,
        w1: 1278,
        w2: 1623,
        w3: 1166,
        w4: 1451,
        w5: 2516,
        w6: 3554,
        w7: 5447,
        w8: 10862,
        w9: 21627,
        cards: 7503,
        coins: 54757
    }, {
        w0: 725,
        w1: 1287,
        w2: 1638,
        w3: 1178,
        w4: 1464,
        w5: 2537,
        w6: 3585,
        w7: 5487,
        w8: 10946,
        w9: 21818,
        cards: 7626,
        coins: 55665
    }, {
        w0: 731,
        w1: 1298,
        w2: 1653,
        w3: 1188,
        w4: 1476,
        w5: 2561,
        w6: 3612,
        w7: 5528,
        w8: 11043,
        w9: 21999,
        cards: 7750,
        coins: 56580
    }, {
        w0: 738,
        w1: 1310,
        w2: 1668,
        w3: 1196,
        w4: 1490,
        w5: 2586,
        w6: 3636,
        w7: 5568,
        w8: 11130,
        w9: 22191,
        cards: 7875,
        coins: 57503
    }, {
        w0: 744,
        w1: 1319,
        w2: 1680,
        w3: 1208,
        w4: 1502,
        w5: 2601,
        w6: 3665,
        w7: 5616,
        w8: 11228,
        w9: 22361,
        cards: 8001,
        coins: 58433
    }, {
        w0: 752,
        w1: 1329,
        w2: 1695,
        w3: 1215,
        w4: 1514,
        w5: 2618,
        w6: 3687,
        w7: 5661,
        w8: 11324,
        w9: 22529,
        cards: 8128,
        coins: 59371
    }, {
        w0: 758,
        w1: 1338,
        w2: 1710,
        w3: 1227,
        w4: 1527,
        w5: 2642,
        w6: 3725,
        w7: 5711,
        w8: 11406,
        w9: 22716,
        cards: 8256,
        coins: 60316
    }, {
        w0: 762,
        w1: 1349,
        w2: 1722,
        w3: 1235,
        w4: 1538,
        w5: 2657,
        w6: 3755,
        w7: 5762,
        w8: 11495,
        w9: 22902,
        cards: 8385,
        coins: 61269
    }, {
        w0: 767,
        w1: 1359,
        w2: 1736,
        w3: 1242,
        w4: 1550,
        w5: 2675,
        w6: 3782,
        w7: 5810,
        w8: 11577,
        w9: 23097,
        cards: 8515,
        coins: 62229
    }, {
        w0: 771,
        w1: 1371,
        w2: 1748,
        w3: 1253,
        w4: 1560,
        w5: 2693,
        w6: 3809,
        w7: 5855,
        w8: 11666,
        w9: 23279,
        cards: 8646,
        coins: 63197
    }, {
        w0: 777,
        w1: 1383,
        w2: 1763,
        w3: 1263,
        w4: 1574,
        w5: 2717,
        w6: 3839,
        w7: 5895,
        w8: 11748,
        w9: 23456,
        cards: 8778,
        coins: 64172
    }, {
        w0: 782,
        w1: 1392,
        w2: 1776,
        w3: 1275,
        w4: 1587,
        w5: 2741,
        w6: 3863,
        w7: 5936,
        w8: 11835,
        w9: 23646,
        cards: 8911,
        coins: 65155
    }, {
        w0: 789,
        w1: 1401,
        w2: 1788,
        w3: 1287,
        w4: 1601,
        w5: 2760,
        w6: 3887,
        w7: 5979,
        w8: 11927,
        w9: 23823,
        cards: 9045,
        coins: 66145
    }, {
        w0: 795,
        w1: 1412,
        w2: 1802,
        w3: 1296,
        w4: 1614,
        w5: 2780,
        w6: 3915,
        w7: 6023,
        w8: 12014,
        w9: 24015,
        cards: 9180,
        coins: 67143
    }, {
        w0: 800,
        w1: 1421,
        w2: 1817,
        w3: 1307,
        w4: 1625,
        w5: 2805,
        w6: 3947,
        w7: 6066,
        w8: 12107,
        w9: 24180,
        cards: 9316,
        coins: 68148
    }, {
        w0: 807,
        w1: 1430,
        w2: 1830,
        w3: 1319,
        w4: 1637,
        w5: 2832,
        w6: 3971,
        w7: 6111,
        w8: 12204,
        w9: 24348,
        cards: 9453,
        coins: 69161
    }, {
        w0: 813,
        w1: 1439,
        w2: 1842,
        w3: 1326,
        w4: 1649,
        w5: 2855,
        w6: 4008,
        w7: 6156,
        w8: 12293,
        w9: 24537,
        cards: 9591,
        coins: 70181
    }, {
        w0: 821,
        w1: 1451,
        w2: 1854,
        w3: 1335,
        w4: 1661,
        w5: 2876,
        w6: 4035,
        w7: 6203,
        w8: 12380,
        w9: 24729,
        cards: 9730,
        coins: 71209
    }, {
        w0: 828,
        w1: 1460,
        w2: 1868,
        w3: 1343,
        w4: 1671,
        w5: 2892,
        w6: 4064,
        w7: 6254,
        w8: 12470,
        w9: 24923,
        cards: 9870,
        coins: 72244
    }, {
        w0: 836,
        w1: 1472,
        w2: 1881,
        w3: 1353,
        w4: 1682,
        w5: 2913,
        w6: 4095,
        w7: 6299,
        w8: 12563,
        w9: 25098,
        cards: 10011,
        coins: 73287
    }, {
        w0: 843,
        w1: 1484,
        w2: 1895,
        w3: 1361,
        w4: 1695,
        w5: 2930,
        w6: 4128,
        w7: 6350,
        w8: 12654,
        w9: 25271,
        cards: 10153,
        coins: 74337
    }, {
        w0: 849,
        w1: 1493,
        w2: 1907,
        w3: 1368,
        w4: 1707,
        w5: 2954,
        w6: 4164,
        w7: 6398,
        w8: 12746,
        w9: 25455,
        cards: 10296,
        coins: 75395
    }, {
        w0: 854,
        w1: 1503,
        w2: 1920,
        w3: 1379,
        w4: 1718,
        w5: 2972,
        w6: 4190,
        w7: 6447,
        w8: 12836,
        w9: 25622,
        cards: 10440,
        coins: 76460
    }, {
        w0: 860,
        w1: 1514,
        w2: 1935,
        w3: 1386,
        w4: 1728,
        w5: 2987,
        w6: 4215,
        w7: 6497,
        w8: 12924,
        w9: 25808,
        cards: 10585,
        coins: 77533
    }, {
        w0: 864,
        w1: 1526,
        w2: 1949,
        w3: 1394,
        w4: 1740,
        w5: 3005,
        w6: 4244,
        w7: 6546,
        w8: 13013,
        w9: 25982,
        cards: 10731,
        coins: 78613
    }, {
        w0: 869,
        w1: 1535,
        w2: 1964,
        w3: 1406,
        w4: 1752,
        w5: 3024,
        w6: 4278,
        w7: 6594,
        w8: 13101,
        w9: 26168,
        cards: 10878,
        coins: 79701
    }, {
        w0: 875,
        w1: 1547,
        w2: 1979,
        w3: 1413,
        w4: 1766,
        w5: 3041,
        w6: 4308,
        w7: 6644,
        w8: 13191,
        w9: 26363,
        cards: 11026,
        coins: 80796
    }, {
        w0: 882,
        w1: 1557,
        w2: 1992,
        w3: 1422,
        w4: 1778,
        w5: 3066,
        w6: 4338,
        w7: 6684,
        w8: 13280,
        w9: 26550,
        cards: 11175,
        coins: 81899
    }, {
        w0: 890,
        w1: 1568,
        w2: 2007,
        w3: 1431,
        w4: 1791,
        w5: 3086,
        w6: 4365,
        w7: 6735,
        w8: 13365,
        w9: 26729,
        cards: 11325,
        coins: 83009
    }, {
        w0: 894,
        w1: 1580,
        w2: 2021,
        w3: 1439,
        w4: 1803,
        w5: 3113,
        w6: 4388,
        w7: 6780,
        w8: 13454,
        w9: 26918,
        cards: 11476,
        coins: 84127
    }, {
        w0: 899,
        w1: 1592,
        w2: 2033,
        w3: 1451,
        w4: 1814,
        w5: 3137,
        w6: 4412,
        w7: 6822,
        w8: 13548,
        w9: 27089,
        cards: 11628,
        coins: 85252
    }, {
        w0: 906,
        w1: 1604,
        w2: 2046,
        w3: 1461,
        w4: 1827,
        w5: 3158,
        w6: 4445,
        w7: 6869,
        w8: 13635,
        w9: 27267,
        cards: 11781,
        coins: 86385
    }, {
        w0: 914,
        w1: 1613,
        w2: 2060,
        w3: 1472,
        w4: 1838,
        w5: 3185,
        w6: 4473,
        w7: 6917,
        w8: 13730,
        w9: 27441,
        cards: 11935,
        coins: 87525
    }, {
        w0: 921,
        w1: 1623,
        w2: 2075,
        w3: 1482,
        w4: 1848,
        w5: 3200,
        w6: 4497,
        w7: 6965,
        w8: 13817,
        w9: 27635,
        cards: 12090,
        coins: 88673
    }, {
        w0: 929,
        w1: 1634,
        w2: 2087,
        w3: 1491,
        w4: 1859,
        w5: 3216,
        w6: 4532,
        w7: 7016,
        w8: 13904,
        w9: 27813,
        cards: 12246,
        coins: 89828
    }, {
        w0: 936,
        w1: 1644,
        w2: 2102,
        w3: 1500,
        w4: 1872,
        w5: 3233,
        w6: 4565,
        w7: 7061,
        w8: 14001,
        w9: 27995,
        cards: 12403,
        coins: 90991
    }, {
        w0: 944,
        w1: 1656,
        w2: 2115,
        w3: 1508,
        w4: 1883,
        w5: 3260,
        w6: 4595,
        w7: 7101,
        w8: 14090,
        w9: 28166,
        cards: 12561,
        coins: 92161
    }, {
        w0: 950,
        w1: 1667,
        w2: 2127,
        w3: 1515,
        w4: 1896,
        w5: 3281,
        w6: 4631,
        w7: 7143,
        w8: 14181,
        w9: 28340,
        cards: 12720,
        coins: 93339
    }, {
        w0: 956,
        w1: 1676,
        w2: 2141,
        w3: 1523,
        w4: 1908,
        w5: 3303,
        w6: 4658,
        w7: 7184,
        w8: 14274,
        w9: 28518,
        cards: 12880,
        coins: 94524
    }, {
        w0: 962,
        w1: 1688,
        w2: 2156,
        w3: 1532,
        w4: 1919,
        w5: 3330,
        w6: 4685,
        w7: 7224,
        w8: 14372,
        w9: 28703,
        cards: 13041,
        coins: 95717
    }, {
        w0: 968,
        w1: 1698,
        w2: 2168,
        w3: 1542,
        w4: 1929,
        w5: 3356,
        w6: 4713,
        w7: 7272,
        w8: 14457,
        w9: 28874,
        cards: 13203,
        coins: 96917
    }, {
        w0: 972,
        w1: 1709,
        w2: 2181,
        w3: 1550,
        w4: 1943,
        w5: 3383,
        w6: 4746,
        w7: 7316,
        w8: 14541,
        w9: 29039,
        cards: 13366,
        coins: 98125
    }, {
        w0: 980,
        w1: 1721,
        w2: 2193,
        w3: 1557,
        w4: 1956,
        w5: 3408,
        w6: 4781,
        w7: 7367,
        w8: 14628,
        w9: 29214,
        cards: 13530,
        coins: 99340
    }, {
        w0: 984,
        w1: 1731,
        w2: 2208,
        w3: 1569,
        w4: 1967,
        w5: 3429,
        w6: 4812,
        w7: 7418,
        w8: 14712,
        w9: 29399,
        cards: 13695,
        coins: 100563
    }, {
        w0: 989,
        w1: 1740,
        w2: 2220,
        w3: 1577,
        w4: 1980,
        w5: 3455,
        w6: 4850,
        w7: 7461,
        w8: 14810,
        w9: 29576,
        cards: 13861,
        coins: 101793
    }, {
        w0: 993,
        w1: 1751,
        w2: 2232,
        w3: 1587,
        w4: 1992,
        w5: 3474,
        w6: 4886,
        w7: 7509,
        w8: 14897,
        w9: 29753,
        cards: 14028,
        coins: 103031
    }, {
        w0: 1001,
        w1: 1760,
        w2: 2244,
        w3: 1596,
        w4: 2006,
        w5: 3492,
        w6: 4913,
        w7: 7557,
        w8: 14979,
        w9: 29930,
        cards: 14196,
        coins: 104276
    }, {
        w0: 1007,
        w1: 1769,
        w2: 2258,
        w3: 1605,
        w4: 2019,
        w5: 3510,
        w6: 4941,
        w7: 7608,
        w8: 15071,
        w9: 30119,
        cards: 14365,
        coins: 105529
    }, {
        w0: 1013,
        w1: 1781,
        w2: 2270,
        w3: 1613,
        w4: 2030,
        w5: 3527,
        w6: 4970,
        w7: 7656,
        w8: 15162,
        w9: 30308,
        cards: 14535,
        coins: 106789
    }, {
        w0: 1020,
        w1: 1793,
        w2: 2285,
        w3: 1625,
        w4: 2040,
        w5: 3545,
        w6: 4997,
        w7: 7704,
        w8: 15258,
        w9: 30477,
        cards: 14706,
        coins: 108057
    }, {
        w0: 1028,
        w1: 1805,
        w2: 2297,
        w3: 1637,
        w4: 2051,
        w5: 3560,
        w6: 5021,
        w7: 7751,
        w8: 15356,
        w9: 30653,
        cards: 14878,
        coins: 109332
    }, {
        w0: 1035,
        w1: 1815,
        w2: 2310,
        w3: 1646,
        w4: 2064,
        w5: 3582,
        w6: 5057,
        w7: 7793,
        w8: 15441,
        w9: 30821,
        cards: 15051,
        coins: 110615
    }, {
        w0: 1041,
        w1: 1826,
        w2: 2324,
        w3: 1656,
        w4: 2078,
        w5: 3605,
        w6: 5079,
        w7: 7835,
        w8: 15525,
        w9: 31004,
        cards: 15225,
        coins: 111905
    }, {
        w0: 1049,
        w1: 1836,
        w2: 2339,
        w3: 1664,
        w4: 2091,
        w5: 3621,
        w6: 5117,
        w7: 7886,
        w8: 15615,
        w9: 31173,
        cards: 15400,
        coins: 113203
    }, {
        w0: 1053,
        w1: 1848,
        w2: 2354,
        w3: 1676,
        w4: 2102,
        w5: 3639,
        w6: 5153,
        w7: 7931,
        w8: 15704,
        w9: 31359,
        cards: 15576,
        coins: 114508
    }, {
        w0: 1058,
        w1: 1859,
        w2: 2367,
        w3: 1686,
        w4: 2114,
        w5: 3663,
        w6: 5178,
        w7: 7980,
        w8: 15797,
        w9: 31538,
        cards: 15753,
        coins: 115821
    }, {
        w0: 1062,
        w1: 1871,
        w2: 2381,
        w3: 1697,
        w4: 2124,
        w5: 3678,
        w6: 5205,
        w7: 8027,
        w8: 15882,
        w9: 31725,
        cards: 15931,
        coins: 117141
    }, {
        w0: 1067,
        w1: 1881,
        w2: 2393,
        w3: 1707,
        w4: 2138,
        w5: 3699,
        w6: 5241,
        w7: 8072,
        w8: 15972,
        w9: 31902,
        cards: 16110,
        coins: 118469
    }, {
        w0: 1071,
        w1: 1890,
        w2: 2408,
        w3: 1716,
        w4: 2151,
        w5: 3714,
        w6: 5270,
        w7: 8114,
        w8: 16058,
        w9: 32085,
        cards: 16290,
        coins: 119804
    }, {
        w0: 1076,
        w1: 1901,
        w2: 2420,
        w3: 1728,
        w4: 2162,
        w5: 3732,
        w6: 5304,
        w7: 8163,
        w8: 16155,
        w9: 32262,
        cards: 16471,
        coins: 121147
    }, {
        w0: 1082,
        w1: 1910,
        w2: 2435,
        w3: 1737,
        w4: 2172,
        w5: 3759,
        w6: 5334,
        w7: 8204,
        w8: 16242,
        w9: 32442,
        cards: 16653,
        coins: 122497
    }, {
        w0: 1088,
        w1: 1919,
        w2: 2448,
        w3: 1745,
        w4: 2186,
        w5: 3786,
        w6: 5364,
        w7: 8250,
        w8: 16337,
        w9: 32636,
        cards: 16836,
        coins: 123855
    }, {
        w0: 1095,
        w1: 1929,
        w2: 2462,
        w3: 1755,
        w4: 2198,
        w5: 3807,
        w6: 5397,
        w7: 8300,
        w8: 16431,
        w9: 32805,
        cards: 17020,
        coins: 125220
    }, {
        w0: 1100,
        w1: 1940,
        w2: 2477,
        w3: 1767,
        w4: 2208,
        w5: 3824,
        w6: 5427,
        w7: 8348,
        w8: 16529,
        w9: 32975,
        cards: 17205,
        coins: 126593
    }, {
        w0: 1107,
        w1: 1952,
        w2: 2489,
        w3: 1776,
        w4: 2222,
        w5: 3851,
        w6: 5457,
        w7: 8390,
        w8: 16622,
        w9: 33159,
        cards: 17391,
        coins: 127973
    }, {
        w0: 1112,
        w1: 1961,
        w2: 2501,
        w3: 1787,
        w4: 2235,
        w5: 3872,
        w6: 5492,
        w7: 8439,
        w8: 16707,
        w9: 33354,
        cards: 17578,
        coins: 129361
    }, {
        w0: 1118,
        w1: 1971,
        w2: 2513,
        w3: 1796,
        w4: 2249,
        w5: 3890,
        w6: 5526,
        w7: 8483,
        w8: 16793,
        w9: 33521,
        cards: 17766,
        coins: 130756
    }, {
        w0: 1125,
        w1: 1980,
        w2: 2528,
        w3: 1806,
        w4: 2262,
        w5: 3908,
        w6: 5558,
        w7: 8531,
        w8: 16877,
        w9: 33701,
        cards: 17955,
        coins: 132159
    }, {
        w0: 1133,
        w1: 1992,
        w2: 2541,
        w3: 1815,
        w4: 2274,
        w5: 3935,
        w6: 5583,
        w7: 8580,
        w8: 16970,
        w9: 33867,
        cards: 18145,
        coins: 133569
    }, {
        w0: 1139,
        w1: 2004,
        w2: 2555,
        w3: 1826,
        w4: 2288,
        w5: 3956,
        w6: 5619,
        w7: 8630,
        w8: 17054,
        w9: 34035,
        cards: 18336,
        coins: 134987
    }, {
        w0: 1143,
        w1: 2015,
        w2: 2570,
        w3: 1833,
        w4: 2300,
        w5: 3975,
        w6: 5642,
        w7: 8670,
        w8: 17142,
        w9: 34206,
        cards: 18528,
        coins: 136412
    }, {
        w0: 1151,
        w1: 2025,
        w2: 2583,
        w3: 1845,
        w4: 2312,
        w5: 3995,
        w6: 5673,
        w7: 8721,
        w8: 17235,
        w9: 34376,
        cards: 18721,
        coins: 137845
    }, {
        w0: 1155,
        w1: 2037,
        w2: 2598,
        w3: 1854,
        w4: 2324,
        w5: 4019,
        w6: 5703,
        w7: 8769,
        w8: 17318,
        w9: 34559,
        cards: 18915,
        coins: 139285
    }, {
        w0: 1160,
        w1: 2048,
        w2: 2613,
        w3: 1865,
        w4: 2334,
        w5: 4043,
        w6: 5730,
        w7: 8817,
        w8: 17411,
        w9: 34752,
        cards: 19110,
        coins: 140733
    }, {
        w0: 1164,
        w1: 2057,
        w2: 2627,
        w3: 1875,
        w4: 2346,
        w5: 4067,
        w6: 5756,
        w7: 8858,
        w8: 17507,
        w9: 34929,
        cards: 19306,
        coins: 142188
    }, {
        w0: 1170,
        w1: 2067,
        w2: 2640,
        w3: 1883,
        w4: 2360,
        w5: 4092,
        w6: 5784,
        w7: 8898,
        w8: 17591,
        w9: 35102,
        cards: 19503,
        coins: 143651
    }, {
        w0: 1175,
        w1: 2079,
        w2: 2652,
        w3: 1893,
        w4: 2373,
        w5: 4115,
        w6: 5819,
        w7: 8945,
        w8: 17682,
        w9: 35268,
        cards: 19701,
        coins: 145121
    }, {
        w0: 1182,
        w1: 2088,
        w2: 2666,
        w3: 1902,
        w4: 2384,
        w5: 4139,
        w6: 5853,
        w7: 8987,
        w8: 17777,
        w9: 35439,
        cards: 19900,
        coins: 146599
    }, {
        w0: 1188,
        w1: 2097,
        w2: 2679,
        w3: 1910,
        w4: 2397,
        w5: 4155,
        w6: 5882,
        w7: 9027,
        w8: 17861,
        w9: 35625,
        cards: 20100,
        coins: 148084
    }, {
        w0: 1194,
        w1: 2109,
        w2: 2691,
        w3: 1920,
        w4: 2408,
        w5: 4172,
        w6: 5916,
        w7: 9069,
        w8: 17952,
        w9: 35810,
        cards: 20301,
        coins: 149577
    }, {
        w0: 1200,
        w1: 2118,
        w2: 2705,
        w3: 1929,
        w4: 2420,
        w5: 4196,
        w6: 5946,
        w7: 9120,
        w8: 18035,
        w9: 35999,
        cards: 20503,
        coins: 151077
    } ]
};

window["buy_weapons"] = {
    "0": {
        name: "Трассирующие снаряды",
        lots: [ {
            count: 1,
            price: 7
        }, {
            count: 3,
            price: 21
        }, {
            count: 5,
            price: 35
        }, {
            count: 10,
            price: 70
        }, {
            count: 20,
            price: 140
        }, {
            count: 50,
            price: 350
        }, {
            count: 100,
            price: 700
        }, {
            count: 500,
            price: 3500
        } ]
    },
    "1": {
        name: "Осколочные снаряды",
        lots: [ {
            count: 1,
            price: 8
        }, {
            count: 3,
            price: 24
        }, {
            count: 5,
            price: 40
        }, {
            count: 10,
            price: 80
        }, {
            count: 20,
            price: 160
        }, {
            count: 50,
            price: 400
        }, {
            count: 100,
            price: 800
        }, {
            count: 500,
            price: 4e3
        } ]
    },
    "2": {
        name: "Разрывные снаряды",
        lots: [ {
            count: 1,
            price: 10
        }, {
            count: 3,
            price: 30
        }, {
            count: 5,
            price: 50
        }, {
            count: 10,
            price: 100
        }, {
            count: 20,
            price: 200
        }, {
            count: 50,
            price: 500
        }, {
            count: 100,
            price: 1e3
        }, {
            count: 500,
            price: 5e3
        } ]
    },
    "3": {
        name: "Зажигательные снаряды",
        lots: [ {
            count: 1,
            price: 12
        }, {
            count: 3,
            price: 36
        }, {
            count: 5,
            price: 60
        }, {
            count: 10,
            price: 120
        }, {
            count: 20,
            price: 240
        }, {
            count: 50,
            price: 600
        }, {
            count: 100,
            price: 1200
        }, {
            count: 500,
            price: 6e3
        } ]
    },
    "4": {
        name: "Фугасные снаряды",
        lots: [ {
            count: 1,
            price: 18
        }, {
            count: 3,
            price: 54
        }, {
            count: 5,
            price: 90
        }, {
            count: 10,
            price: 180
        }, {
            count: 20,
            price: 360
        }, {
            count: 50,
            price: 900
        }, {
            count: 100,
            price: 1800
        }, {
            count: 500,
            price: 9e3
        } ]
    },
    "5": {
        name: "Бронебойные снаряды",
        lots: [ {
            count: 1,
            price: 25
        }, {
            count: 3,
            price: 75
        }, {
            count: 5,
            price: 125
        }, {
            count: 10,
            price: 250
        }, {
            count: 20,
            price: 500
        }, {
            count: 50,
            price: 1250
        }, {
            count: 100,
            price: 2500
        }, {
            count: 500,
            price: 12500
        } ]
    },
    "6": {
        name: "Кумулятивные снаряды",
        lots: [ {
            count: 1,
            price: 40
        }, {
            count: 3,
            price: 120
        }, {
            count: 5,
            price: 200
        }, {
            count: 10,
            price: 400
        }, {
            count: 20,
            price: 800
        }, {
            count: 50,
            price: 2e3
        }, {
            count: 100,
            price: 4e3
        }, {
            count: 500,
            price: 2e4
        } ]
    }
};

window["tops_reward"] = {
    damage: [ {
        title: "ТОП-1",
        place: 1,
        reward: {
            tokens: 3e3,
            box_count: 1,
            box_type: 5
        }
    }, {
        title: "ТОП-2",
        place: 2,
        reward: {
            tokens: 2500,
            box_count: 1,
            box_type: 5
        }
    }, {
        title: "ТОП-3",
        place: 3,
        reward: {
            tokens: 2e3,
            box_count: 1,
            box_type: 5
        }
    }, {
        title: "ТОП-4",
        place: 4,
        reward: {
            tokens: 1e3,
            box_count: 1,
            box_type: 4
        }
    }, {
        title: "ТОП-5",
        place: 5,
        reward: {
            tokens: 900,
            box_count: 1,
            box_type: 4
        }
    }, {
        title: "ТОП-6",
        place: 6,
        reward: {
            tokens: 800,
            box_count: 1,
            box_type: 4
        }
    }, {
        title: "ТОП-7",
        place: 7,
        reward: {
            tokens: 700,
            box_count: 1,
            box_type: 4
        }
    }, {
        title: "ТОП-8",
        place: 8,
        reward: {
            tokens: 600,
            box_count: 1,
            box_type: 4
        }
    }, {
        title: "ТОП-9",
        place: 9,
        reward: {
            tokens: 500,
            box_count: 1,
            box_type: 4
        }
    }, {
        title: "ТОП-10",
        place: 10,
        reward: {
            tokens: 400,
            box_count: 1,
            box_type: 4
        }
    }, {
        title: "ТОП-50",
        place_min: 11,
        place_max: 50,
        reward: {
            tokens: 100,
            box_count: 2,
            box_type: 3
        }
    }, {
        title: "ТОП-100",
        place_min: 51,
        place_max: 100,
        reward: {
            tokens: 50,
            box_count: 1,
            box_type: 3
        }
    } ],
    boss_0: [ {
        place: 1,
        reward: {
            tokens: 50,
            box_count: 5,
            box_type: 2
        }
    }, {
        place: 2,
        reward: {
            tokens: 40,
            box_count: 4,
            box_type: 2
        }
    }, {
        place: 3,
        reward: {
            tokens: 30,
            box_count: 3,
            box_type: 2
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 10,
            box_count: 1,
            box_type: 2
        }
    } ],
    boss_1: [ {
        place: 1,
        reward: {
            tokens: 50,
            box_count: 5,
            box_type: 2
        }
    }, {
        place: 2,
        reward: {
            tokens: 40,
            box_count: 4,
            box_type: 2
        }
    }, {
        place: 3,
        reward: {
            tokens: 30,
            box_count: 3,
            box_type: 2
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 10,
            box_count: 1,
            box_type: 2
        }
    } ],
    boss_2: [ {
        place: 1,
        reward: {
            tokens: 50,
            box_count: 5,
            box_type: 2
        }
    }, {
        place: 2,
        reward: {
            tokens: 40,
            box_count: 4,
            box_type: 2
        }
    }, {
        place: 3,
        reward: {
            tokens: 30,
            box_count: 3,
            box_type: 2
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 10,
            box_count: 1,
            box_type: 2
        }
    } ],
    boss_3: [ {
        place: 1,
        reward: {
            tokens: 100,
            box_count: 5,
            box_type: 2
        }
    }, {
        place: 2,
        reward: {
            tokens: 80,
            box_count: 4,
            box_type: 2
        }
    }, {
        place: 3,
        reward: {
            tokens: 60,
            box_count: 3,
            box_type: 2
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 20,
            box_count: 1,
            box_type: 2
        }
    } ],
    boss_4: [ {
        place: 1,
        reward: {
            tokens: 100,
            box_count: 5,
            box_type: 2
        }
    }, {
        place: 2,
        reward: {
            tokens: 80,
            box_count: 4,
            box_type: 2
        }
    }, {
        place: 3,
        reward: {
            tokens: 60,
            box_count: 3,
            box_type: 2
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 20,
            box_count: 1,
            box_type: 2
        }
    } ],
    boss_5: [ {
        place: 1,
        reward: {
            tokens: 100,
            box_count: 4,
            box_type: 3
        }
    }, {
        place: 2,
        reward: {
            tokens: 80,
            box_count: 3,
            box_type: 3
        }
    }, {
        place: 3,
        reward: {
            tokens: 60,
            box_count: 2,
            box_type: 3
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 20,
            box_count: 2,
            box_type: 2
        }
    } ],
    boss_6: [ {
        place: 1,
        reward: {
            tokens: 150,
            box_count: 4,
            box_type: 3
        }
    }, {
        place: 2,
        reward: {
            tokens: 120,
            box_count: 3,
            box_type: 3
        }
    }, {
        place: 3,
        reward: {
            tokens: 90,
            box_count: 2,
            box_type: 3
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 30,
            box_count: 2,
            box_type: 2
        }
    } ],
    boss_7: [ {
        place: 1,
        reward: {
            tokens: 150,
            box_count: 4,
            box_type: 3
        }
    }, {
        place: 2,
        reward: {
            tokens: 120,
            box_count: 3,
            box_type: 3
        }
    }, {
        place: 3,
        reward: {
            tokens: 90,
            box_count: 2,
            box_type: 3
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 30,
            box_count: 2,
            box_type: 2
        }
    } ],
    boss_8: [ {
        place: 1,
        reward: {
            tokens: 150,
            box_count: 4,
            box_type: 3
        }
    }, {
        place: 2,
        reward: {
            tokens: 120,
            box_count: 3,
            box_type: 3
        }
    }, {
        place: 3,
        reward: {
            tokens: 90,
            box_count: 2,
            box_type: 3
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 30,
            box_count: 2,
            box_type: 2
        }
    } ],
    boss_9: [ {
        place: 1,
        reward: {
            tokens: 200,
            box_count: 3,
            box_type: 4
        }
    }, {
        place: 2,
        reward: {
            tokens: 160,
            box_count: 2,
            box_type: 4
        }
    }, {
        place: 3,
        reward: {
            tokens: 120,
            box_count: 1,
            box_type: 4
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 40,
            box_count: 4,
            box_type: 2
        }
    } ],
    boss_10: [ {
        place: 1,
        reward: {
            tokens: 250,
            box_count: 3,
            box_type: 4
        }
    }, {
        place: 2,
        reward: {
            tokens: 200,
            box_count: 2,
            box_type: 4
        }
    }, {
        place: 3,
        reward: {
            tokens: 150,
            box_count: 1,
            box_type: 4
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 50,
            box_count: 4,
            box_type: 2
        }
    } ],
    boss_14: [ {
        place: 1,
        reward: {
            tokens: 100,
            box_count: 5,
            box_type: 8
        }
    }, {
        place: 2,
        reward: {
            tokens: 60,
            box_count: 4,
            box_type: 8
        }
    }, {
        place: 3,
        reward: {
            tokens: 40,
            box_count: 3,
            box_type: 8
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 20,
            box_count: 1,
            box_type: 8
        }
    } ],
    boss_15: [ {
        place: 1,
        reward: {
            tokens: 100,
            box_count: 5,
            box_type: 9
        }
    }, {
        place: 2,
        reward: {
            tokens: 60,
            box_count: 4,
            box_type: 9
        }
    }, {
        place: 3,
        reward: {
            tokens: 40,
            box_count: 3,
            box_type: 9
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 20,
            box_count: 1,
            box_type: 9
        }
    } ],
    boss_18: [ {
        place: 1,
        reward: {
            tokens: 200,
            box_count: 10,
            box_type: 8
        }
    }, {
        place: 2,
        reward: {
            tokens: 150,
            box_count: 8,
            box_type: 8
        }
    }, {
        place: 3,
        reward: {
            tokens: 100,
            box_count: 6,
            box_type: 8
        }
    }, {
        place_min: 4,
        place_max: 10,
        reward: {
            tokens: 50,
            box_count: 3,
            box_type: 8
        }
    } ]
};

window["daily_reward"] = {
    "0": {
        count: 300,
        name: "Монеты",
        icon: "coin_3",
        resource: "coins"
    },
    "1": {
        count: 50,
        name: "Снабжение",
        icon: "supply_2",
        resource: "supply"
    },
    "2": {
        count: 400,
        name: "Опыт",
        icon: "experience_2",
        resource: "experience"
    },
    "3": {
        count: 7,
        name: "Коллекции",
        icon: "collections",
        resource: "collections"
    },
    "4": {
        count: 600,
        name: "Монеты",
        icon: "coin_3",
        resource: "coins"
    },
    "5": {
        count: 2,
        name: "Ящики",
        icon: "boxes",
        resource: "boxes_2"
    },
    "6": {
        count: 7,
        name: "Снаряды",
        icon: "weapons",
        resource: "weapons"
    }
};

if (Math["floor"](Date["now"]() / 1e3) < 1651363200) window["calendar_old_moth"] = {
    min: 28,
    max: 31
}; else window["calendar_old_moth"] = {
    min: 25,
    max: 30
};

window["calendar_months"] = {
    "0": {
        name: "январь",
        name_r: "января",
        count_days: 31,
        holidays: "<p><span>5 — 16 января 1944г.</span> - Кировоградская операция. После напряженных боев 8 января войска 2-го Украинского фронта овладели Кировоградом и продолжали наступление. Однако, 16 января, отражая сильные контрудары врага, были вынуждены перейти к обороне. В результате Кировоградской операции положение немецко-фашистских войск в полосе действий 2-го Украинского фронта значительно ухудшилось.</p><p><span>12 – 18 января 1943г.</span> – Начало наступательной операции войск Ленинградского и Волховского фронтов во взаимодействии с Балтийским флотом. Прорыв блокады Ленинграда.</p><p><span>17 января 1945г.</span> - Освобождена Варшава. Фашисты буквально стерли город с лица земли, а местных жителей подвергли беспощадному уничтожению.</p><p><span>27 января 1944г.</span> – День полного освобождения Ленинграда от фашистской блокады.</p><p><span>27 января 1945г.</span> – Советские войска освободили узников фашистского концлагеря в Освенциме.</p><p><span>27 января 1944г.</span> - День полного освобождения советскими войсками города Ленинграда от блокады его немецко-фашистскими войсками.</p><p><span>30 января – 9 апреля 1945г.</span> – Разгром немецкой группировки в Кенигсберге (ныне Калининград). Это был кульминационный момент Восточно-Прусской операции.</p>"
    },
    "1": {
        name: "февраль",
        name_r: "февраля",
        count_days: 28,
        holidays: "<p><span>2 февраля 1943г.</span> – День разгрома советскими войсками немецко-фашистских войск в Сталинградской битве.</p><p><span>4-11 февраля 1945г.</span> – Крымская (Ялтинская) конференция глав правительств СССР, США, Великобритания.</p><p><span>29 февраля 1944г.</span> – Бандеровцами был тяжело ранен командующий 1-м Украинским фронтом генерал Николай Федорович Ватутин. К сожалению, спасти этого талантливого полководца не удалось. Он скончался 15 апреля.</p>"
    },
    "2": {
        name: "март",
        name_r: "марта",
        count_days: 31,
        holidays: "<p><span>16 марта — 15 апреля 1945г.</span> – Венская наступательная операция. В январе-марте 1945г. в результате проведенных Красной Армией Будапештской и Балатонской операций войска 3-го Украинского фронта разгромили противника в центральной части Венгрии и продвигались на запад.</p><p><span>26 марта 1944г.</span> – Советские войска вышли на границу СССР.</p><p><span>26 марта 1944г.</span> – Началась Одесская наступательная операция. Наступление войск 3-го Украинского фронта под командованием Р. Я. Малиновского с целью разгрома приморской группировки вермахта, и освобождения Одессы.</p><p><span>27 марта 1944г.</span> – Вступление советских войск на территорию Румынии.</p>"
    },
    "3": {
        name: "апрель",
        name_r: "апреля",
        count_days: 30,
        holidays: "<p><span>4 апреля 1945г.</span> – Советские войска завершили освобождение Венгрии и развернули наступление на Вену.</p><p><span>5 апреля 1943г.</span> – Французская эскадрилья «Нормандия» впервые вступила в бой.</p><p><span>5 апреля 1945г.</span> – Встреча советских и американских войск на реке Эльбе.</p><p><span>8 – 30 апреля 1944г.</span> – Крымская наступательная операция.</p><p><span>6 апреля 1945г.</span> – Начался штурм Кенигсберга. 9 апреля гарнизон крепости капитулировал. Завершение штурма Кенигсберга Москва отметила салютом высшей категории — 24 артиллерийскими залпами из 324 орудий.</p><p><span>11 апреля 1945г.</span> – День освобождения узников фашистских концлагерей.</p><p><span>16 апреля 1945г.</span> - Начало Берлинской наступательной операции.</p><p><span>20 апреля 1945г.</span> – Начался штурм Берлина. Дальнобойная артиллерия наших войск открыла огонь по городу.</p><p><span>20 апреля 1942г.</span> – День завершения Московской битвы.</p><p><span>30 апреля 1945г.</span> – Советские воины водрузили Знамя Победы над рейхстагом в Берлине.</p><p><span>30 апреля</span> — День памяти жертв Холокоста.</p>"
    },
    "4": {
        name: "май",
        name_r: "мая",
        count_days: 31,
        holidays: "<p><span>2 мая 1945г.</span> – Разгром берлинской группировки вермахта.</p><p><span>6 мая 1945г.</span> – В день святого великомученика Георгия Победоносца гросс-адмирал Дениц, являвшийся главой Германского государства после самоубийства Гитлера, дал согласие на капитуляцию вермахта, Германия признала себя побежденной.<p><span>6–12 мая 1945г.</span> – Начало Пражской наступательной операции и освобождения Праги от врага.</p><p><span>8 мая</span> – Завершение Берлинской наступательной операции и подписания акта о безоговорочной капитуляции фашистской Германии.</p><p><span>9 мая 1944г.</span> – Освобождение Севастополя. Остатки немецких войск бежали на мыс Херсонес, надеясь спастись морем. Но 12 мая были полностью разгомлены. На мысе Херсонес были пленены 21 тысяч солдат и офицеров противника, захвачено большое количество вооружения и боевой техники.</p><p><span>9 мая</span> – Установление Праздника Победы советского народа в Великой Отечественной войне (1941–1945).</p><p><span>30 мая 1942г.</span> – В СССР создан штаб партизанского движения.</p>"
    },
    "5": {
        name: "июнь",
        name_r: "июня",
        count_days: 30,
        holidays: "<p><span>6 июня – 24 июля 1944г.</span> – Нормандская десантная операция союзных войск. Открытие второго фронта.</p><p><span>6 июня 1945г.</span> – Президиум Верховного Совета СССР принял Указ «Об учреждении медали «За доблестный труд в Великой Отечественной войне 1941-1945 гг.». Впоследствии ею награждено около 16 миллионов человек.</p><p><span>22 июня</span> – День памяти и скорби – начало Великой Отечественной войны (1941–1945).</p><p><span>22 июня 1941г.</span> – В первый день войны советскими летчиками совершено 16 воздушных таранов немецких самолетов.</p><p><span>22 июня – 20 июля 1941г.</span> – Героическая оборона Брестской крепости.</p><p><span>23 июня - 29 августа 1944г.</span> – Белорусская стратегическая наступательная операция советских войск в Белоруссии и Литве «Багратион».</p><p><span>24 июня 1941г.</span> – Образовано Советское информационное агентство – Совинформбюро.</p><p><span>24 июня 1941г.</span> – Президент США Ф.Д. Рузвельт, руководитель движения «Свободная Франция» генерал Шарль де Голль заявили о поддержке советского народа в борьбе с фашизмом.</p><p><span>24 июня 1945г.</span> – В 10 часов утра на Красной площади в Москве состоялся первый парад Победы советского народа над фашизмом в Великой Отечественной войне.</p><p><span>26 июня 1941г.</span> – День подвига Николая Францевича Гастелло (1908–1941), Героя Советского Союза.</p><p><span>29 июня</span> – День партизан и подпольщиков.</p>"
    },
    "6": {
        name: "июль",
        name_r: "июля",
        count_days: 31,
        holidays: "<p><span>Июль 1942г. – март 1943г.</span> – Ржевская битва.</p><p><span>3 июля 1944г.</span> – Советские войска освободили Минск.</p><p><span>5 июля – 23 августа 1943г.</span> – Курская битва.</p><p><span>10 июля – 10 сентября 1941г.</span> – Смоленское сражение.</p><p><span>10 июля 1941г. – 9 августа 1944г.</span> – Битва за Ленинград.</p><p><span>12 июля 1943г.</span> – Начало контрнаступление советских войск на Курской дуге.</p><p><span>12 июля 1943г.</span> – Танковое сражение в районе с.Прохоровка – крупнейшее в Великой Отечественной войне. С обеих сторон в нем участвовали до 1200 танков.</p><p><span>13 июля 1944г.</span> – Советские войска освободили Вильнюс.</p><p><span>15 июля 1942г.</span> – На оккупированной территории Белоруссии сформирована партизанская бригада К.С. Заслонова.</p><p><span>17 июля 1942г.</span> – Началась Сталинградская битва.</p><p><span>17 июля 1944г.</span> – в Москве состоялся «Парад побежденных» — по нашей столице под конвоем провели 57 тысяч немецких солдат и офицеров, захваченных в плен в ходе Белорусской наступательной операции.</p><p><span>17 июля 1944г.</span> – Советские войска вступили на территорию Польши.</p><p><span>17 июля 1945г.</span> – Берлинская (Потсдамская) конференция руководителей трех союзных держав – СССР, США и Великобритании.</p><p><span>18 июля 1941г.</span> – ЦК ВКП (б) принял постановление «Об организации борьбы в тылу врага».</p><p><span>23 июля 1943г.</span> – Битва на Курской дуге закончилась разгромом немецких войск.</p><p><span>25 июля 1942г.</span> – Начало битвы за Кавказ.</p><p><span>28 июля 1942г.</span> – Издан Приказ наркома обороны СССР № 227 – «Ни шагу назад!».</p><p><span>29 июля 1942г.</span> – Президиум Верховного Совета СССР принял Указ «Об учреждении военных орденов Суворова, Кутузова, Александра Невского».</p>"
    },
    "7": {
        name: "август",
        name_r: "августа",
        count_days: 31,
        holidays: "<p><span>5 августа – 16 октября 1941г.</span> – Героическая оборона г.Одессы.</p><p><span>5 августа 1943г.</span> – Первый артиллерийский салют в Москве в ознаменование освобождения городов Орла и Белгород.</p><p><span>7 августа 1943г.</span> – День подвига летчика-истребителя Виктора Васильевича Талалихина (1918–1941), Героя Советского Союза.</p><p><span>7 августа - 2 октября 1943г.</span> – Смоленская наступательная операция.</p><p><span>8 августа 1941г.</span> – Сталин назначен Верховным главнокомандующим Вооруженных Сил СССР.</p><p><span>13 августа 1943г.</span> – Начало Донбасской наступательной операции.</p><p><span>17 августа 1944г.</span> – Войска 3-его Белорусского фронта вышли на границу с Германией.</p><p><span>21 августа 1941г.</span> – Начались оборонительные бои на ближних подступах к Ленинграду.</p><p><span>23 августа 1943г.</span> – Освобождение Харькова.</p><p><span>23 августа 1943г.</span> – День разгрома советскими войсками немецко-фашистских войск в Курской битве.</p><p><span>24 августа 1944г.</span> – Советские войска освободили Кишинев.</p><p><span>31 августа 1944г.</span> – Был освобожден Бухарест.</p>"
    },
    "8": {
        name: "сентябрь",
        name_r: "сентября",
        count_days: 30,
        holidays: "<p><span>1 сентября 1939г.</span> – Нападение фашистской Германии на Польшу. Начало Второй мировой войны.</p><p><span>30 сентябрь 1942г.</span> – В г.Краснодоне Ворошиловградской области из нескольких молодёжных подпольных групп была создана антифашистская комсомольская подпольная организация «Молодая гвардия».</p><p><span>2 сентября 1945г.</span> – Подписание Японией акта о безоговорочной капитуляции. Окончание Второй мировой войны.</p><p><span>8 сентября 1941г. – 27 января 1944г.</span> – Блокада Ленинграда.</p><p><span>8 сентября 1944г.</span> – Советские войска вступили в Болгарию.</p><p><span>9 сентября</span> — Международный день памяти жертв фашизма.</p><p><span>13 сентября 1942г.</span> – Начало боев с противником у Мамаева кургана в Сталинграде.</p><p><span>16 сентября 1943г.</span> – Освобожден г.Новороссийск.</p><p><span>20 сентября 1944г.</span> – Советские войска вступили на территорию Чехословакии.</p><p><span>22 сентября 1943г.</span> – Завершилось освобождение Донбасса.</p><p><span>22 сентября 1944г.</span> – Освобожден Таллин.</p><p><span>23 сентября 1944г.</span> – Советские войска вступили на территорию Венгрии.</p><p><span>25 сентября 1943г.</span> – Освобожден г.Смоленск.</p></p><p><span>28 сентября - 20 октября 1944г.</span> – Белградская наступательная операция.</p><p><span>29 сентября – 1 октября 1941г.</span> – Московская конференция глав СССР, США, Англии.</p><p><span>30 сентября 1941г. – 20 апреля 1942г.</span> – Битва под Москвой.</p>"
    },
    "9": {
        name: "октябрь",
        name_r: "октября",
        count_days: 31,
        holidays: "<p><span>3 октября 1943г.</span> – Освобожден г.Тамань.</p><p><span>5 октября 1941г.</span> – Государственный комитет обороны принял постановление о защите Москвы.</p><p><span>9 октября 1943г.</span> – Советские войска вышли на побережье Керченского пролива и завершили освобождение Северного Кавказа.</p><p><span>14 октября 1943г.</span> – Был освобожден г.Запорожье и ликвидирован немецкий плацдарм на левом берегу Днепра.</p><p><span>12 октября 1944г.</span> – Была освобождена Рига.</p><p><span>20 октября 1943г.</span> – Белград был освобожден. Бои за освобождение столицы Югославии продолжались неделю и носили исключительно упорный характер.</p><p><span>25 октября 1943г.</span> – Освобожден г.Днепропетровск.</p><p><span>29 октября 1944г. - 13 февраля 1945г.</span> – Штурм и взятие Будапешта.</p><p><span>30 октября 1941г. – 4 июля 1942г.</span> – Героическая оборона г.Севастополя.</p>"
    },
    "10": {
        name: "ноябрь",
        name_r: "ноября",
        count_days: 30,
        holidays: "<p><span>6 ноября 1943г.</span> - Советские войска освободили Киев.</p><p><span>7 ноября 1941г.</span> – День проведения военного парада на Красной площади в Москве и в запасной столице г.Куйбышеве.</p><p><span>11 ноября 1942г.</span> – Начало наступления советских войск под Сталинградом.</p><p><span>16 ноября 1941г.</span> – Подвиг 28 панфиловцев у разъезда Дубосеково.</p><p><span>20 ноября 1945г.</span> – Начало Нюрнбергского процесса над руководством фашисткой Германии.</p><p><span>22 ноября 1941г.</span> – Начало работы ледовой трассы на Ладожском озере.</p><p><span>28 ноября – 1 декабря 1943г.</span> – Тегеранская конференция глав правительств СССР, США и Великобритании.</p>"
    },
    "11": {
        name: "декабрь",
        name_r: "декабря",
        count_days: 31,
        holidays: "<p><span>6 декабря 1941г.</span> – Началось контрнаступление наших войск под Москвой. Гитлеровские армии несли большие потери и отступали на запад, оказывая ожесточенное сопротивление. Завершилось контрнаступление советских войск под Москвой 7 января 1942г.</p><p><span>18 декабря 1940г.</span> – План «Барбаросса» - план молниеносной войны с СССР - был подписан Гитлером. Теперь он был приведен в действие. Немецкие войска - сильнейшая армия мира - наступали тремя группами («Север», «Центр», «Юг»), нацеленными на быстрый захват Прибалтики и затем Ленинграда, Москвы, а на юге - Киева.</p><p><span>24 декабря 1943г. – 14 января 1944г.</span> – Житомирско-Бердичевская операция.</p><p><span>24 декабря 1943г. – 6 мая 1944г.</span> – Днепровско-Карпатская стратегическая наступательная операция.</p>"
    }
};

window["calendar_rewards"] = {
    "0": {
        price: 100,
        box_amount: 1,
        box_id: 6
    },
    "1": {
        price: 300,
        box_amount: 2,
        box_id: 6
    },
    "2": {
        price: 525,
        box_amount: 3,
        box_id: 6
    },
    "3": {
        box_amount: 4,
        box_id: 6
    }
};

if (Math["floor"](Date["now"]() / 1e3) < 1651363200) window["calendar_rewards"][3]["price"] = 750; else window["calendar_rewards"][3]["price"] = 775;

window["calendar_tasks"] = {
    "4": {
        "0": [ {
            count: 2,
            type: "open_box",
            name: "Открыть любой ящик 2 раза"
        }, {
            count: 5,
            type: "upgrade_decks",
            name: "Улучшить технику на 5 уровней"
        }, {
            count: 80,
            type: "get_tokens",
            name: "Добыть 80 жетонов"
        } ],
        "1": [ {
            count: 400,
            type: "get_coins",
            name: "Добыть 400 монет"
        }, {
            boss: 1,
            count: 4,
            type: "kill_boss",
            name: 'Убить босса "Рундштедт" 4 раза'
        }, {
            mission: 0,
            front: 0,
            count: 3,
            type: "missions",
            name: 'Пройти миссию "Отступать некуда" 3 раза'
        } ],
        "2": [ {
            count: 100,
            type: "spent_supply",
            name: "Потратить 100 снабжения"
        }, {
            count: 12e4,
            type: "damage",
            name: "Нанести 120 000 урона"
        }, {
            weapon: 3,
            count: 5,
            type: "weapons",
            name: "Применить зажигательный снаряд 5 раз"
        } ],
        "3": [ {
            count: 1,
            type: "exchange_collection",
            name: "Обменять набор коллекций"
        }, {
            count: 6,
            type: "open_box",
            name: "Открыть любой ящик 6 раз"
        }, {
            count: 10,
            type: "upgrade_decks",
            name: "Улучшить технику на 10 уровней"
        } ],
        "4": [ {
            mission: 1,
            front: 0,
            count: 1,
            type: "missions",
            name: 'Пройти миссию "Засада в туннеле"'
        }, {
            count: 6,
            type: "parcel",
            name: "Открыть забытую посылку 6 раз"
        }, {
            count: 90,
            type: "get_tokens",
            name: "Добыть 90 жетонов"
        } ],
        "5": [ {
            weapon: 4,
            count: 1,
            type: "weapons",
            name: "Применить фугасный снаряд"
        }, {
            count: 12e4,
            type: "damage",
            name: "Нанести 120 000 урона"
        }, {
            boss: 1,
            count: 11,
            type: "kill_boss",
            name: 'Убить босса "Рундштедт" 11 раз'
        } ],
        "6": [ {
            count: 1,
            type: "open_box",
            name: "Открыть любой ящик"
        }, {
            count: 5,
            type: "upgrade_decks",
            name: "Улучшить технику на 5 уровней"
        }, {
            count: 4e3,
            type: "get_coins",
            name: "Добыть 4000 монет"
        } ],
        "7": [ {
            count: 30,
            type: "get_tokens",
            name: "Добыть 30 жетонов"
        }, {
            count: 150,
            type: "spent_supply",
            name: "Потратить 150 снабжения"
        }, {
            mission: 2,
            front: 0,
            count: 3,
            type: "missions",
            name: 'Пройти миссию "Один путь" 3 раза'
        } ],
        "8": [ {
            count: 3,
            type: "upgrade_decks",
            name: "Улучшить технику на 3 уровня"
        }, {
            count: 250,
            type: "spent_supply",
            name: "Потратить 250 снабжения"
        }, {
            mission: 0,
            front: 0,
            count: 3,
            type: "missions",
            name: 'Пройти миссию "Отступать некуда" 3 раза'
        } ],
        "9": [ {
            count: 5e4,
            type: "damage",
            name: "Нанести 50 000 урона"
        }, {
            count: 1e3,
            type: "get_coins",
            name: "Добыть 1000 монет"
        }, {
            count: 14,
            type: "open_box",
            name: "Открыть любой ящик 14 раз"
        } ],
        "10": [ {
            weapon: 1,
            count: 1,
            type: "weapons",
            name: "Применить осколочный снаряд"
        }, {
            count: 4,
            type: "parcel",
            name: "Открыть забытую посылку 4 раза"
        }, {
            count: 14,
            type: "upgrade_decks",
            name: "Улучшить технику на 14 уровней"
        } ],
        "11": [ {
            count: 30,
            type: "get_tokens",
            name: "Добыть 30 жетонов"
        }, {
            weapon: 1,
            count: 5,
            type: "weapons",
            name: "Применить осколочный снаряд 5 раз"
        }, {
            count: 11,
            type: "parcel",
            name: "Открыть забытую посылку 11 раз"
        } ],
        "12": [ {
            count: 2,
            type: "open_box",
            name: "Открыть любой ящик 2 раза"
        }, {
            count: 3,
            type: "exchange_collection",
            name: "Обменять набор коллекций"
        }, {
            count: 14,
            type: "upgrade_decks",
            name: "Улучшить технику на 14 уровней"
        } ],
        "13": [ {
            mission: 1,
            front: 0,
            count: 1,
            type: "missions",
            name: 'Пройти миссию "Засада в туннеле"'
        }, {
            count: 250,
            type: "spent_supply",
            name: "Потратить 250 снабжения"
        }, {
            count: 3e5,
            type: "damage",
            name: "Нанести 300 000 урона"
        } ],
        "14": [ {
            count: 500,
            type: "get_coins",
            name: "Добыть 500 монет"
        }, {
            weapon: 4,
            count: 3,
            type: "weapons",
            name: "Применить фугасный снаряд 3 раза"
        }, {
            count: 14,
            type: "upgrade_decks",
            name: "Улучшить технику на 14 уровней"
        } ],
        "15": [ {
            count: 30,
            type: "get_tokens",
            name: "Добыть 30 жетонов"
        }, {
            count: 6,
            type: "open_box",
            name: "Открыть любой ящик 6 раз"
        }, {
            boss: 1,
            count: 13,
            type: "kill_boss",
            name: 'Убить босса "Рундштедт" 13 раз'
        } ],
        "16": [ {
            count: 1,
            type: "parcel",
            name: "Открыть забытую посылку"
        }, {
            count: 1e5,
            type: "damage",
            name: "Нанести 100 000 урона"
        }, {
            count: 400,
            type: "spent_supply",
            name: "Потратить 400 снабжения"
        } ],
        "17": [ {
            weapon: 1,
            count: 1,
            type: "weapons",
            name: "Применить осколочный снаряд"
        }, {
            mission: 0,
            front: 0,
            count: 2,
            type: "missions",
            name: 'Пройти миссию "Отступать некуда" 2 раза'
        }, {
            count: 5,
            type: "exchange_collection",
            name: "Обменять набор коллекций"
        } ],
        "18": [ {
            count: 2,
            type: "upgrade_decks",
            name: "Улучшить технику на 2 уровня"
        }, {
            count: 7,
            type: "open_box",
            name: "Открыть любой ящик 7 раз"
        }, {
            boss: 1,
            count: 13,
            type: "kill_boss",
            name: 'Убить босса "Рундштедт" 13 раз'
        } ],
        "19": [ {
            count: 60,
            type: "spent_supply",
            name: "Потратить 60 снабжения"
        }, {
            count: 5,
            type: "parcel",
            name: "Открыть забытую посылку 5 раз"
        }, {
            count: 80,
            type: "get_tokens",
            name: "Добыть 80 жетонов"
        } ],
        "20": [ {
            count: 1,
            type: "exchange_collection",
            name: "Обменять набор коллекций"
        }, {
            mission: 2,
            front: 0,
            count: 2,
            type: "missions",
            name: 'Пройти миссию "Один путь" 2 раза'
        }, {
            count: 3e3,
            type: "get_coins",
            name: "Добыть 3000 монет"
        } ],
        "21": [ {
            weapon: 0,
            count: 1,
            type: "weapons",
            name: "Применить трассирующий снаряд"
        }, {
            count: 7,
            type: "open_box",
            name: "Открыть любой ящик 7 раз"
        }, {
            count: 3e5,
            type: "damage",
            name: "Нанести 300 000 урона"
        } ],
        "22": [ {
            count: 10,
            type: "get_tokens",
            name: "Добыть 10 жетонов"
        }, {
            count: 7,
            type: "upgrade_decks",
            name: "Улучшить технику на 7 уровней"
        }, {
            boss: 1,
            count: 13,
            type: "kill_boss",
            name: 'Убить босса "Рундштедт" 13 раз'
        } ],
        "23": [ {
            count: 500,
            type: "get_coins",
            name: "Добыть 500 монет"
        }, {
            mission: 0,
            front: 0,
            count: 2,
            type: "missions",
            name: 'Пройти миссию "Отступать некуда" 2 раза'
        }, {
            count: 12,
            type: "parcel",
            name: "Открыть забытую посылку 12 раз"
        } ],
        "24": [ {
            count: 1,
            type: "open_box",
            name: "Открыть любой ящик"
        }, {
            weapon: 1,
            count: 5,
            type: "weapons",
            name: "Применить осколочный снаряд 5 раз"
        }, {
            count: 5,
            type: "exchange_collection",
            name: "Обменять набор коллекций"
        } ],
        "25": [ {
            count: 80,
            type: "spent_supply",
            name: "Потратить 80 снабжения"
        }, {
            count: 40,
            type: "get_tokens",
            name: "Добыть 40 жетонов"
        }, {
            count: 10,
            type: "upgrade_decks",
            name: "Улучшить технику на 10 уровней"
        } ],
        "26": [ {
            mission: 2,
            front: 0,
            count: 1,
            type: "missions",
            name: 'Пройти миссию "Один путь"'
        }, {
            count: 1e5,
            type: "damage",
            name: "Нанести 100 000 урона"
        }, {
            count: 3e3,
            type: "get_coins",
            name: "Добыть 3000 монет"
        } ],
        "27": [ {
            count: 3,
            type: "open_box",
            name: "Открыть любой ящик 3 раза"
        }, {
            boss: 1,
            count: 3,
            type: "kill_boss",
            name: 'Убить босса "Рундштедт" 3 раза'
        }, {
            count: 5,
            type: "exchange_collection",
            name: "Обменять набор коллекций"
        } ],
        "28": [ {
            count: 3,
            type: "parcel",
            name: "Открыть забытую посылку 3 раза"
        }, {
            weapon: 5,
            count: 3,
            type: "weapons",
            name: "Применить бронебойный снаряд 3 раза"
        }, {
            count: 70,
            type: "get_tokens",
            name: "Добыть 70 жетонов"
        } ],
        "29": [ {
            count: 300,
            type: "get_coins",
            name: "Добыть 300 монет"
        }, {
            mission: 0,
            front: 0,
            count: 2,
            type: "missions",
            name: 'Пройти миссию "Отступать некуда" 2 раза'
        }, {
            count: 2e5,
            type: "damage",
            name: "Нанести 200 000 урона"
        } ],
        "30": [ {
            boss: 0,
            count: 4,
            type: "kill_boss",
            name: 'Убить босса "Йенеке" 4 раза'
        }, {
            count: 250,
            type: "spent_supply",
            name: "Потратить 250 снабжения"
        }, {
            count: 14,
            type: "upgrade_decks",
            name: "Улучшить технику на 14 уровней"
        } ]
    }
};

window["calendar_stamp"] = [ 3, 7, 15 ];

window["calendar_skip_price"] = [ 3, 7, 15 ];

window["collections"] = [ {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "coins",
    amount_start: 30,
    amount_step: 10
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "tokens",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "encryptions",
    amount_start: 1,
    amount_step: 1
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "supply",
    amount_start: 5,
    amount_step: 2
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
}, {
    resource: "experience",
    amount_start: 50,
    amount_step: 10
} ];

window["link_group"] = "https://vk.com/reagent_bot";

window["package_price"] = 15;

window["shop_resources"] = {
    coins: [ {
        amount: 150,
        price: 1
    }, {
        amount: 450,
        price: 3
    }, {
        amount: 750,
        price: 5
    }, {
        amount: 1700,
        price: 10
    }, {
        amount: 3750,
        price: 20
    }, {
        amount: 9700,
        price: 50
    }, {
        amount: 20110,
        price: 100
    }, {
        amount: 41350,
        price: 185
    } ],
    supply: [ {
        amount: 15,
        price: 1
    }, {
        amount: 45,
        price: 3
    }, {
        amount: 80,
        price: 5
    }, {
        amount: 165,
        price: 10
    }, {
        amount: 340,
        price: 20
    }, {
        amount: 900,
        price: 50
    }, {
        amount: 1900,
        price: 100
    }, {
        amount: 3655,
        price: 185
    } ],
    encryptions: [ {
        amount: 15,
        price: 1
    }, {
        amount: 45,
        price: 3
    }, {
        amount: 80,
        price: 5
    }, {
        amount: 165,
        price: 10
    }, {
        amount: 340,
        price: 20
    }, {
        amount: 900,
        price: 50
    }, {
        amount: 1900,
        price: 100
    }, {
        amount: 3655,
        price: 185
    } ],
    tokens: [ {
        amount: 10,
        price: 1
    }, {
        amount: 30,
        price: 3
    }, {
        amount: 55,
        price: 5
    }, {
        amount: 115,
        price: 10
    }, {
        amount: 235,
        price: 20
    }, {
        amount: 600,
        price: 50
    }, {
        amount: 1250,
        price: 100
    }, {
        amount: 2400,
        price: 185
    } ],
    tickets: [ {
        amount: 5,
        price: 1
    }, {
        amount: 15,
        price: 3
    }, {
        amount: 25,
        price: 5
    }, {
        amount: 55,
        price: 10
    }, {
        amount: 115,
        price: 20
    }, {
        amount: 295,
        price: 50
    }, {
        amount: 600,
        price: 100
    }, {
        amount: 1130,
        price: 185
    } ]
};

window["material_help"] = [ {
    resource: "supply",
    amount: 45,
    price: 15
}, {
    resource: "supply",
    amount: 80,
    price: 25
}, {
    resource: "supply",
    amount: 165,
    price: 55
}, {
    resource: "supply",
    amount: 340,
    price: 115
}, {
    resource: "supply",
    amount: 900,
    price: 295
}, {
    resource: "tokens",
    amount: 30,
    price: 15
}, {
    resource: "tokens",
    amount: 55,
    price: 25
}, {
    resource: "tokens",
    amount: 115,
    price: 55
}, {
    resource: "tokens",
    amount: 235,
    price: 115
}, {
    resource: "tokens",
    amount: 600,
    price: 295
}, {
    resource: "coins",
    amount: 450,
    price: 15
}, {
    resource: "coins",
    amount: 750,
    price: 25
}, {
    resource: "coins",
    amount: 1700,
    price: 55
}, {
    resource: "coins",
    amount: 3750,
    price: 115
}, {
    resource: "coins",
    amount: 9700,
    price: 295
}, {
    resource: "encryptions",
    amount: 45,
    price: 15
}, {
    resource: "encryptions",
    amount: 80,
    price: 25
}, {
    resource: "encryptions",
    amount: 165,
    price: 55
}, {
    resource: "encryptions",
    amount: 340,
    price: 115
}, {
    resource: "encryptions",
    amount: 900,
    price: 295
}, {
    resource: "weapon_6",
    amount: 1,
    price: 20
}, {
    resource: "weapon_6",
    amount: 2,
    price: 40
}, {
    resource: "weapon_6",
    amount: 3,
    price: 60
}, {
    resource: "weapon_6",
    amount: 4,
    price: 80
}, {
    resource: "weapon_6",
    amount: 5,
    price: 100
}, {
    resource: "weapon_5",
    amount: 1,
    price: 10
}, {
    resource: "weapon_5",
    amount: 2,
    price: 20
}, {
    resource: "weapon_5",
    amount: 3,
    price: 30
}, {
    resource: "weapon_5",
    amount: 4,
    price: 40
}, {
    resource: "weapon_5",
    amount: 5,
    price: 50
}, {
    resource: "weapon_4",
    amount: 4,
    price: 15
}, {
    resource: "weapon_4",
    amount: 7,
    price: 25
}, {
    resource: "weapon_4",
    amount: 11,
    price: 40
}, {
    resource: "weapon_4",
    amount: 14,
    price: 55
}, {
    resource: "weapon_4",
    amount: 29,
    price: 115
}, {
    resource: "weapon_3",
    amount: 4,
    price: 10
}, {
    resource: "weapon_3",
    amount: 10,
    price: 25
}, {
    resource: "weapon_3",
    amount: 18,
    price: 45
}, {
    resource: "weapon_3",
    amount: 40,
    price: 100
}, {
    resource: "weapon_3",
    amount: 117,
    price: 295
} ];

window["mission_rnd_helmets"] = .17;

window["mission_rnd_maps"] = .17;

window["mission_rnd_collection"] = .4;

window["boxes_open_price"] = 15;

window["mission_rnd_supply"] = .05;

window["mission_rnd_weapons_0_1"] = .055;

window["mission_rnd_weapons_2"] = .026;

window["mission_rnd_weapons_3"] = .023;

window["mission_rnd_weapons_4"] = .018;

window["mission_rnd_weapons_5"] = .009;

window["mission_rnd_weapons_6"] = .006;

window["mission_rnd_max_coins"] = 21;

window["boxes_paid_open_price_1h"] = 4;

window["achievements"] = [ {
    title: "Пройти миссию Отступать некуда",
    param: "mission_0_0",
    type: "mission",
    front: 0,
    mission: 0
}, {
    title: "Пройти миссию Засада в туннеле",
    param: "mission_0_1",
    type: "mission",
    front: 0,
    mission: 1
}, {
    title: "Пройти миссию Один путь",
    param: "mission_0_2",
    type: "mission",
    front: 0,
    mission: 2
}, {
    title: "Пройти миссию Скрытая угроза",
    param: "mission_0_3",
    type: "mission",
    front: 0,
    mission: 3
}, {
    title: "Пройти миссию Город тишины",
    param: "mission_0_4",
    type: "mission",
    front: 0,
    mission: 4
}, {
    title: "Пройти миссию Железная дорога",
    param: "mission_0_5",
    type: "mission",
    front: 0,
    mission: 5
}, {
    title: "Пройти миссию Поезд спасения",
    param: "mission_0_6",
    type: "mission",
    front: 0,
    mission: 6
}, {
    title: "Пройти миссию Атака из леса",
    param: "mission_1_0",
    type: "mission",
    front: 1,
    mission: 0
}, {
    title: "Пройти миссию Место отгрузки",
    param: "mission_1_1",
    type: "mission",
    front: 1,
    mission: 1
}, {
    title: "Пройти миссию Таинственная река",
    param: "mission_1_2",
    type: "mission",
    front: 1,
    mission: 2
}, {
    title: "Пройти миссию Точка доступа",
    param: "mission_1_3",
    type: "mission",
    front: 1,
    mission: 3
}, {
    title: "Пройти миссию Сквозь снег",
    param: "mission_1_4",
    type: "mission",
    front: 1,
    mission: 4
}, {
    title: "Пройти миссию Закрытая зона",
    param: "mission_1_5",
    type: "mission",
    front: 1,
    mission: 5
}, {
    title: "Пройти миссию Перекрёсток",
    param: "mission_1_6",
    type: "mission",
    front: 1,
    mission: 6
}, {
    title: "Пройти миссию Затопленный груз",
    param: "mission_2_0",
    type: "mission",
    front: 2,
    mission: 0
}, {
    title: "Пройти миссию Пролив",
    param: "mission_2_1",
    type: "mission",
    front: 2,
    mission: 1
}, {
    title: "Пройти миссию Залечь на дно",
    param: "mission_2_2",
    type: "mission",
    front: 2,
    mission: 2
}, {
    title: "Пройти миссию Два берега",
    param: "mission_2_3",
    type: "mission",
    front: 2,
    mission: 3
}, {
    title: "Пройти миссию Доставка из штаба",
    param: "mission_2_4",
    type: "mission",
    front: 2,
    mission: 4
}, {
    title: "Пройти миссию Площадь возмездия",
    param: "mission_2_5",
    type: "mission",
    front: 2,
    mission: 5
}, {
    title: "Пройти миссию Портовый город",
    param: "mission_2_6",
    type: "mission",
    front: 2,
    mission: 6
}, {
    title: "Пройти миссию Захват",
    param: "mission_3_0",
    type: "mission",
    front: 3,
    mission: 0
}, {
    title: "Пройти миссию Шпионский мост",
    param: "mission_3_1",
    type: "mission",
    front: 3,
    mission: 1
}, {
    title: "Пройти миссию В тылу врага",
    param: "mission_3_2",
    type: "mission",
    front: 3,
    mission: 2
}, {
    title: "Пройти миссию Занять высоту",
    param: "mission_3_3",
    type: "mission",
    front: 3,
    mission: 3
}, {
    title: "Пройти миссию Надзорная вышка",
    param: "mission_3_4",
    type: "mission",
    front: 3,
    mission: 4
}, {
    title: "Пройти миссию Укрепление",
    param: "mission_3_5",
    type: "mission",
    front: 3,
    mission: 5
}, {
    title: "Пройти миссию Штурм крепости",
    param: "mission_3_6",
    type: "mission",
    front: 3,
    mission: 6
}, {
    title: "Поднять уровень техники",
    param: "sut",
    type: "other",
    action: 1
}, {
    title: "Победить босса Йенеке",
    param: "win_boss_0",
    type: "boss",
    boss: 0
}, {
    title: "Победить босса Рундштедт",
    param: "win_boss_1",
    type: "boss",
    boss: 1
}, {
    title: "Победить босса Манштейн",
    param: "win_boss_2",
    type: "boss",
    boss: 2
}, {
    title: "Победить босса Альмендингер",
    param: "win_boss_3",
    type: "boss",
    boss: 3
}, {
    title: "Победить босса Клейст",
    param: "win_boss_4",
    type: "boss",
    boss: 4
}, {
    title: "Победить босса Шёрнер",
    param: "win_boss_5",
    type: "boss",
    boss: 5
}, {
    title: "Победить босса Хубе",
    param: "win_boss_6",
    type: "boss",
    boss: 6
}, {
    title: "Победить босса Вёлер",
    param: "win_boss_7",
    type: "boss",
    boss: 7
}, {
    title: "Победить босса Бок",
    param: "win_boss_8",
    type: "boss",
    boss: 8
}, {
    title: "Победить босса Гот",
    param: "win_boss_9",
    type: "boss",
    boss: 9
}, {
    title: "Победить босса Паулюс",
    param: "win_boss_10",
    type: "boss",
    boss: 10
}, {
    title: "Победить босса Геббельс",
    param: "win_boss_14",
    type: "boss",
    boss: 14
}, {
    title: "Победить босса Муссолини",
    param: "win_boss_15",
    type: "boss",
    boss: 15
}, {
    title: "Победить босса Роммель",
    param: "win_boss_18",
    type: "boss",
    boss: 18
}, {
    title: "Общий урон",
    param: "total_damage",
    type: "other",
    action: 6
}, {
    title: "Трассирующие снаряды",
    param: "weapon_0",
    type: "weapon",
    weapon: 0
}, {
    title: "Осколочные снаряды",
    param: "weapon_1",
    type: "weapon",
    weapon: 1
}, {
    title: "Разрывные снаряды",
    param: "weapon_2",
    type: "weapon",
    weapon: 2
}, {
    title: "Зажигательные снаряды",
    param: "weapon_3",
    type: "weapon",
    weapon: 3
}, {
    title: "Фугасные снаряды",
    param: "weapon_4",
    type: "weapon",
    weapon: 4
}, {
    title: "Бронебойные снаряды",
    param: "weapon_5",
    type: "weapon",
    weapon: 5
}, {
    title: "Кумулятивные снаряды",
    param: "weapon_6",
    type: "weapon",
    weapon: 6
}, {
    title: "Открыть Простой ящик",
    param: "open_box_0",
    type: "boxes",
    box: 0
}, {
    title: "Открыть Лёгкий ящик",
    param: "open_box_2",
    type: "boxes",
    box: 2
}, {
    title: "Открыть Средний ящик",
    param: "open_box_3",
    type: "boxes",
    box: 3
}, {
    title: "Открыть Большой ящик",
    param: "open_box_4",
    type: "boxes",
    box: 4
}, {
    title: "Открыть Легендарный ящик",
    param: "open_box_5",
    type: "boxes",
    box: 5
}, {
    title: "Открыть Фронтовой ящик",
    param: "open_box_6",
    type: "boxes",
    box: 6
}, {
    title: "Открыть ящик с танками",
    param: "open_box_7",
    type: "boxes",
    box: 7
}, {
    title: "Открыть ящик с артиллерией",
    param: "open_box_8",
    type: "boxes",
    box: 8
}, {
    title: "Открыть ящик с авиацией",
    param: "open_box_9",
    type: "boxes",
    box: 9
}, {
    title: "Открыть Лёгкий ящик с техникой",
    param: "open_box_11",
    type: "boxes",
    box: 11
}, {
    title: "Открыть Средний ящик с техникой",
    param: "open_box_12",
    type: "boxes",
    box: 12
}, {
    title: "Открыть Большой ящик с техникой",
    param: "open_box_13",
    type: "boxes",
    box: 13
}, {
    title: "Открыть Легендарный ящик с техникой",
    param: "open_box_14",
    type: "boxes",
    box: 14
}, {
    title: "Открыть забытую посылку",
    param: "open_package",
    type: "other",
    action: 7
}, {
    title: "Отправить артобстрел",
    param: "send_airstrike",
    type: "other",
    action: 5
}, {
    title: "Отправить боезапас",
    param: "send_ammunition",
    type: "other",
    action: 4
}, {
    title: "Заработать жетоны",
    param: "tokens",
    type: "resourse",
    resourse: 2
}, {
    title: "Заработать шифровки",
    param: "encryptions",
    type: "resourse",
    resourse: 3
}, {
    title: "Заработать монеты",
    param: "coins",
    type: "resourse",
    resourse: 0
}, {
    title: "Раздобыть талоны",
    param: "tickets",
    type: "resourse",
    resourse: 4
}, {
    title: "Обменять набор коллекций",
    param: "exchange_collections",
    type: "other",
    action: 3
} ];

window["achievements_friend"] = {
    weapons: [ 0, 10, 25, 50, 100, 250, 500, 1e3, 2500, 5e3, 1e4, 25e3, 5e4, 1e5 ],
    bosses: [ 0, 1, 5, 10, 25, 50, 100, 250, 500, 1e3, 2500, 5e3, 1e4 ],
    boxes: [ 0, 1, 5, 10, 25, 50, 100, 250, 500, 1e3, 2500, 5e3, 1e4 ],
    missions: [ 0, 1, 5, 10, 25, 50, 100, 250, 500, 1e3, 2500 ],
    sut: [ 0, 10, 25, 50, 100, 250, 500, 1e3, 2500, 5e3, 1e4, 25e3, 5e4 ],
    exchange_collections: [ 0, 1, 5, 10, 25, 50, 100, 250, 500, 1e3, 2500 ],
    send_help: [ 0, 1, 5, 10, 25, 50, 100, 250, 500, 1e3, 2500, 5e3, 1e4 ],
    coins: [ 0, 5e3, 1e4, 25e3, 5e4, 1e5, 25e4, 5e5, 1e6, 25e5, 5e6 ],
    tokens: [ 0, 250, 500, 1e3, 2500, 5e3, 1e4, 25e3, 5e4, 1e5, 25e4, 5e5 ],
    encryptions: [ 0, 250, 500, 1e3, 2500, 5e3, 1e4, 25e3, 5e4, 1e5, 25e4, 5e5 ],
    tickets: [ 0, 5, 10, 25, 50, 100, 250, 500, 1e3, 2500, 5e3, 1e4, 25e3, 5e4 ],
    damage: [ 1e5, 25e4, 5e5, 1e6, 3e6, 5e6, 1e7, 2e7, 3e7, 5e7, 75e6, 1e8, 25e7, 5e8, 1e9, 5e9, 1e10, 25e9, 5e10, 1e11 ],
    open_package: [ 1, 5, 10, 25, 50, 100, 200, 300, 500, 750, 1e3, 2e3 ]
};

window["bosses_requirements"] = [ [ {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 1
    } ],
    title: 'Пройти миссию "Отступать некуда"'
} ], [ {
    mode: "kill_boss",
    params: [ {
        boss: 0,
        amount: 1
    } ],
    title: 'Убить босса "Йенеке"'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 1,
        amount: 1
    } ],
    title: 'Пройти миссию "Засада в туннеле"'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 2,
        amount: 1
    } ],
    title: 'Пройти миссию "Один путь"'
}, {
    mode: "sut",
    params: [ {
        amount: 300
    } ],
    title: "Прокачать 300 уровней техники"
} ], [ {
    mode: "kill_boss",
    params: [ {
        boss: 1,
        amount: 1
    } ],
    title: 'Убить босса "Рундштедт"'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 3,
        amount: 1
    } ],
    title: 'Пройти миссию "Скрытая угроза"'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 4,
        amount: 1
    } ],
    title: 'Пройти миссию "Город тишины"'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 5,
        amount: 1
    } ],
    title: 'Пройти миссию "Железная дорога"'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 6,
        amount: 1
    } ],
    title: 'Пройти миссию "Поезд спасения"'
}, {
    mode: "sut",
    params: [ {
        amount: 500
    } ],
    title: "Прокачать 500 уровней техники"
} ], [ {
    mode: "kill_boss",
    params: [ {
        boss: 2,
        amount: 1
    } ],
    title: 'Убить босса "Манштейн"'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 5
    } ],
    title: 'Пройти миссию "Отступать некуда" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 1,
        amount: 5
    } ],
    title: 'Пройти миссию "Засада в туннеле" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 2,
        amount: 5
    } ],
    title: 'Пройти миссию "Один путь" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 3,
        amount: 5
    } ],
    title: 'Пройти миссию "Скрытая угроза" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 4,
        amount: 5
    } ],
    title: 'Пройти миссию "Город тишины" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 5,
        amount: 5
    } ],
    title: 'Пройти миссию "Железная дорога" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 6,
        amount: 5
    } ],
    title: 'Пройти миссию "Поезд спасения" 5 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 1e3
    } ],
    title: "Прокачать 1000 уровней техники"
} ], [ {
    mode: "kill_boss",
    params: [ {
        boss: 3,
        amount: 1
    } ],
    title: 'Убить босса "Альмендингер"'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 3,
        amount: 1
    } ],
    title: 'Пройти миссию "Точка доступа"'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 4,
        amount: 1
    } ],
    title: 'Пройти миссию "Сквозь снег"'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 5,
        amount: 1
    } ],
    title: 'Пройти миссию "Закрытая зона"'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 6,
        amount: 1
    } ],
    title: 'Пройти миссию "Перекрёсток"'
}, {
    mode: "sut",
    params: [ {
        amount: 2e3
    } ],
    title: "Прокачать 2000 уровней техники"
} ], [ {
    mode: "kill_boss",
    params: [ {
        boss: 4,
        amount: 1
    } ],
    title: 'Убить босса "Клейст"'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 10
    } ],
    title: 'Пройти миссию "Атака из леса" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 1,
        amount: 10
    } ],
    title: 'Пройти миссию "Место отгрузки" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 2,
        amount: 10
    } ],
    title: 'Пройти миссию "Таинственная река" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 3,
        amount: 10
    } ],
    title: 'Пройти миссию "Точка доступа" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 4,
        amount: 10
    } ],
    title: 'Пройти миссию "Сквозь снег" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 5,
        amount: 10
    } ],
    title: 'Пройти миссию "Закрытая зона" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 6,
        amount: 10
    } ],
    title: 'Пройти миссию "Перекрёсток" 10 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 3e3
    } ],
    title: "Прокачать 3000 уровней техники"
} ], [ {
    mode: "kill_boss",
    params: [ {
        boss: 5,
        amount: 1
    } ],
    title: 'Убить босса "Шёрнер"'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 3,
        amount: 1
    } ],
    title: 'Пройти миссию "Два берега"'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 4,
        amount: 1
    } ],
    title: 'Пройти миссию "Доставка из штаба"'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 5,
        amount: 1
    } ],
    title: 'Пройти миссию "Площадь возмездия"'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 6,
        amount: 1
    } ],
    title: 'Пройти миссию "Портовый город"'
}, {
    mode: "sut",
    params: [ {
        amount: 4e3
    } ],
    title: "Прокачать 4000 уровней техники"
} ], [ {
    mode: "kill_boss",
    params: [ {
        boss: 6,
        amount: 1
    } ],
    title: 'Убить босса "Хубе"'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 0,
        amount: 15
    } ],
    title: 'Пройти миссию "Затопленный груз" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 1,
        amount: 15
    } ],
    title: 'Пройти миссию "Пролив" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 2,
        amount: 15
    } ],
    title: 'Пройти миссию "Залечь на дно" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 3,
        amount: 15
    } ],
    title: 'Пройти миссию "Два берега" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 4,
        amount: 15
    } ],
    title: 'Пройти миссию "Доставка из штаба" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 5,
        amount: 15
    } ],
    title: 'Пройти миссию "Площадь возмездия" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 6,
        amount: 15
    } ],
    title: 'Пройти миссию "Портовый город" 15 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 5e3
    } ],
    title: "Прокачать 5000 уровней техники"
} ], [ {
    mode: "kill_boss",
    params: [ {
        boss: 7,
        amount: 1
    } ],
    title: 'Убить босса "Вёлер"'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 25
    }, {
        front: 0,
        mission: 1,
        amount: 25
    }, {
        front: 0,
        mission: 2,
        amount: 25
    }, {
        front: 0,
        mission: 3,
        amount: 25
    }, {
        front: 0,
        mission: 4,
        amount: 25
    }, {
        front: 0,
        mission: 5,
        amount: 25
    }, {
        front: 0,
        mission: 6,
        amount: 25
    } ],
    title: 'Пройти все миссии "Курск" 25 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 25
    }, {
        front: 1,
        mission: 1,
        amount: 25
    }, {
        front: 1,
        mission: 2,
        amount: 25
    }, {
        front: 1,
        mission: 3,
        amount: 25
    }, {
        front: 1,
        mission: 4,
        amount: 25
    }, {
        front: 1,
        mission: 5,
        amount: 25
    }, {
        front: 1,
        mission: 6,
        amount: 25
    } ],
    title: 'Пройти все миссии "Сталинград" 25 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 0,
        amount: 25
    }, {
        front: 2,
        mission: 1,
        amount: 25
    }, {
        front: 2,
        mission: 2,
        amount: 25
    }, {
        front: 2,
        mission: 3,
        amount: 25
    }, {
        front: 2,
        mission: 4,
        amount: 25
    }, {
        front: 2,
        mission: 5,
        amount: 25
    }, {
        front: 2,
        mission: 6,
        amount: 25
    } ],
    title: 'Пройти все миссии "Севастополь" 25 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 6e3
    } ],
    title: "Прокачать 6000 уровней техники"
} ], [ {
    mode: "kill_boss",
    params: [ {
        boss: 8,
        amount: 1
    } ],
    title: 'Убить босса "Бок"'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 35
    }, {
        front: 0,
        mission: 1,
        amount: 35
    }, {
        front: 0,
        mission: 2,
        amount: 35
    }, {
        front: 0,
        mission: 3,
        amount: 35
    }, {
        front: 0,
        mission: 4,
        amount: 35
    }, {
        front: 0,
        mission: 5,
        amount: 35
    }, {
        front: 0,
        mission: 6,
        amount: 35
    } ],
    title: 'Пройти все миссии "Курск" 35 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 35
    }, {
        front: 1,
        mission: 1,
        amount: 35
    }, {
        front: 1,
        mission: 2,
        amount: 35
    }, {
        front: 1,
        mission: 3,
        amount: 35
    }, {
        front: 1,
        mission: 4,
        amount: 35
    }, {
        front: 1,
        mission: 5,
        amount: 35
    }, {
        front: 1,
        mission: 6,
        amount: 35
    } ],
    title: 'Пройти все миссии "Сталинград" 35 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 0,
        amount: 35
    }, {
        front: 2,
        mission: 1,
        amount: 35
    }, {
        front: 2,
        mission: 2,
        amount: 35
    }, {
        front: 2,
        mission: 3,
        amount: 35
    }, {
        front: 2,
        mission: 4,
        amount: 35
    }, {
        front: 2,
        mission: 5,
        amount: 35
    }, {
        front: 2,
        mission: 6,
        amount: 35
    } ],
    title: 'Пройти все миссии "Севастополь" 35 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 7e3
    } ],
    title: "Прокачать 7000 уровней техники"
} ], [ {
    mode: "kill_boss",
    params: [ {
        boss: 9,
        amount: 1
    } ],
    title: 'Убить босса "Гот"'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 35
    }, {
        front: 0,
        mission: 1,
        amount: 35
    }, {
        front: 0,
        mission: 2,
        amount: 35
    }, {
        front: 0,
        mission: 3,
        amount: 35
    }, {
        front: 0,
        mission: 4,
        amount: 35
    }, {
        front: 0,
        mission: 5,
        amount: 35
    }, {
        front: 0,
        mission: 6,
        amount: 35
    } ],
    title: 'Пройти все миссии "Курск" 35 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 35
    }, {
        front: 1,
        mission: 1,
        amount: 35
    }, {
        front: 1,
        mission: 2,
        amount: 35
    }, {
        front: 1,
        mission: 3,
        amount: 35
    }, {
        front: 1,
        mission: 4,
        amount: 35
    }, {
        front: 1,
        mission: 5,
        amount: 35
    }, {
        front: 1,
        mission: 6,
        amount: 35
    } ],
    title: 'Пройти все миссии "Сталинград" 35 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 0,
        amount: 35
    }, {
        front: 2,
        mission: 1,
        amount: 35
    }, {
        front: 2,
        mission: 2,
        amount: 35
    }, {
        front: 2,
        mission: 3,
        amount: 35
    }, {
        front: 2,
        mission: 4,
        amount: 35
    }, {
        front: 2,
        mission: 5,
        amount: 35
    }, {
        front: 2,
        mission: 6,
        amount: 35
    } ],
    title: 'Пройти все миссии "Севастополь" 35 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 8e3
    } ],
    title: "Прокачать 8000 уровней техники"
} ] ];

window["missions_requirements"] = [ [ [], [ {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 1
    } ],
    title: 'Пройти миссию "Отступать некуда"'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 0,
        amount: 1
    } ],
    title: 'Убить босса "Йенеке"'
} ], [ {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 1,
        amount: 1
    } ],
    title: 'Пройти миссию "Засада в туннеле"'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 0,
        amount: 3
    } ],
    title: 'Убить босса "Йенеке" 3 раза'
} ], [ {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 2
    } ],
    title: 'Пройти миссию "Отступать некуда" 2 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 1,
        amount: 2
    } ],
    title: 'Пройти миссию "Засада в туннеле" 2 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 2,
        amount: 2
    } ],
    title: 'Пройти миссию "Один путь" 2 раза'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 0,
        amount: 5
    } ],
    title: 'Убить босса "Йенеке" 5 раза'
} ], [ {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 3
    } ],
    title: 'Пройти миссию "Отступать некуда" 3 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 1,
        amount: 3
    } ],
    title: 'Пройти миссию "Засада в туннеле" 3 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 2,
        amount: 3
    } ],
    title: 'Пройти миссию "Один путь" 3 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 3,
        amount: 3
    } ],
    title: 'Пройти миссию "Скрытая угроза" 3 раза'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 1,
        amount: 1
    } ],
    title: 'Убить босса "Рундштедт"'
} ], [ {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 4
    } ],
    title: 'Пройти миссию "Отступать некуда" 4 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 1,
        amount: 4
    } ],
    title: 'Пройти миссию "Засада в туннеле" 4 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 2,
        amount: 4
    } ],
    title: 'Пройти миссию "Один путь" 4 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 3,
        amount: 4
    } ],
    title: 'Пройти миссию "Скрытая угроза" 4 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 4,
        amount: 4
    } ],
    title: 'Пройти миссию "Город тишины" 4 раза'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 1,
        amount: 5
    } ],
    title: 'Убить босса "Рундштедт" 5 раз'
} ], [ {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 5
    } ],
    title: 'Пройти миссию "Отступать некуда" 5 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 1,
        amount: 5
    } ],
    title: 'Пройти миссию "Засада в туннеле" 5 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 2,
        amount: 5
    } ],
    title: 'Пройти миссию "Один путь" 5 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 3,
        amount: 5
    } ],
    title: 'Пройти миссию "Скрытая угроза" 5 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 4,
        amount: 5
    } ],
    title: 'Пройти миссию "Город тишины" 5 раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 5,
        amount: 5
    } ],
    title: 'Пройти миссию "Железная дорога" 5 раза'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 0,
        amount: 10
    } ],
    title: 'Убить боссов "Йенеке" 10 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 1,
        amount: 10
    } ],
    title: 'Убить боссов "Рундштедт" 10 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 500
    } ],
    title: "Прокачать 500 уровней техники"
} ] ], [ [ {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 10
    } ],
    title: 'Пройти миссию "Отступать некуда" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 1,
        amount: 10
    } ],
    title: 'Пройти миссию "Засада в туннеле\b  раза'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 2,
        amount: 10
    } ],
    title: 'Пройти миссию "Один путь" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 3,
        amount: 10
    } ],
    title: 'Пройти миссию "Скрытая угроза" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 4,
        amount: 10
    } ],
    title: 'Пройти миссию "Город тишины" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 5,
        amount: 10
    } ],
    title: 'Пройти миссию "Железная дорога" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 6,
        amount: 10
    } ],
    title: 'Пройти миссию "Поезд спасения" 10 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 750
    } ],
    title: "Прокачать 750 уровней техники"
} ], [ {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 1
    } ],
    title: 'Пройти миссию "Атака из леса"'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 2,
        amount: 1
    } ],
    title: 'Убить босса "Манштейн"'
} ], [ {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 1,
        amount: 1
    } ],
    title: 'Пройти миссию "Место отгрузки"'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 2,
        amount: 5
    } ],
    title: 'Убить босса "Манштейн" 5 раза'
} ], [ {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 5
    } ],
    title: 'Пройти миссию "Атака из леса" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 1,
        amount: 5
    } ],
    title: 'Пройти миссию "Место отгрузки" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 2,
        amount: 5
    } ],
    title: 'Пройти миссию "Таинственная река" 5 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 2,
        amount: 10
    } ],
    title: 'Убить босса "Манштейн" 10 раз'
} ], [ {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 7
    } ],
    title: 'Пройти миссию "Атака из леса" 7 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 1,
        amount: 7
    } ],
    title: 'Пройти миссию "Место отгрузки" 7 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 2,
        amount: 7
    } ],
    title: 'Пройти миссию "Таинственная река" 7 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 3,
        amount: 7
    } ],
    title: 'Пройти миссию "Точка доступа" 7 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 3,
        amount: 1
    } ],
    title: 'Убить босса "Альмендингер"'
} ], [ {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 9
    } ],
    title: 'Пройти миссию "Атака из леса" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 1,
        amount: 9
    } ],
    title: 'Пройти миссию "Место отгрузки" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 2,
        amount: 9
    } ],
    title: 'Пройти миссию "Таинственная река" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 3,
        amount: 9
    } ],
    title: 'Пройти миссию "Точка доступа" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 4,
        amount: 9
    } ],
    title: 'Пройти миссию "Сквозь снег" 9 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 3,
        amount: 10
    } ],
    title: 'Убить босса "Альмендингер" 10 раз'
} ], [ {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 10
    } ],
    title: 'Пройти миссию "Атака из леса" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 1,
        amount: 10
    } ],
    title: 'Пройти миссию "Место отгрузки" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 2,
        amount: 10
    } ],
    title: 'Пройти миссию "Таинственная река" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 3,
        amount: 10
    } ],
    title: 'Пройти миссию "Точка доступа" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 4,
        amount: 10
    } ],
    title: 'Пройти миссию "Сквозь снег" 10 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 5,
        amount: 10
    } ],
    title: 'Пройти миссию "Закрытая зона" 10 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 0,
        amount: 20
    } ],
    title: 'Убить босса "Йенеке" 20 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 1,
        amount: 20
    } ],
    title: 'Убить босса "Рундштедт" 20 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 2,
        amount: 20
    } ],
    title: 'Убить босса "Манштейн" 20 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 3,
        amount: 20
    } ],
    title: 'Убить босса "Альмендингер" 20 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 1e3
    } ],
    title: "Прокачать 1000 уровней техники"
} ] ], [ [ {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 15
    }, {
        front: 0,
        mission: 1,
        amount: 15
    }, {
        front: 0,
        mission: 2,
        amount: 15
    }, {
        front: 0,
        mission: 3,
        amount: 15
    }, {
        front: 0,
        mission: 4,
        amount: 15
    }, {
        front: 0,
        mission: 5,
        amount: 15
    }, {
        front: 0,
        mission: 6,
        amount: 15
    } ],
    title: 'Пройти все миссии "Курск" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 15
    }, {
        front: 1,
        mission: 1,
        amount: 15
    }, {
        front: 1,
        mission: 2,
        amount: 15
    }, {
        front: 1,
        mission: 3,
        amount: 15
    }, {
        front: 1,
        mission: 4,
        amount: 15
    }, {
        front: 1,
        mission: 5,
        amount: 15
    }, {
        front: 1,
        mission: 6,
        amount: 15
    } ],
    title: 'Пройти все миссии "Сталинград" 15 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 1250
    } ],
    title: "Прокачать 1250 уровней техники"
} ], [ {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 0,
        amount: 1
    } ],
    title: 'Пройти миссию "Затопленный груз"'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 4,
        amount: 1
    } ],
    title: 'Убить босса "Клейст"'
} ], [ {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 1,
        amount: 1
    } ],
    title: 'Пройти миссию "Пролив"'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 4,
        amount: 5
    } ],
    title: 'Убить босса "Клейст" 5 раз'
} ], [ {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 0,
        amount: 5
    } ],
    title: 'Пройти миссию "Затопленный груз" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 1,
        amount: 5
    } ],
    title: 'Пройти миссию "Пролив" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 2,
        amount: 5
    } ],
    title: 'Пройти миссию "Залечь на дно" 5 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 4,
        amount: 10
    } ],
    title: 'Убить босса "Клейст" 10 раз'
} ], [ {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 0,
        amount: 7
    } ],
    title: 'Пройти миссию "Затопленный груз" 7 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 1,
        amount: 7
    } ],
    title: 'Пройти миссию "Пролив" 7 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 2,
        amount: 7
    } ],
    title: 'Пройти миссию "Залечь на дно" 7 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 3,
        amount: 7
    } ],
    title: 'Пройти миссию "Два берега" 7 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 5,
        amount: 1
    } ],
    title: 'Убить босса "Шёрнер"'
} ], [ {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 0,
        amount: 9
    } ],
    title: 'Пройти миссию "Затопленный груз" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 1,
        amount: 9
    } ],
    title: 'Пройти миссию "Пролив" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 2,
        amount: 9
    } ],
    title: 'Пройти миссию "Залечь на дно" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 3,
        amount: 9
    } ],
    title: 'Пройти миссию "Два берега" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 4,
        amount: 9
    } ],
    title: 'Пройти миссию "Доставка из штаба" 9 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 5,
        amount: 10
    } ],
    title: 'Убить босса "Шёрнер" 10 раз'
} ], [ {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 0,
        amount: 15
    } ],
    title: 'Пройти миссию "Затопленный груз" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 1,
        amount: 15
    } ],
    title: 'Пройти миссию "Пролив" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 2,
        amount: 15
    } ],
    title: 'Пройти миссию "Залечь на дно" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 3,
        amount: 15
    } ],
    title: 'Пройти миссию "Два берега" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 4,
        amount: 15
    } ],
    title: 'Пройти миссию "Доставка из штаба" 15 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 5,
        amount: 15
    } ],
    title: 'Пройти миссию "Площадь возмездия" 15 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 0,
        amount: 30
    } ],
    title: 'Убить босса "Йенеке" 30 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 1,
        amount: 30
    } ],
    title: 'Убить босса "Рундштедт" 30 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 2,
        amount: 30
    } ],
    title: 'Убить босса "Манштейн" 30 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 3,
        amount: 30
    } ],
    title: 'Убить босса "Альмендингер" 30 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 4,
        amount: 30
    } ],
    title: 'Убить босса "Клейст" 30 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 5,
        amount: 30
    } ],
    title: 'Убить босса "Шёрнер" 30 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 2e3
    } ],
    title: "Прокачать 2000 уровней техники"
} ] ], [ [ {
    mode: "missions",
    params: [ {
        front: 0,
        mission: 0,
        amount: 20
    }, {
        front: 0,
        mission: 1,
        amount: 20
    }, {
        front: 0,
        mission: 2,
        amount: 20
    }, {
        front: 0,
        mission: 3,
        amount: 20
    }, {
        front: 0,
        mission: 4,
        amount: 20
    }, {
        front: 0,
        mission: 5,
        amount: 20
    }, {
        front: 0,
        mission: 6,
        amount: 20
    } ],
    title: 'Пройти все миссии "Курск" 20 раз'
}, {
    mode: "missions",
    params: [ {
        front: 1,
        mission: 0,
        amount: 20
    }, {
        front: 1,
        mission: 1,
        amount: 20
    }, {
        front: 1,
        mission: 2,
        amount: 20
    }, {
        front: 1,
        mission: 3,
        amount: 20
    }, {
        front: 1,
        mission: 4,
        amount: 20
    }, {
        front: 1,
        mission: 5,
        amount: 20
    }, {
        front: 1,
        mission: 6,
        amount: 20
    } ],
    title: 'Пройти все миссии "Сталинград" 20 раз'
}, {
    mode: "missions",
    params: [ {
        front: 2,
        mission: 0,
        amount: 20
    }, {
        front: 2,
        mission: 1,
        amount: 20
    }, {
        front: 2,
        mission: 2,
        amount: 20
    }, {
        front: 2,
        mission: 3,
        amount: 20
    }, {
        front: 2,
        mission: 4,
        amount: 20
    }, {
        front: 2,
        mission: 5,
        amount: 20
    }, {
        front: 2,
        mission: 6,
        amount: 20
    } ],
    title: 'Пройти все миссии "Севастополь" 20 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 2250
    } ],
    title: "Прокачать 2250 уровней техники"
} ], [ {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 0,
        amount: 1
    } ],
    title: 'Пройти миссию "Захват"'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 0,
        amount: 50
    } ],
    title: 'Убить босса "Йенеке" 50 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 1,
        amount: 50
    } ],
    title: 'Убить босса "Рундштедт" 50 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 2,
        amount: 50
    } ],
    title: 'Убить босса "Манштейн" 50 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 3,
        amount: 50
    } ],
    title: 'Убить босса "Альмендингер" 50 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 4,
        amount: 50
    } ],
    title: 'Убить босса "Клейст" 50 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 5,
        amount: 50
    } ],
    title: 'Убить босса "Шёрнер" 50 раз'
} ], [ {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 1,
        amount: 1
    } ],
    title: 'Пройти миссию "Шпионский мост"'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 6,
        amount: 1
    } ],
    title: 'Убить босса "Хубе"'
} ], [ {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 0,
        amount: 5
    } ],
    title: 'Пройти миссию "Захват" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 1,
        amount: 5
    } ],
    title: 'Пройти миссию "Шпионский мост" 5 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 2,
        amount: 5
    } ],
    title: 'Пройти миссию "В тылу врага" 5 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 6,
        amount: 5
    } ],
    title: 'Убить босса "Хубе" 5 раз'
} ], [ {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 0,
        amount: 7
    } ],
    title: 'Пройти миссию "Захват" 7 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 1,
        amount: 7
    } ],
    title: 'Пройти миссию "Шпионский мост" 7 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 2,
        amount: 7
    } ],
    title: 'Пройти миссию "В тылу врага" 7 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 3,
        amount: 7
    } ],
    title: 'Пройти миссию "Занять высоту" 7 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 6,
        amount: 7
    } ],
    title: 'Убить босса "Хубе" 7 раз'
} ], [ {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 0,
        amount: 9
    } ],
    title: 'Пройти миссию "Захват" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 1,
        amount: 9
    } ],
    title: 'Пройти миссию "Шпионский мост" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 2,
        amount: 9
    } ],
    title: 'Пройти миссию "В тылу врага" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 3,
        amount: 9
    } ],
    title: 'Пройти миссию "Занять высоту" 9 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 4,
        amount: 9
    } ],
    title: 'Пройти миссию "Надзорная вышка" 9 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 6,
        amount: 9
    } ],
    title: 'Убить босса "Хубе" 9 раз'
} ], [ {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 0,
        amount: 20
    } ],
    title: 'Пройти миссию "Захват" 20 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 1,
        amount: 20
    } ],
    title: 'Пройти миссию "Шпионский мост" 20 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 2,
        amount: 20
    } ],
    title: 'Пройти миссию "В тылу врага" 20 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 3,
        amount: 20
    } ],
    title: 'Пройти миссию "Занять высоту" 20 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 4,
        amount: 20
    } ],
    title: 'Пройти миссию "Надзорная вышка" 20 раз'
}, {
    mode: "missions",
    params: [ {
        front: 3,
        mission: 5,
        amount: 20
    } ],
    title: 'Пройти миссию "Укрепление" 20 раз'
}, {
    mode: "kill_boss",
    params: [ {
        boss: 6,
        amount: 20
    } ],
    title: 'Убить босса "Хубе" 20 раз'
}, {
    mode: "sut",
    params: [ {
        amount: 3e3
    } ],
    title: "Прокачать 3000 уровней техники"
} ] ] ];

window["talents"] = [ [ {
    title: "Непревзойдённый",
    descr: "Увеличивает лимит побед над боссами на 1 ед.",
    amount: 30,
    boost: "bosses_win",
    step: 1
}, {
    title: "Автоцистерна",
    descr: "Увеличивает скорость восстановления снабжения на 2 сек.",
    amount: 30,
    boost: "speed_recovery_supply",
    step: 2
}, {
    title: "Огневая мощь",
    descr: "Увеличивает урон кумулятивного снаряда на 1200 ед.",
    amount: 20,
    boost: "weapon_6",
    step: 1200
}, {
    title: "Беглый огонь",
    descr: "Уменьшает время перезарядки беглого огня на 1 мин.",
    amount: 10,
    boost: "speed_recovery_free_weapon_0",
    step: 60
}, {
    title: "Разрушенная база",
    descr: "Уменьшает время взлома выпавших ящиков на 1 мин.",
    amount: 30,
    boost: "speed_hack_boxes",
    step: 60
}, {
    title: "Кинжальный огонь",
    descr: "Уменьшает время перезарядки кинжального огня на 1 мин.",
    amount: 15,
    boost: "speed_recovery_free_weapon_1",
    step: 60
}, {
    title: "Массированный обстрел",
    descr: "Уменьшает время перезарядки массированного обстрела на 1 мин.",
    amount: 25,
    boost: "speed_recovery_free_weapon_2",
    step: 60
}, {
    title: "Горючая смесь",
    descr: "Увеличивает максимальное количество снабжения на 1 ед.",
    amount: 25,
    boost: "max_supply",
    step: 1
}, {
    title: "Шальной выстрел",
    descr: "Увеличивает урон трассирующего снаряда на 11 ед.",
    amount: 20,
    boost: "weapon_0",
    step: 11
}, {
    title: "Форсированный артобстрел",
    descr: "Увеличивает урон артобстрела в сражении на 1 ед.",
    amount: 20,
    boost: "damage_airstrike",
    step: 1
}, {
    title: "Смертельные осколки",
    descr: "Увеличивает урон осколочного снаряда на 15 ед.",
    amount: 20,
    boost: "weapon_1",
    step: 15
}, {
    title: "Лучшие друзья",
    descr: "Увеличивает лимит помощи от друзей на 1 ед.",
    amount: 20,
    boost: "get_help",
    step: 1
}, {
    title: "Ошеломляющий взрыв",
    descr: "Увеличивает урон разрывного снаряда на 25 ед.",
    amount: 20,
    boost: "weapon_2",
    step: 25
}, {
    title: "Сила товарищества",
    descr: "Увеличивает лимит снабжения от друзей на 1 ед.",
    amount: 25,
    boost: "get_supply",
    step: 1
}, {
    title: "Динамичный залп",
    descr: "Увеличивает урон зажигательного снаряда на 37 ед.",
    amount: 20,
    boost: "weapon_3",
    step: 37
}, {
    title: "Волна бедствия",
    descr: "Увеличивает урон фугасного снаряда на 64 ед.",
    amount: 20,
    boost: "weapon_4",
    step: 64
}, {
    title: "Заброшенный амбар",
    descr: "Уменьшает время взлома выпавших ящиков на 1 мин.",
    amount: 30,
    boost: "speed_hack_boxes",
    step: 60
}, {
    title: "Спасательный круг",
    descr: "Увеличивает лимит снабжения от друзей на 1 ед.",
    amount: 25,
    boost: "get_supply",
    step: 1
}, {
    title: "Ураган",
    descr: "Увеличивает урон бронебойного снаряда на 600 ед.",
    amount: 20,
    boost: "weapon_5",
    step: 600
}, {
    title: "Бонусное снабжение",
    descr: "Увеличивает максимальное количество снабжения на 1 ед.",
    amount: 25,
    boost: "max_supply",
    step: 1
}, {
    title: "Последний шанс",
    descr: "Увеличивает время битвы с боссом на 1 мин.",
    amount: 30,
    boost: "fight_time",
    step: 60
}, {
    title: "Топливный насос",
    descr: "Увеличивает скорость восстановления снабжения на 2 сек.",
    amount: 30,
    boost: "speed_recovery_supply",
    step: 2
}, {
    title: "Великий угнетатель",
    descr: "Увеличивает лимит побед над боссами на 1 ед.",
    amount: 30,
    boost: "bosses_win",
    step: 1
}, {
    title: "Эффект кумулятивного",
    descr: "Увеличивает урон кумулятивного снаряда на 1800 ед.",
    amount: 20,
    boost: "weapon_6",
    step: 1800
} ] ];

window["talents_price_paid_fight"] = 30;

window["news"] = [ {
    descr: "Генерал! Специальное предложение от Верховного Главнокомандования ожидает вас в магазине.",
    image: "https://cdn.bravegames.space/regiment/images/news/tickets_x2.png",
    action: "show_shop",
    requirement: "",
    start_time: 1652029200,
    period: 2 * 86400
}, {
    descr: "Генерал! Присоединяйтесь к боевым товарищам и наносите сокрушительный урон по боссам.",
    image: "https://cdn.bravegames.space/regiment/images/news/global_raid.png",
    action: "show_raids",
    requirement: "",
    start_time: 1652054400,
    period: 2 * 86400
}, {
    descr: "Генерал! Самое время объедениться с товарищами и дать отпор немецкому оккупанту. Настигла угроза небывалых масштабов!",
    image: "https://cdn.bravegames.space/regiment/images/news/rommel.png",
    action: "show_raids",
    requirement: "",
    start_time: 1651968e3,
    period: 3 * 86400
}, {
    descr: "Генерал! Самое время получить заслуженную увеличенную награду за победу над опасными врагами.",
    image: "https://cdn.bravegames.space/regiment/images/news/enlarged_reward.png",
    action: "show_raids",
    requirement: "",
    start_time: 1652054400,
    period: 2 * 86400
}, {
    descr: "Генерал! Проходите миссии, наносите урон и зарабатывайте опыт боевого рюкзака, который можно обменять на ценную награду.",
    image: "https://cdn.bravegames.space/regiment/images/news/backpack.png",
    action: "show_raids",
    requirement: "",
    start_time: 1651911729,
    period: 30 * 86400
}, {
    descr: "Генерал! На фронте появился новый враг, но только сильнейшие смогут одержать победу. Вперёд в атаку!",
    image: "https://cdn.bravegames.space/regiment/images/news/paulus.png",
    action: "show_raids",
    requirement: "",
    start_time: 1651911729,
    period: 30 * 86400
}, {
    descr: "Генерал! Наносите урон по врагам и получайте дополнительную награду за нанесённый урон.",
    image: "https://cdn.bravegames.space/regiment/images/news/additional_reward.png",
    action: "show_raids",
    requirement: "",
    start_time: 1651911729,
    period: 30 * 86400
}, {
    descr: "Генералы! Полковник Данилов прибыл в Ваше распоряжение и готов оказать помощь в борьбе против немецких оккупантов.",
    image: "https://cdn.bravegames.space/regiment/images/news/subscription_full2.png",
    action: "show_subscription",
    requirement: "",
    start_time: 1646388214,
    period: 30 * 86400
}, {
    descr: "Генералы! Главнокомандование сообщает об открытии нового фронта.<br>-------------------------------------------------------------------------<br>Вперёд на защиту Родины!",
    image: "https://cdn.bravegames.space/regiment/images/news/front_brest.png",
    action: "show_missions",
    requirement: "",
    start_time: 1647843604,
    period: 30 * 86400
}, {
    descr: "Генералы! Главнокомандование сообщает о доступности талантов.<br>-------------------------------------------------------------------------<br>Время действовать!",
    image: "https://cdn.bravegames.space/regiment/images/news/talents.png",
    action: "show_talents",
    requirement: "level_10",
    start_time: 1640563200,
    period: 30 * 86400
} ];

window["subscription"] = [ {
    price: 50
}, {
    price: 100
} ];

window["backpack_levels"] = [ 0, 1050, 2625, 4725, 7350, 10500, 14175, 18375, 23100, 28350, 34125, 40425, 47250, 54600, 62475, 70875, 79800, 89250, 99225, 109725 ];

window["backpack_weapons"] = [ 30, 35, 40, 50, 80, 110, 180 ];

window["backpack_price"] = 50;

window["backpack_hit"] = 5;

window["offer"] = {
    start_time: 1652054400,
    finish_time: 1652227200,
    power: 300
};

window["multiplication"] = {
    start_time: 1652054400,
    finish_time: 1652227200,
    multiplier: 2
};
